{
  "directed": true,
  "multigraph": false,
  "graph": {
    "session_id": "52427567",
    "original_query": "Mahindra has launched a new vehicle called xuv 3xo, I want to know feature details, digital features, safety features, price etc. Fetch information from multiple URLs. Compile a detailed report into a report which structured and formatted; then translate it into a beautiful well formatted webpage to view the report",
    "file_manifest": [],
    "created_at": "2025-07-13T17:26:07.517253",
    "status": "running",
    "output_chain": {
      "T001": {
        "xuv3xo_urls": [
          {
            "type": "text",
            "text": "[{'url': 'https://ackodrive.com/car-guide/mahindra-xuv-3xo-features-explained/', 'content': 'HOME BUY NEW CAR BLOG Home / Articles / Car Guide / Mahindra XUV 3XO Features Explained: A Comprehensive Guide. Mahindra XUV 3XO Features Explained: A Comprehensive Guide. Published on 27 Aug, 2024, 9:41 AM IST Updated on 28 Aug, 2024, 5:59 AM IST Team Ackodrive 8 min read Interesting Articles Follow us on Share Post Mahindra recently launched the much-awaited Mahindra XUV 3XO as a compact SUV in the Indian automotive industry. Outperforming its rivals, the Tata Nexon, Hyundai Venue and Maruti Suzuki Brezza, the Mahindra XUV 3XO brings a fresh look to the segment. With the latest updates and comfortable features, the Mahindra XUV 3XO is on the list of must-buy compact SUVs in India. Here, we will take a closer look at the Mahindra XUV 3XO features explained and help you choose the ideal car. Contents Price of Mahindra XUV 3XO Variants After the Mahindra XUV 3XO features are explained, you must know the price of each variant. Hence, we have prepared a table for you highlighting the ex-showroom price of each XUV 3XO variant: Mahindra XUV 3XO Variant Ex-Showroom Price MX1 Rs. 7.49 Lakhs MX2 Rs. 9.99 Lakhs MX2 PRO Rs. 8.99 Lakhs to Rs. 10.39 Lakhs MX3 Rs. 9.49 Lakhs to Rs. 11.68 Lakhs MX3 PRO Rs. 9.99 Lakhs to Rs. 11.49 Lakhs AX5 Rs. 10.69 Lakhs to Rs. 12.88 Lakhs AX5 Luxury Rs. 11.99 Lakhs to Rs. 13.49 Lakhs AX7 Rs. 12.49 Lakhs to Rs. 14.49 Lakhs AX7 Luxury Rs. 13.99 Lakhs to Rs. 15.49 Lakhs Note : The prices of the Mahindra XUV 3XO variants can change without any prior notice. So, before booking your car, talk with your nearest dealer to know the latest price. Check out: Mahindra XUV 3XO Variants Unlatch Elated Driving Experience with the All New Mahindra XUV 3XO Making its presence felt in the Indian compact SUV market, the Mahindra XUV 3XO is one of the best cars in this segment manufactured by Mahindra. It offers more convenience and comfort when driving on different terrains. The following are detailed discussions of the Mahindra XUV 3XO tech specs and features: 1. Influencing Exterior Look The Mahindra XUV 3XO has a specific design to turn heads with its athletic stance. It commands respect and exudes the confidence of a true SUV. The all-new Mahindra XUV 3XO has an ample ground clearance of 201 mm, making it easy for you to drive on rocky terrains. In addition, the XUV 3XO comes with a command seating position to offer an exhilarating driving experience. The Mahindra XUV 3XO has LED DRLs and headlamps that will lead the road to envy you whenever you turn them on. Furthermore, the infinity tail lamps add an X factor to your style quotient. The car also features 17-inch diamond-cut alloy wheels for that sporty look. Check out: Mahindra XUV 3XO Dimensions 2. Comforting Interior When you drive the Mahindra XUV 3XO, it elevates your every journey. Stepping inside the XUV 3XOs cabin will let you discover a sanctuary of sophistication and comfort. It is one of the key parts of the Mahindra XUV 3XO features explained, as it has a meticulous design for the finest SUV lovers. The Mahindra XUV 3XO features a Skyroof and soft-touch leatherette on the door trims and dashboard. Furthermore, the car has premium leatherette seats, a cooled glovebox with illumination, and a passive keyless entry. It also features a front armrest with storage and a console with a cup holder for a comfortable drive. Check out: Mahindra XUV 3XO Interior 3. Smart Connectivity Another key Mahindra XUV 3XO configuration is its smart connectivity and technology. The car comes with a Harman Kardon 7-speaker audio system to make your drive enjoyable. In addition, the sound system lets you experience sonic expanse, and the bass enhancer technology uplifts your mood while driving in crowded areas. The Mahindra XUV 3XO features a high-definition touchscreen system for infotainment and navigation and has built-in Amazon Alexa for entertainment. Moreover, with the ADRENOX Connect technology, you can control your cars features through your smartphone from the comfort of', 'images': [{'url': 'https://acko-cms.ackoassets.com/image_21_09398560b1.webp', 'alt_text': 'image_21_09398560b1.webp', 'loading': 'lazy', 'confidence': 0.7}, {'url': 'https://acko-cms.ackoassets.com/Mahindra_XUV_3_XO_1_50764da01b.png', 'alt_text': 'Mahindra', 'width': '740', 'height': '400', 'loading': 'lazy', 'confidence': 0.7}], 'rank': 1}, {'url': 'https://auto.mahindra.com/on/demandware.static/-/Sites-amc-Library/default/dw14bf6b46/X3XO/XUV3XOProductBrochure-01-07-24.pdf', 'content': \"[error] 'charmap' codec can't encode characters in position 195-196: character maps to <undefined>\", 'rank': 2}, {'url': 'https://www.autocarindia.com/auto-features/mahindra-xuv-3xo-price-variants-features-explained-431425', 'content': \"Mahindra XUV 3XO price, variants, features explained | Autocar India All All Price News Reviews Features Specifications Images Videos All All Price News Reviews Features Specifications Images Videos Signup Login Find a Car Cars Compare Cars New Cars Upcoming Cars Car Price Car Loan Calculator Find a Bike Bikes Compare Bikes New New Bikes New Scooters Upcoming Upcoming Bikes Upcoming Scooters Electric Electric Bikes Electric Scooters Bike Price Bike Loan Calculator News Cars Bikes Motorsports Industry Marketplace Reviews Car First drive / Reviews Comparisons Video reviews Long-term reviews Bike First ride / Reviews Comparisons Video reviews Long-term reviews Features Features Travelogues Blogs Interviews Partner Content Galleries Videos Images Stories Advice Signup Login Change City Close Detect my Current Location Pick from Popular Cities Mumbai Bengaluru Delhi Pune Hyderabad Ahmedabad Chennai Kolkata Home Features Mahindra XUV 3XO price, variants, features explained Mahindra XUV 3XO price, variants, features explained The XUV 3XO recently added new RevX variants, which are offered with two turbo-petrol engine options. Published On Jul 10, 2025 04:21:00 PM 1,04,636 Views Follow us on By Saptarshi Mondal Share - The Mahindra XUV 3XO , formerly XUV300, was launched last year with all-new front and rear designs, a refreshed interior and more features, as well as new powertrain options. Currently priced from Rs 7.99 lakh to Rs 15.79 lakh, ex-showroom India, this Mahindra SUV is available in a total of 12 trim levels (see table below). In this feature, we take a closer look at what features and engine options you get with each trim. Mahindra XUV 3XO petrol variant prices (in Rs, lakh) Petrol-MT Petrol-AT Diesel-MT Diesel-AMT MX1 7.99 - - - RevX M 8.94 - - - RevX M(O) 9.44 - - - MX2 - - 9.99 - MX2 Pro 9.54 10.54 10.64 - MX3 9.74 11.40 10.99 11.79 MX3 Pro 9.99 11.69 11.56 - AX5 11.19 12.69 12.19 12.99 RevX A T-GDI 11.79 12.99 - - AX5L T-GDI 12.62 13.94 - - AX7 T-GDI 12.80 13.99 13.69 14.70 AX7L T-GDI 13.99 15.80 14.99 - Mahindra XUV 3XO variant-wise powertrains The XUV 3XO's engine options include a 111hp, 200Nm, 1.2-litre turbo-petrol engine, 131hp, 230Nm, 1.2-litre TGDI engine and 117hp, 300Nm, and 1.5-litre diesel engine.A 6-speed manual gearbox is standard with these engines.Also, both petrol engines get a 6-speed torque converter automatic gearbox, while the diesel XUV 3XO models come with a 6-speed AMT unit. The 111hp turbo-petrol engine is available on the MX1, RevX M, RevX M(O), MX2, MX2 Pro, MX3, MX3 Pro and the AX5 trims. Moving on, the 131hp turbo-petrol engine is available only on the top four trims - RevX A, AX5 L, AX7 and AX7 L. The diesel engine is available nearly across the board, starting from the fourth-from-base MX2 trim. Here's a look at the variant split of the new XUV 3XO. Mahindra XUV 3XO variant-wise features XUV 3XO MX1 Price: Rs 7.99 lakh; powertrain - 111hp turbo petrol-MT Halogen projector headlamps LED daytime running lamps LED indicator on wing mirrors, LED tail lamps 6 airbags Electronic Stability Control (ESC) 16-inch steel wheels Electrically adjustable wing mirrors Engine start/stop Front armrest with storage 60:40 split rear seat Rear AC vents Adjustable headrest for second row Seat belt reminder for all passengers 3-point seat belt for all passengers XUV 3XO RevX M Price: Rs 8.94 lakh; powertrain - 111hp turbo petrol-MT Features over MX1 Dual-tone roof Body-coloured grille Wheel covers Black Leatherette Seats 10.25-inch touchscreen 4 speakers Steering-mounted audio controls Remote keyless entry Mahindra XUV 3XO RevX M(O) Price: Rs 9.44 lakh; powertrain - 111hp turbo petrol-MT Features over RevX M Single-pane sunroof Mahindra XUV 3XO MX2 Price: Rs 9.99 lakh; engine options - 117hp diesel-MT Features over MX1 10.25-inch touchscreen 4 speakers Steering-mounted controls Remote keyless entry Mahindra XUV 3XO MX2 Pro Price: Rs 9.54 lakh-10.64 lakh; powertrains - 111hp turbo petrol-MT/AT; diesel-MT Featu\", 'images': [{'url': 'https://img.autocarindia.com/Features/Mahindra XUV 3XO Variants.jpg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO red colour', 'title': 'Mahindra XUV 3XO price, variants, features explained', 'class': 'img-fluid ne-lis-img', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/model/uploads/modelimages/Mahindra-XUV-3XO-290420241902.jpg', 'alt_text': 'Latest Image of Mahindra XUV 3XO', 'title': 'Mahindra XUV 3XO', 'class': 'img-fluid wid-img', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/Galleries/20250708042739_Mahindra_XUV_3XO_REVX_Front_Static.jpg?w=234&h=156&q=90&c=1', 'alt_text': 'Mahindra XUV 3XO RevX image gallery', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/ExtraImages/20241119094249_Mahindra_XUV_3XO_video_review.jpg?w=234&h=156&q=90&c=1', 'alt_text': 'Mahindra XUV 3XO AX5 video review', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/Videos/skodavsmahindra.jpg?w=234&h=156&q=90&c=1', 'alt_text': 'Skoda Kylaq vs Mahindra XUV 3XO comparison video', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7}], 'rank': 3}, {'url': 'https://www.spinny.com/cars/mahindra/xuv-3xo/', 'content': \"Mahindra XUV 3XO - Complete Overview of Features, Pricing and Reviews Overview Specs & Features Pricing & Variants Expert's Review User's Review F.A.Qs Colours Best Used Cars Images & Videos 9 Colors 40 Images Mahindra XUV 3XO from 4 users The Mahindra XUV 3XO is a compact SUV that seamlessly blends bold design with advanced technology. Its dynamic styling, spacious interiors, and feature-rich offerings make it a compelling choice for modern urban drivers. Whether navigating city streets or embarking on weekend getaways, the XUV 3XO delivers a comfortable and engaging driving experience. 7.99 - 15.80 Lakh ON-ROAD PRICE * Ex-Showroom Price Certified Used Cars from Spinny 1 Year Warranty Home Test Drives 5 Day Money Back Guarantee VIEW ALL USED XUV 3XO CARS Latest Update Launched in April 2024, the Mahindra XUV 3XO is a refreshed version of the XUV300, featuring significant upgrades in design and technology. The SUV boasts a bold front grille, connected LED tail lamps, and a panoramic sunroof, enhancing its visual appeal. Inside, it offers dual 10.25-inch displays for the infotainment system and driver's instrument cluster, wireless charging, and a cooled glove box. Safety has been prioritized with the inclusion of Level 2 Advanced Driver Assistance Systems (ADAS), a 360-degree camera, six airbags, and electronic stability control . Mahindra XUV 3XO Overview The Mahindra XUV 3XO is a compact SUV that seamlessly blends bold design with advanced technology. Its dynamic styling, spacious interiors, and feature-rich offerings make it a compelling choice for modern urban drivers. Whether navigating city streets or embarking on weekend getaways, the XUV 3XO delivers a comfortable and engaging driving experience. Mahindra XUV 3XO Specifications & Features Ground clearance -- Wheelbase 2600 Boot space 364 Acceleration (0-100 kmph) -- Transmission type Manual Displacement 1497 Max power (bhp) 115 bhp@3750rpm Mileage (ARAI) 20.6 Fuel Type diesel Mahindra XUV 3XO Key Features Versatile Powertrain Options Advanced Safety Features Premium Interior and Comfort Modern Exterior Design View All SPECS & FEATURES Mahindra XUV 3XO Pricing & Variants In the Indian used car market, the Mahindra XUV 3XO is available across a range of prices, influenced by factors such as model year, variant, and condition. Prices typically start around 7.99 lakh for earlier models and can go up to 15.56 lakh for newer, top-tier variants . This range offers options for various budgets, making the XUV 3XO an attractive choice for those seeking a reliable and stylish compact SUV. Popular Variants On-Road Price * in Delhi No Variants Found Get The Best Used Cars In Your Budget 1 - 2 Lakh 2 - 4 Lakh 4 - 6 Lakh 6 - 10 Lakh Mahindra XUV 3XO Expert's Review 4.0 The Mahindra XUV 3XO emerges as a significant evolution in the subcompact SUV segment, building upon the foundation laid by its predecessor, the XUV300. With a bold new design, enhanced features, and advanced safety technologies, the XUV 3XO aims to cater to the modern urban driver. Under the hood, it offers a choice of efficient petrol and diesel engines, paired with both manual and automatic transmissions, ensuring versatility for various driving preferences. Inside, the cabin boasts a contemporary layout with a 10.25-inch touchscreen infotainment system, digital instrument cluster, and a panoramic sunroof, elevating the overall driving experience. In this expert review, we delve into the XUV 3XO's offerings to assess its position in the competitive compact SUV market. Exterior Design 4/5 Paint Quality 4/5 Panel Gaps 4/5 Interior Design 4/5 Space 4/5 Comfort 4/5 Read Full Review Pros & Cons of Mahindra XUV 3XO Pros Striking exterior design with modern styling elements. Feature-rich interior with premium materials and advanced technology. Comprehensive safety suite with a 5-star Bharat NCAP rating. Multiple engine options catering to different driving needs. Cons Some advanced features are reserved for higher variants\", 'images': [{'url': 'https://media.spinny.com/sp-file-system/public/2025-02-07/df136fb0d64b4fa6a4bc999b2cf16909/file.JPG?q=85', 'alt_text': 'New Mahindra XUV 3XO exterior LEFT FRONT CORNER VIEW', 'class': 'Image__animateOpacity ImageSlider__img', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://media.spinny.com/sp-file-system/public/2025-02-07/850a1fe3537041e38fad4e1f956446fb/file.JPG?q=85', 'alt_text': 'New Mahindra XUV 3XO exterior LEFT SIDE VIEW', 'class': 'Image__animateOpacity ImageSlider__img', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://media.spinny.com/sp-file-system/public/2025-02-07/df136fb0d64b4fa6a4bc999b2cf16909/file.JPG?q=85', 'alt_text': 'New Mahindra XUV 3XO exterior LEFT FRONT CORNER VIEW', 'class': 'Image__animateOpacity ImageSlider__img', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://mda.spinny.com/sp-file-system/public/2025-04-21/2e54d4e30d2b4bb18fd31a8c92d78e06/raw/file.png', 'alt_text': 'New Mahindra XUV 3XO Everest White', 'class': 'ColorOptions__currentCarDisplayContainerImage', 'confidence': 0.7}, {'url': 'https://mda.spinny.com/sp-file-system/public/2025-04-21/e9939be9416447e69d92aa3591b2edb6/raw/file.png', 'alt_text': 'New Mahindra XUV 3XO Citrine Yellow', 'class': 'ColorOptions__currentCarDisplayContainerImage', 'confidence': 0.7}], 'rank': 4}, {'url': 'https://www.policybazaar.com/new-cars/mahindra/xuv-3xo/', 'content': 'Mahindra Xuv 3xo Price - Check Xuv 3xo Car Images, Colours and Features Claim Get The App Sales: 1800-208-8787 Service: 1800-258-5970 Claims: 1800-258-5881 Contact Us Sign In Term Insurance Term Insurance Plan Term Insurance Terminology What is term Insurance Full Refund Of Premium Term Plan Term Insurance for NRI Term Insurance for Women Term Insurance for Housewife List of Term Insurance Plan Life Insurance 1 Crore Term Insurance Term Insurance Calculator Term Insurance Return of Premium Saral Jeevan Bima Dedicated Claim Assistance Term Insurance for HNI Investment Plans Investment Plans with High Returns Market Linked Investment Plans (ULIP) Investment Plans for NRIs SIP Calculator Child Plans Capital Guarantee Plans Pension Plans Guaranteed Return Plans Tax Saving Investments SIP (Systematic Investment Plan) Endowment Policy LIC Money Back Policy Annuity Plans Income Tax Calculator Health Insurance Health Insurance Plans Book Free Home Visit Family Health Insurance Senior Citizen Health Insurance Health Insurance for Parents List of Health Insurance Plans Maternity Insurance Health Insurance Portability OPD Cover In Health Insurance Mediclaim Policy Critical Illness Insurance Health Insurance Calculator Health Insurance Companies Types of Health Insurance Health Insurance for NRIs Motor Insurance Motor Insurance Car Insurance Bike Insurance Zero Dep Car Insurance Third Party Insurance Third Party Bike Insurance Car Insurance Calculator Bike Insurance Calculator Car Insurance Companies Pay As You Drive Insurance Commercial Vehicle Insurance Electric Car Insurance e-bike Insurance IDV Calculator Comprehensive Insurance Car Valuation Other Insurance Other Insurance Travel Insurance International Travel Insurance Schengen travel insurance Home Insurance Home Loan Insurance Directors & Officers Insurance Transit Insurance Hull Insurance CPM Insurance Contractors all risk insurance Cancer Insurance Defence Personnel Insurance Pet Insurance General Insurance Business Insurance Business Insurance Group Health Insurance Group Insurance Fire Insurance Shopkeepers Insurance Office Insurance Marine Insurance Cargo Insurance Workmen Compensation Policy Labour Insurance Professional Indemnity Insurance Doctors Indemnity Insurance Comprehensive General Liability Insurance Cyber Insurance Personal Cyber Insurance Drone Insurance Renewal Term Life Renewal Investment Renewal Health Renewal Motor Renewal Two Wheeler Renewal Home Insurance Renewal My Account Register a Complaint Sales 1800-208-8787 Service 1800-258-5970 Download Mobile App googleplay ios Sign In My Account Claims Assistance Calling Preference Logout Home Mahindra Xuv 3xo Xuv 3xo Specs Variants MAHINDRA XUV 3XO Change car The Mahindra Xuv 3xo price in India starts at Rs. 7.99 Lakh for the MX1 (mStallion TCMPFi) while the most expensive Mahindra Xuv 3xo in India is the AX7 L AT(Top Model) (mStallion TGDI), priced at Rs. 15.57 Lakh (ex-showroom). Mahindra Xuv 3xo has 25 variants across 2 fuel types; Petrol,Diesel and comes with both Manual and Automatic transmission options. Read more Ex showroom price in Delhi 7.99 Lakh - 15.57 Lakh* Xuv 3xo On Road Price Looking to buy a new car? Know how much you can save on new car insurance with Policybazaar View insurance plans Xuv 3xo Price in India Popular city Nearby city City name On-road price Delhi 8.78 - 17.39 Lakh Hyderabad 9.30 - 18.45 Lakh Mumbai 9.07 - 17.70 Lakh Bengaluru 9.42 - 18.73 Lakh Chennai 9.23 - 18.62 Lakh Ahmedabad 8.65 - 16.73 Lakh Coimbatore 9.23 - 18.62 Lakh Kolkata 8.98 - 17.35 Lakh Chandigarh 8.99 - 17.68 Lakh Gurgaon 8.82 - 17.05 Lakh City name On-road price Noida 8.82 - 17.36 Lakh Ghaziabad 8.82 - 17.36 Lakh Faridabad 8.82 - 17.05 Lakh Gurgaon 8.82 - 17.05 Lakh Sonipat 8.82 - 17.05 Lakh Meerut 8.82 - 17.36 Lakh Rohtak 8.82 - 17.05 Lakh Karnal 8.82 - 17.05 Lakh Alwar 9.01 - 17.40 Lakh Moradabad 8.82 - 17.36 Lakh Save up to 43,690 on car insurance with policybazaar Popular Mahindra Cars Mahind', 'images': [{'url': 'https://static.pbcdn.in/car-cdn/ModelImg/743.png', 'alt_text': 'Mahindra Xuv 3xo', 'width': '314', 'height': '212', 'confidence': 0.8999999999999999}], 'rank': 5}, {'url': 'https://automotivemahindra.com/mahindra-xuv-3xo-an-in-depth-specification-breakdown/', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://cargraze.com/blog/2025-mahindra-xuv-3xo-specs-design-performance-and-safety', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://www.carwale.com/mahindra-cars/xuv-3xo/', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null,
            "_meta": null
          }
        ]
      }
    },
    "validation_results": {
      "is_valid": true,
      "is_dag": true,
      "cycles": [],
      "disconnected_components": [],
      "orphaned_nodes": [],
      "root_nodes": [],
      "leaf_nodes": [
        "T005"
      ],
      "warnings": [],
      "errors": []
    }
  },
  "nodes": [
    {
      "description": "Initial Query",
      "agent": "System",
      "status": "completed",
      "id": "ROOT"
    },
    {
      "id": "T001",
      "description": "Find multiple relevant URLs containing feature details, digital features, safety features, and price information about the Mahindra XUV 3XO.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Find at least 5 relevant URLs that contain detailed information about the Mahindra XUV 3XO, focusing on feature details, digital features, safety features, and price. Make sure to provide a diverse set of links from official sources, news articles, and reliable blogs. Prioritize comprehensive pages and avoid promotional or superficial content.",
      "reads": [],
      "writes": [
        "T001"
      ],
      "status": "completed",
      "output": {
        "xuv3xo_urls": [
          {
            "type": "text",
            "text": "[{'url': 'https://ackodrive.com/car-guide/mahindra-xuv-3xo-features-explained/', 'content': 'HOME BUY NEW CAR BLOG Home / Articles / Car Guide / Mahindra XUV 3XO Features Explained: A Comprehensive Guide. Mahindra XUV 3XO Features Explained: A Comprehensive Guide. Published on 27 Aug, 2024, 9:41 AM IST Updated on 28 Aug, 2024, 5:59 AM IST Team Ackodrive 8 min read Interesting Articles Follow us on Share Post Mahindra recently launched the much-awaited Mahindra XUV 3XO as a compact SUV in the Indian automotive industry. Outperforming its rivals, the Tata Nexon, Hyundai Venue and Maruti Suzuki Brezza, the Mahindra XUV 3XO brings a fresh look to the segment. With the latest updates and comfortable features, the Mahindra XUV 3XO is on the list of must-buy compact SUVs in India. Here, we will take a closer look at the Mahindra XUV 3XO features explained and help you choose the ideal car. Contents Price of Mahindra XUV 3XO Variants After the Mahindra XUV 3XO features are explained, you must know the price of each variant. Hence, we have prepared a table for you highlighting the ex-showroom price of each XUV 3XO variant: Mahindra XUV 3XO Variant Ex-Showroom Price MX1 Rs. 7.49 Lakhs MX2 Rs. 9.99 Lakhs MX2 PRO Rs. 8.99 Lakhs to Rs. 10.39 Lakhs MX3 Rs. 9.49 Lakhs to Rs. 11.68 Lakhs MX3 PRO Rs. 9.99 Lakhs to Rs. 11.49 Lakhs AX5 Rs. 10.69 Lakhs to Rs. 12.88 Lakhs AX5 Luxury Rs. 11.99 Lakhs to Rs. 13.49 Lakhs AX7 Rs. 12.49 Lakhs to Rs. 14.49 Lakhs AX7 Luxury Rs. 13.99 Lakhs to Rs. 15.49 Lakhs Note : The prices of the Mahindra XUV 3XO variants can change without any prior notice. So, before booking your car, talk with your nearest dealer to know the latest price. Check out: Mahindra XUV 3XO Variants Unlatch Elated Driving Experience with the All New Mahindra XUV 3XO Making its presence felt in the Indian compact SUV market, the Mahindra XUV 3XO is one of the best cars in this segment manufactured by Mahindra. It offers more convenience and comfort when driving on different terrains. The following are detailed discussions of the Mahindra XUV 3XO tech specs and features: 1. Influencing Exterior Look The Mahindra XUV 3XO has a specific design to turn heads with its athletic stance. It commands respect and exudes the confidence of a true SUV. The all-new Mahindra XUV 3XO has an ample ground clearance of 201 mm, making it easy for you to drive on rocky terrains. In addition, the XUV 3XO comes with a command seating position to offer an exhilarating driving experience. The Mahindra XUV 3XO has LED DRLs and headlamps that will lead the road to envy you whenever you turn them on. Furthermore, the infinity tail lamps add an X factor to your style quotient. The car also features 17-inch diamond-cut alloy wheels for that sporty look. Check out: Mahindra XUV 3XO Dimensions 2. Comforting Interior When you drive the Mahindra XUV 3XO, it elevates your every journey. Stepping inside the XUV 3XOs cabin will let you discover a sanctuary of sophistication and comfort. It is one of the key parts of the Mahindra XUV 3XO features explained, as it has a meticulous design for the finest SUV lovers. The Mahindra XUV 3XO features a Skyroof and soft-touch leatherette on the door trims and dashboard. Furthermore, the car has premium leatherette seats, a cooled glovebox with illumination, and a passive keyless entry. It also features a front armrest with storage and a console with a cup holder for a comfortable drive. Check out: Mahindra XUV 3XO Interior 3. Smart Connectivity Another key Mahindra XUV 3XO configuration is its smart connectivity and technology. The car comes with a Harman Kardon 7-speaker audio system to make your drive enjoyable. In addition, the sound system lets you experience sonic expanse, and the bass enhancer technology uplifts your mood while driving in crowded areas. The Mahindra XUV 3XO features a high-definition touchscreen system for infotainment and navigation and has built-in Amazon Alexa for entertainment. Moreover, with the ADRENOX Connect technology, you can control your cars features through your smartphone from the comfort of', 'images': [{'url': 'https://acko-cms.ackoassets.com/image_21_09398560b1.webp', 'alt_text': 'image_21_09398560b1.webp', 'loading': 'lazy', 'confidence': 0.7}, {'url': 'https://acko-cms.ackoassets.com/Mahindra_XUV_3_XO_1_50764da01b.png', 'alt_text': 'Mahindra', 'width': '740', 'height': '400', 'loading': 'lazy', 'confidence': 0.7}], 'rank': 1}, {'url': 'https://auto.mahindra.com/on/demandware.static/-/Sites-amc-Library/default/dw14bf6b46/X3XO/XUV3XOProductBrochure-01-07-24.pdf', 'content': \"[error] 'charmap' codec can't encode characters in position 195-196: character maps to <undefined>\", 'rank': 2}, {'url': 'https://www.autocarindia.com/auto-features/mahindra-xuv-3xo-price-variants-features-explained-431425', 'content': \"Mahindra XUV 3XO price, variants, features explained | Autocar India All All Price News Reviews Features Specifications Images Videos All All Price News Reviews Features Specifications Images Videos Signup Login Find a Car Cars Compare Cars New Cars Upcoming Cars Car Price Car Loan Calculator Find a Bike Bikes Compare Bikes New New Bikes New Scooters Upcoming Upcoming Bikes Upcoming Scooters Electric Electric Bikes Electric Scooters Bike Price Bike Loan Calculator News Cars Bikes Motorsports Industry Marketplace Reviews Car First drive / Reviews Comparisons Video reviews Long-term reviews Bike First ride / Reviews Comparisons Video reviews Long-term reviews Features Features Travelogues Blogs Interviews Partner Content Galleries Videos Images Stories Advice Signup Login Change City Close Detect my Current Location Pick from Popular Cities Mumbai Bengaluru Delhi Pune Hyderabad Ahmedabad Chennai Kolkata Home Features Mahindra XUV 3XO price, variants, features explained Mahindra XUV 3XO price, variants, features explained The XUV 3XO recently added new RevX variants, which are offered with two turbo-petrol engine options. Published On Jul 10, 2025 04:21:00 PM 1,04,636 Views Follow us on By Saptarshi Mondal Share - The Mahindra XUV 3XO , formerly XUV300, was launched last year with all-new front and rear designs, a refreshed interior and more features, as well as new powertrain options. Currently priced from Rs 7.99 lakh to Rs 15.79 lakh, ex-showroom India, this Mahindra SUV is available in a total of 12 trim levels (see table below). In this feature, we take a closer look at what features and engine options you get with each trim. Mahindra XUV 3XO petrol variant prices (in Rs, lakh) Petrol-MT Petrol-AT Diesel-MT Diesel-AMT MX1 7.99 - - - RevX M 8.94 - - - RevX M(O) 9.44 - - - MX2 - - 9.99 - MX2 Pro 9.54 10.54 10.64 - MX3 9.74 11.40 10.99 11.79 MX3 Pro 9.99 11.69 11.56 - AX5 11.19 12.69 12.19 12.99 RevX A T-GDI 11.79 12.99 - - AX5L T-GDI 12.62 13.94 - - AX7 T-GDI 12.80 13.99 13.69 14.70 AX7L T-GDI 13.99 15.80 14.99 - Mahindra XUV 3XO variant-wise powertrains The XUV 3XO's engine options include a 111hp, 200Nm, 1.2-litre turbo-petrol engine, 131hp, 230Nm, 1.2-litre TGDI engine and 117hp, 300Nm, and 1.5-litre diesel engine.A 6-speed manual gearbox is standard with these engines.Also, both petrol engines get a 6-speed torque converter automatic gearbox, while the diesel XUV 3XO models come with a 6-speed AMT unit. The 111hp turbo-petrol engine is available on the MX1, RevX M, RevX M(O), MX2, MX2 Pro, MX3, MX3 Pro and the AX5 trims. Moving on, the 131hp turbo-petrol engine is available only on the top four trims - RevX A, AX5 L, AX7 and AX7 L. The diesel engine is available nearly across the board, starting from the fourth-from-base MX2 trim. Here's a look at the variant split of the new XUV 3XO. Mahindra XUV 3XO variant-wise features XUV 3XO MX1 Price: Rs 7.99 lakh; powertrain - 111hp turbo petrol-MT Halogen projector headlamps LED daytime running lamps LED indicator on wing mirrors, LED tail lamps 6 airbags Electronic Stability Control (ESC) 16-inch steel wheels Electrically adjustable wing mirrors Engine start/stop Front armrest with storage 60:40 split rear seat Rear AC vents Adjustable headrest for second row Seat belt reminder for all passengers 3-point seat belt for all passengers XUV 3XO RevX M Price: Rs 8.94 lakh; powertrain - 111hp turbo petrol-MT Features over MX1 Dual-tone roof Body-coloured grille Wheel covers Black Leatherette Seats 10.25-inch touchscreen 4 speakers Steering-mounted audio controls Remote keyless entry Mahindra XUV 3XO RevX M(O) Price: Rs 9.44 lakh; powertrain - 111hp turbo petrol-MT Features over RevX M Single-pane sunroof Mahindra XUV 3XO MX2 Price: Rs 9.99 lakh; engine options - 117hp diesel-MT Features over MX1 10.25-inch touchscreen 4 speakers Steering-mounted controls Remote keyless entry Mahindra XUV 3XO MX2 Pro Price: Rs 9.54 lakh-10.64 lakh; powertrains - 111hp turbo petrol-MT/AT; diesel-MT Featu\", 'images': [{'url': 'https://img.autocarindia.com/Features/Mahindra XUV 3XO Variants.jpg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO red colour', 'title': 'Mahindra XUV 3XO price, variants, features explained', 'class': 'img-fluid ne-lis-img', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/model/uploads/modelimages/Mahindra-XUV-3XO-290420241902.jpg', 'alt_text': 'Latest Image of Mahindra XUV 3XO', 'title': 'Mahindra XUV 3XO', 'class': 'img-fluid wid-img', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/Galleries/20250708042739_Mahindra_XUV_3XO_REVX_Front_Static.jpg?w=234&h=156&q=90&c=1', 'alt_text': 'Mahindra XUV 3XO RevX image gallery', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/ExtraImages/20241119094249_Mahindra_XUV_3XO_video_review.jpg?w=234&h=156&q=90&c=1', 'alt_text': 'Mahindra XUV 3XO AX5 video review', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/Videos/skodavsmahindra.jpg?w=234&h=156&q=90&c=1', 'alt_text': 'Skoda Kylaq vs Mahindra XUV 3XO comparison video', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7}], 'rank': 3}, {'url': 'https://www.spinny.com/cars/mahindra/xuv-3xo/', 'content': \"Mahindra XUV 3XO - Complete Overview of Features, Pricing and Reviews Overview Specs & Features Pricing & Variants Expert's Review User's Review F.A.Qs Colours Best Used Cars Images & Videos 9 Colors 40 Images Mahindra XUV 3XO from 4 users The Mahindra XUV 3XO is a compact SUV that seamlessly blends bold design with advanced technology. Its dynamic styling, spacious interiors, and feature-rich offerings make it a compelling choice for modern urban drivers. Whether navigating city streets or embarking on weekend getaways, the XUV 3XO delivers a comfortable and engaging driving experience. 7.99 - 15.80 Lakh ON-ROAD PRICE * Ex-Showroom Price Certified Used Cars from Spinny 1 Year Warranty Home Test Drives 5 Day Money Back Guarantee VIEW ALL USED XUV 3XO CARS Latest Update Launched in April 2024, the Mahindra XUV 3XO is a refreshed version of the XUV300, featuring significant upgrades in design and technology. The SUV boasts a bold front grille, connected LED tail lamps, and a panoramic sunroof, enhancing its visual appeal. Inside, it offers dual 10.25-inch displays for the infotainment system and driver's instrument cluster, wireless charging, and a cooled glove box. Safety has been prioritized with the inclusion of Level 2 Advanced Driver Assistance Systems (ADAS), a 360-degree camera, six airbags, and electronic stability control . Mahindra XUV 3XO Overview The Mahindra XUV 3XO is a compact SUV that seamlessly blends bold design with advanced technology. Its dynamic styling, spacious interiors, and feature-rich offerings make it a compelling choice for modern urban drivers. Whether navigating city streets or embarking on weekend getaways, the XUV 3XO delivers a comfortable and engaging driving experience. Mahindra XUV 3XO Specifications & Features Ground clearance -- Wheelbase 2600 Boot space 364 Acceleration (0-100 kmph) -- Transmission type Manual Displacement 1497 Max power (bhp) 115 bhp@3750rpm Mileage (ARAI) 20.6 Fuel Type diesel Mahindra XUV 3XO Key Features Versatile Powertrain Options Advanced Safety Features Premium Interior and Comfort Modern Exterior Design View All SPECS & FEATURES Mahindra XUV 3XO Pricing & Variants In the Indian used car market, the Mahindra XUV 3XO is available across a range of prices, influenced by factors such as model year, variant, and condition. Prices typically start around 7.99 lakh for earlier models and can go up to 15.56 lakh for newer, top-tier variants . This range offers options for various budgets, making the XUV 3XO an attractive choice for those seeking a reliable and stylish compact SUV. Popular Variants On-Road Price * in Delhi No Variants Found Get The Best Used Cars In Your Budget 1 - 2 Lakh 2 - 4 Lakh 4 - 6 Lakh 6 - 10 Lakh Mahindra XUV 3XO Expert's Review 4.0 The Mahindra XUV 3XO emerges as a significant evolution in the subcompact SUV segment, building upon the foundation laid by its predecessor, the XUV300. With a bold new design, enhanced features, and advanced safety technologies, the XUV 3XO aims to cater to the modern urban driver. Under the hood, it offers a choice of efficient petrol and diesel engines, paired with both manual and automatic transmissions, ensuring versatility for various driving preferences. Inside, the cabin boasts a contemporary layout with a 10.25-inch touchscreen infotainment system, digital instrument cluster, and a panoramic sunroof, elevating the overall driving experience. In this expert review, we delve into the XUV 3XO's offerings to assess its position in the competitive compact SUV market. Exterior Design 4/5 Paint Quality 4/5 Panel Gaps 4/5 Interior Design 4/5 Space 4/5 Comfort 4/5 Read Full Review Pros & Cons of Mahindra XUV 3XO Pros Striking exterior design with modern styling elements. Feature-rich interior with premium materials and advanced technology. Comprehensive safety suite with a 5-star Bharat NCAP rating. Multiple engine options catering to different driving needs. Cons Some advanced features are reserved for higher variants\", 'images': [{'url': 'https://media.spinny.com/sp-file-system/public/2025-02-07/df136fb0d64b4fa6a4bc999b2cf16909/file.JPG?q=85', 'alt_text': 'New Mahindra XUV 3XO exterior LEFT FRONT CORNER VIEW', 'class': 'Image__animateOpacity ImageSlider__img', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://media.spinny.com/sp-file-system/public/2025-02-07/850a1fe3537041e38fad4e1f956446fb/file.JPG?q=85', 'alt_text': 'New Mahindra XUV 3XO exterior LEFT SIDE VIEW', 'class': 'Image__animateOpacity ImageSlider__img', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://media.spinny.com/sp-file-system/public/2025-02-07/df136fb0d64b4fa6a4bc999b2cf16909/file.JPG?q=85', 'alt_text': 'New Mahindra XUV 3XO exterior LEFT FRONT CORNER VIEW', 'class': 'Image__animateOpacity ImageSlider__img', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://mda.spinny.com/sp-file-system/public/2025-04-21/2e54d4e30d2b4bb18fd31a8c92d78e06/raw/file.png', 'alt_text': 'New Mahindra XUV 3XO Everest White', 'class': 'ColorOptions__currentCarDisplayContainerImage', 'confidence': 0.7}, {'url': 'https://mda.spinny.com/sp-file-system/public/2025-04-21/e9939be9416447e69d92aa3591b2edb6/raw/file.png', 'alt_text': 'New Mahindra XUV 3XO Citrine Yellow', 'class': 'ColorOptions__currentCarDisplayContainerImage', 'confidence': 0.7}], 'rank': 4}, {'url': 'https://www.policybazaar.com/new-cars/mahindra/xuv-3xo/', 'content': 'Mahindra Xuv 3xo Price - Check Xuv 3xo Car Images, Colours and Features Claim Get The App Sales: 1800-208-8787 Service: 1800-258-5970 Claims: 1800-258-5881 Contact Us Sign In Term Insurance Term Insurance Plan Term Insurance Terminology What is term Insurance Full Refund Of Premium Term Plan Term Insurance for NRI Term Insurance for Women Term Insurance for Housewife List of Term Insurance Plan Life Insurance 1 Crore Term Insurance Term Insurance Calculator Term Insurance Return of Premium Saral Jeevan Bima Dedicated Claim Assistance Term Insurance for HNI Investment Plans Investment Plans with High Returns Market Linked Investment Plans (ULIP) Investment Plans for NRIs SIP Calculator Child Plans Capital Guarantee Plans Pension Plans Guaranteed Return Plans Tax Saving Investments SIP (Systematic Investment Plan) Endowment Policy LIC Money Back Policy Annuity Plans Income Tax Calculator Health Insurance Health Insurance Plans Book Free Home Visit Family Health Insurance Senior Citizen Health Insurance Health Insurance for Parents List of Health Insurance Plans Maternity Insurance Health Insurance Portability OPD Cover In Health Insurance Mediclaim Policy Critical Illness Insurance Health Insurance Calculator Health Insurance Companies Types of Health Insurance Health Insurance for NRIs Motor Insurance Motor Insurance Car Insurance Bike Insurance Zero Dep Car Insurance Third Party Insurance Third Party Bike Insurance Car Insurance Calculator Bike Insurance Calculator Car Insurance Companies Pay As You Drive Insurance Commercial Vehicle Insurance Electric Car Insurance e-bike Insurance IDV Calculator Comprehensive Insurance Car Valuation Other Insurance Other Insurance Travel Insurance International Travel Insurance Schengen travel insurance Home Insurance Home Loan Insurance Directors & Officers Insurance Transit Insurance Hull Insurance CPM Insurance Contractors all risk insurance Cancer Insurance Defence Personnel Insurance Pet Insurance General Insurance Business Insurance Business Insurance Group Health Insurance Group Insurance Fire Insurance Shopkeepers Insurance Office Insurance Marine Insurance Cargo Insurance Workmen Compensation Policy Labour Insurance Professional Indemnity Insurance Doctors Indemnity Insurance Comprehensive General Liability Insurance Cyber Insurance Personal Cyber Insurance Drone Insurance Renewal Term Life Renewal Investment Renewal Health Renewal Motor Renewal Two Wheeler Renewal Home Insurance Renewal My Account Register a Complaint Sales 1800-208-8787 Service 1800-258-5970 Download Mobile App googleplay ios Sign In My Account Claims Assistance Calling Preference Logout Home Mahindra Xuv 3xo Xuv 3xo Specs Variants MAHINDRA XUV 3XO Change car The Mahindra Xuv 3xo price in India starts at Rs. 7.99 Lakh for the MX1 (mStallion TCMPFi) while the most expensive Mahindra Xuv 3xo in India is the AX7 L AT(Top Model) (mStallion TGDI), priced at Rs. 15.57 Lakh (ex-showroom). Mahindra Xuv 3xo has 25 variants across 2 fuel types; Petrol,Diesel and comes with both Manual and Automatic transmission options. Read more Ex showroom price in Delhi 7.99 Lakh - 15.57 Lakh* Xuv 3xo On Road Price Looking to buy a new car? Know how much you can save on new car insurance with Policybazaar View insurance plans Xuv 3xo Price in India Popular city Nearby city City name On-road price Delhi 8.78 - 17.39 Lakh Hyderabad 9.30 - 18.45 Lakh Mumbai 9.07 - 17.70 Lakh Bengaluru 9.42 - 18.73 Lakh Chennai 9.23 - 18.62 Lakh Ahmedabad 8.65 - 16.73 Lakh Coimbatore 9.23 - 18.62 Lakh Kolkata 8.98 - 17.35 Lakh Chandigarh 8.99 - 17.68 Lakh Gurgaon 8.82 - 17.05 Lakh City name On-road price Noida 8.82 - 17.36 Lakh Ghaziabad 8.82 - 17.36 Lakh Faridabad 8.82 - 17.05 Lakh Gurgaon 8.82 - 17.05 Lakh Sonipat 8.82 - 17.05 Lakh Meerut 8.82 - 17.36 Lakh Rohtak 8.82 - 17.05 Lakh Karnal 8.82 - 17.05 Lakh Alwar 9.01 - 17.40 Lakh Moradabad 8.82 - 17.36 Lakh Save up to 43,690 on car insurance with policybazaar Popular Mahindra Cars Mahind', 'images': [{'url': 'https://static.pbcdn.in/car-cdn/ModelImg/743.png', 'alt_text': 'Mahindra Xuv 3xo', 'width': '314', 'height': '212', 'confidence': 0.8999999999999999}], 'rank': 5}, {'url': 'https://automotivemahindra.com/mahindra-xuv-3xo-an-in-depth-specification-breakdown/', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://cargraze.com/blog/2025-mahindra-xuv-3xo-specs-design-performance-and-safety', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://www.carwale.com/mahindra-cars/xuv-3xo/', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null,
            "_meta": null
          }
        ]
      },
      "error": null,
      "cost": 0.0,
      "start_time": "2025-07-13T17:26:07.526782",
      "end_time": "2025-07-13T17:26:20.480703",
      "execution_time": 12.953921,
      "input_tokens": 0,
      "output_tokens": 0,
      "execution_result": null
    },
    {
      "id": "T002",
      "description": "Extract and consolidate the feature details, digital features, safety features, and price information from the URLs found in T001.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Extract all the information about feature details, digital features, safety features, and price information from the following URLs. Return one JSON object containing the raw data from all URLs: {{T001.output}}",
      "reads": [
        "T001"
      ],
      "writes": [
        "T002"
      ],
      "status": "failed",
      "output": null,
      "error": "Code execution failed: Code execution failed: All code variants failed. Errors: CODE_1: JSONDecodeError: Expecting property name enclosed in double quotes: line 1 column 3 (char 2); CODE_2: JSONDecodeError: Expecting property name enclosed in double quotes: line 1 column 3 (char 2)",
      "cost": 0.0,
      "start_time": "2025-07-13T17:26:20.494323",
      "end_time": "2025-07-13T17:26:26.663363",
      "execution_time": 6.16904
    },
    {
      "id": "T003",
      "description": "Synthesize the information extracted from multiple URLs into a well-structured report.",
      "agent": "ThinkerAgent",
      "agent_prompt": "Synthesize the information extracted from various sources in T002 to create a cohesive and well-structured report. Focus on feature details, digital features, safety features, and pricing. Ensure that the information is accurate, comprehensive, and easy to understand. Resolve any conflicting information between the various sources. Return one JSON object containing the structured information: {{T002.output}}.",
      "reads": [
        "T002"
      ],
      "writes": [
        "T003"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    },
    {
      "id": "T004",
      "description": "Format the synthesized information into a detailed and visually appealing report.",
      "agent": "FormatterAgent",
      "agent_prompt": "Take the synthesized information from T003 and format it into a visually appealing and detailed report. Use clear headings, subheadings, bullet points, and tables to present the information in an organized manner. The report should cover feature details, digital features, safety features, and pricing of the Mahindra XUV 3XO. The report should be optimized for readability. Output the final report as an HTML string: {{T003.output}}",
      "reads": [
        "T003"
      ],
      "writes": [
        "T004"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    },
    {
      "id": "T005",
      "description": "Translate the formatted report into a beautiful, well-formatted webpage.",
      "agent": "DistillerAgent",
      "agent_prompt": "Translate the HTML report from T004 into a webpage. Ensure that the webpage is well-formatted, responsive, and visually appealing. Use CSS to style the webpage and make it look professional. The webpage should display the information about the Mahindra XUV 3XO in an engaging and easy-to-navigate manner. Also summarize the output of the formatted report into a very short summary.",
      "reads": [
        "T004"
      ],
      "writes": [
        "T005"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    }
  ],
  "links": [
    {
      "source": "ROOT",
      "target": "T001"
    },
    {
      "source": "T001",
      "target": "T002"
    },
    {
      "source": "T002",
      "target": "T003"
    },
    {
      "source": "T003",
      "target": "T004"
    },
    {
      "source": "T004",
      "target": "T005"
    }
  ]
}