{
  "directed": true,
  "multigraph": false,
  "graph": {
    "session_id": "52608087",
    "original_query": "Mahindra has launched a new vehicle called xuv 3xo, fetch details on the features for this vehicle. Use only one step of the Retriever agent but use multiple iterations (call_Self=true)",
    "file_manifest": [],
    "created_at": "2025-07-15T19:34:47.738987",
    "status": "running",
    "output_chain": {
      "T001": {
        "feature_urls": [
          {
            "type": "text",
            "text": "[{'url': 'https://auto.mahindra.com/suv/xuv3xo/X3XO.html', 'content': \"Mahindra XUV 3XO - Price, Specifications, Colors & Images Skip to main content Skip to footer content SUVs THAR ROXX 12.99L - 23.39L Book Now Book Now Explore Explore XUV 3XO 7.99L - 15.79L Book Now Book Now Explore Explore SCORPIO-N 13.99L - 25.62L Book Now Book Now Explore Explore XUV700 14.49L - 25.14L Book Now Book Now Explore Explore THAR 11.50L - 17.62L Book Now Book Now Explore Explore SCORPIO CLASSIC 13.77L - 17.72L Book Now Book Now Explore Explore BOLERO NEO 9.97L - 12.18L Book Now Book Now Explore Explore BOLERO NEO PLUS 11.41L - 14.06L Explore Explore BOLERO 9.81L - 10.93L Book Now Book Now Explore Explore XUV400 17.49L Book Now Book Now Explore Explore MARAZZO 14.59L - 17.00L Book Now Book Now Explore Explore Explore All SUVs Explore All SUVs News Contact Us Menu Build your car Test Drive Buy Buy Book Now Exchange Finance Subscribe a Vehicle Owner's Zone Owner's Zone Owner's Action Owner's Action My Dashboard Service Cost Calculator Locate Service Center Renewals Renewals Roadside Assistance Owner's Manual Care & Maintenance Important Notifications Important Notifications Service Action Adventure Adventure Club Events Expeditions Off-Road Academy Gallery Locate a Dealer Global Markets Language News Contact us Switch theme Dark Light Home XUV 3XO Know More Know More Show more Show less Show more Show less Everything you want & more Book now Book now Show more Show less Register for the latest news and exclusive updates. Stay informed Stay informed For any assistance call us on 1800 209 6006 1800 209 6006 Social links SUVs SUVs Explore All SUVs Thar Roxx Scorpio-N XUV700 XUV 3XO Thar XUV 400 Scorpio Classic Bolero Neo Bolero Bolero Neo Plus Marazzo PIK-UPs PIK-UPs Veero Maxx City Maxx HD Bolero Pik-up Bolero Camper ABOUT ABOUT About us Press Releases Stories Media kit Careers QMS Certificate OWNER OWNER Service Adventure Merchandise & Gear - Eshop Parts and accessories- Eshop Care & Maintenance Owners manual QMS Certificate customer service customer service Contact us FAQs Talk to an expert Dealer Locator Corporate Sales Enquiry Sitemap Sitemap QMS Certificate quick links quick links Vehicle configurator Test Drive Book Online Calculators Exchange Finance Scrappage Subscribe a vehicle Become a Dealer Download the M4U app now! Lets connect on Whatsapp Chat now Chat now Mahindra Corporate Terms & Conditions Our Privacy Policy Copyright 2025 Mahindra & Mahindra Ltd\", 'images': [{'url': 'https://auto.mahindra.com/dw/image/v2/BKRC_PRD/on/demandware.static/-/Sites-mahindra-product-catalog/default/dw95797f68/images/SCRC/large/ScorpioClassic_602x339.png?sw=360&sh=202', 'alt_text': 'SCORPIO CLASSIC', 'class': 'd-block img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://auto.mahindra.com/dw/image/v2/BKRC_PRD/on/demandware.static/-/Sites-mahindra-product-catalog/default/dwc6625064/images/NEOP/large/BoleroNeoPlus_602x339.png?sw=360&sh=202', 'alt_text': 'BOLERO NEO PLUS', 'class': 'd-block img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://auto.mahindra.com/on/demandware.static/Sites-amc-Site/-/default/dwbe1329bd/images/placeholder-image.png', 'alt_text': 'XUO 3XO REVX', 'width': '1400px', 'height': '700px', 'class': 'ITC-image image-fluid common-image-component flexi-height', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://auto.mahindra.com/on/demandware.static/Sites-amc-Site/-/default/dwbe1329bd/images/placeholder-image.png', 'alt_text': 'XUV 3XO Earn 5-Star Bharat-NCAP Rating', 'width': '1400px', 'height': '700px', 'class': 'ITC-image image-fluid common-image-component flexi-height', 'loading': 'lazy', 'confidence': 0.7}], 'rank': 1}, {'url': 'https://www.carwale.com/mahindra-cars/xuv-3xo/', 'content': \"Mahindra XUV 3XO Price - Images, Colours & Reviews - CarWale NEW CARS USED CARS REVIEWS & NEWS AD Mahindra XUV 3XO 3.9 Expert Rating | 4.6 User Rating (557) Rate & Win The Mahindra XUV 3XO offers a sorted ride and engaging drive, ample space, and modern-day equipment. While its boot space is limited, it isn't a deal-breaker, especially considering the compact SUVs attractive pricing. It is available with both petrol and diesel power. Overview 360 View Variants Offers Similar Cars Colours Brochure Mileage User Reviews News Expert Reviews Videos Images FAQs Colours Images View Variant Select Variant City Show price in my city Rs. 7.99 - 15.80 Lakh XUV 3XO On Road Price Ex-Showroom price, Mumbai Calculate your EMI EMI Calculator Get July Offers 4 Things to Know About XUV 3XO Has projector headlamps, 17-inch alloys and a 360-degree camera. The instrument cluster is fully digital with customisable screens. Top-spec versions get dual-zone climate control with rear AC vents. One of the USPs of the Mahindra XUV 3XO is level-2 ADAS Mahindra XUV 3XO Price Mahindra XUV 3XO price for the base model starts at Rs. 7.99 Lakh and the top model price goes upto Rs. 15.80 Lakh (Avg. ex-showroom). XUV 3XO price for 29 variants is listed below. Filter By Fuel type & Transmission Petrol Diesel Manual Automatic (TC) Automatic (AMT) Variants Ex-Showroom price Compare XUV 3XO MX1 1.2 Petrol 1197 cc, Petrol, Manual, 18.89 kmpl, 110 bhp Rs. 7.99 Lakh Compare View Price Breakup Get Offers Just Launched XUV 3XO REVX M 1.2 Petrol 1197 cc, Petrol, Manual, 110 bhp Rs. 8.94 Lakh Compare View Price Breakup Get Offers Just Launched XUV 3XO REVX M (O)1.2 Petrol 1197 cc, Petrol, Manual, 110 bhp Rs. 9.44 Lakh Compare View Price Breakup Get Offers XUV 3XO MX2 Pro 1.2 Petrol 1197 cc, Petrol, Manual, 18.89 kmpl, 110 bhp Rs. 9.54 Lakh Compare View Price Breakup Get Offers XUV 3XO MX3 1.2 Petrol 1197 cc, Petrol, Manual, 18.89 kmpl, 110 bhp Rs. 9.74 Lakh Compare View Price Breakup Get Offers XUV 3XO MX3 Pro 1.2 Petrol 1197 cc, Petrol, Manual, 18.89 kmpl, 110 bhp Rs. 9.99 Lakh Compare View Price Breakup Get Offers XUV 3XO MX2 1.5 Diesel 1497 cc, Diesel, Manual, 20.6 kmpl, 115 bhp Rs. 9.99 Lakh Compare View Price Breakup Get Offers XUV 3XO MX2 Pro 1.2 Petrol AT 1197 cc, Petrol, Automatic (TC), 17.96 kmpl, 110 bhp Rs. 10.54 Lakh Compare View Price Breakup Get Offers XUV 3XO MX2 Pro 1.5 Diesel 1497 cc, Diesel, Manual, 20.6 kmpl, 115 bhp Rs. 10.64 Lakh Compare View Price Breakup Get Offers XUV 3XO MX3 1.5 Diesel 1497 cc, Diesel, Manual, 20.6 kmpl, 115 bhp Rs. 10.99 Lakh Compare View Price Breakup Get Offers XUV 3XO AX5 1.2 Petrol 1197 cc, Petrol, Manual, 18.89 kmpl, 110 bhp Rs. 11.19 Lakh Compare View Price Breakup Get Offers XUV 3XO MX3 1.2 Petrol AT 1197 cc, Petrol, Automatic (TC), 17.96 kmpl, 110 bhp Rs. 11.40 Lakh Compare View Price Breakup Get Offers XUV 3XO MX3 Pro 1.5 Diesel 1497 cc, Diesel, Manual, 20.6 kmpl, 115 bhp Rs. 11.56 Lakh Compare View Price Breakup Get Offers XUV 3XO MX3 Pro 1.2 Petrol AT 1197 cc, Petrol, Automatic (TC), 17.96 kmpl, 110 bhp Rs. 11.69 Lakh Compare View Price Breakup Get Offers XUV 3XO MX3 1.5 Diesel Autoshift Plus 1497 cc, Diesel, Automatic (AMT), 21.2 kmpl, 115 bhp Rs. 11.79 Lakh Compare View Price Breakup Get Offers Just Launched XUV 3XO REVX A 1.2 Petrol MT 1197 cc, Petrol, Manual, 129 bhp Rs. 11.79 Lakh Compare View Price Breakup Get Offers XUV 3XO AX5 1.5 Diesel 1497 cc, Diesel, Manual, 20.6 kmpl, 115 bhp Rs. 12.19 Lakh Compare View Price Breakup Get Offers XUV 3XO AX5L 1.2 Petrol 1197 cc, Petrol, Manual, 20.1 kmpl, 129 bhp Rs. 12.62 Lakh Compare View Price Breakup Get Offers XUV 3XO AX5 1.2 Petrol AT 1197 cc, Petrol, Automatic (TC), 17.96 kmpl, 110 bhp Rs. 12.69 Lakh Compare View Price Breakup Get Offers XUV 3XO AX7 1.2 Petrol 1197 cc, Petrol, Manual, 20.1 kmpl, 129 bhp Rs. 12.80 Lakh Compare View Price Breakup Get Offers XUV 3XO AX5 1.5 Diesel Autoshift Plus 1497 cc, Diesel, Automatic (AMT), 21.2 kmpl, 115 bhp Rs. 12.99 Lakh Compare\", 'images': [{'url': 'https://imgd.aeplcdn.com/664x374/n/cw/ec/156405/xuv-3xo-exterior-right-front-three-quarter-34.jpeg?isig=0&q=80', 'alt_text': 'Mahindra XUV 3XO Right Front Three Quarter', 'title': 'Mahindra XUV 3XO Right Front Three Quarter', 'class': 'o-D o-hP o-iB o-iT o-G o-Q o-a0 o-aa o-hl o-ed', 'loading': 'eager', 'confidence': 0.7999999999999999}, {'url': 'https://imgd.aeplcdn.com/664x374/n/cw/ec/156405/xuv-3xo-exterior-right-front-three-quarter-32.jpeg?isig=0&q=80', 'alt_text': 'Mahindra XUV 3XO Right Front Three Quarter', 'title': 'Mahindra XUV 3XO Right Front Three Quarter', 'class': 'o-D o-hP o-iB o-iT o-G o-Q o-a0 o-aa o-hl o-ed', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://imgd.aeplcdn.com/664x374/n/cw/ec/156405/xuv-3xo-exterior-left-rear-three-quarter.jpeg?isig=0&q=80', 'alt_text': 'Mahindra XUV 3XO Left Rear Three Quarter', 'title': 'Mahindra XUV 3XO Left Rear Three Quarter', 'class': 'o-D o-hP o-iB o-iT o-G o-Q o-a0 o-aa o-hl o-ed', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://imgd.aeplcdn.com/664x374/n/cw/ec/156405/xuv-3xo-exterior-left-side-view.jpeg?isig=0&q=80', 'alt_text': 'Mahindra XUV 3XO Left Side View', 'title': 'Mahindra XUV 3XO Left Side View', 'class': 'o-D o-hP o-iB o-iT o-G o-Q o-a0 o-aa o-hl o-ed', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://imgd.aeplcdn.com/664x374/n/cw/ec/156405/xuv-3xo-exterior-front-view-39.jpeg?isig=0&q=80', 'alt_text': 'Mahindra XUV 3XO Front View', 'title': 'Mahindra XUV 3XO Front View', 'class': 'o-D o-hP o-iB o-iT o-G o-Q o-a0 o-aa o-hl o-ed', 'loading': 'lazy', 'confidence': 0.7999999999999999}], 'rank': 2}, {'url': 'https://www.autocarindia.com/car-reviews/mahindra-xuv-3xo-review-feature-and-power-packed-compact-suv-431439', 'content': \"Mahindra XUV300, XUV 3XO review, design, interior, features, performance, first drive - Introduction | Autocar India All All Price News Reviews Features Specifications Images Videos All All Price News Reviews Features Specifications Images Videos Signup Login Find a Car Cars Compare Cars New Cars Upcoming Cars Car Price Car Loan Calculator Find a Bike Bikes Compare Bikes New New Bikes New Scooters Upcoming Upcoming Bikes Upcoming Scooters Electric Electric Bikes Electric Scooters Bike Price Bike Loan Calculator News Cars Bikes Motorsports Industry Marketplace Reviews Car First drive / Reviews Comparisons Video reviews Long-term reviews Bike First ride / Reviews Comparisons Video reviews Long-term reviews Features Features Travelogues Blogs Interviews Partner Content Galleries Videos Images Stories Advice Signup Login Home Car Reviews Mahindra XUV 3XO review - Feature and power packed compact SUV Mahindra XUV 3XO review - Feature and power packed compact SUV Out goes the Mahindra XUV300 and in comes the XUV 3XO. The new name is just the starting point of a very comprehensive upgrade. Updated on May 02, 2024 05:35:55 PM 86,874 Views Follow us on The XUV 3XO's styling is big on flash The diamond-shaped detailing on the lights and grille are a nice touch. The infotainment is now a 10.25-inch unit and works well. By Nikhil Bhatia Share - Make : Mahindra Model : XUV 3XO We Like Upmarket interior Strong engines Long equipment list We Don't Like Boot space Competent as the Mahindra XUV300 was, it never quite made it to the list of compact SUV bestsellers. Mahindra is now gunning for glory with the updated XUV300, christened the XUV 3XO. Mind you, this is no run-of-the-mill nip and tuck update. Mahindra has gone all out with a new look, redone interior, some class-first feature introductions, some class-best specifications and very enticing pricing. The aim is to take the fight to the Tata Nexon, Maruti Brezza, Kia Sonet and Hyundai Venue, and win. Mahindra XUV 3XO: design and styling Where the XUV300s styling was understated, the XUV 3XO is big on flash. Giving the 3XO its distinctive face are the large, new vertically oriented headlights outlined by C-shaped DRLs (a link to the larger XUV700). The headlights are split into two sections with a concealed projector unit up top, and an open projector fog lamp unit lower down, both set amidst a black surround. The lights flank the new grille, which is actually a gloss panel that runs much of the XUVs width. The new front bumper with its pronounced cuts and creases is very concept car-like and the newly contoured bonnet also does its bit to add volume to the design. New C-shaped LED DRLs provide a visual link with the larger XUV700. Like the XUV300, the 3XO looks muscular in profile, and furthering the impression are the stylish new 17-inch diamond cut alloy wheels that are the largest in the segment. Theres also chunkier side cladding with cuts at the wheel arches. Mahindra says ground clearance is a generous 201mm, up from the XUV300s figure of 180mm. Mahindra XUV 3XO Price, Mileage, Specifications, Features and Variants Brand Mahindra Model Name XUV 3XO Mahindra XUV 3XO Price 9.06 - 18.39 lakh Mahindra XUV 3XO Range/Mileage Petrol : 17.96 - 20.1kpl | Diesel : 20.6 - 21.2kpl Mahindra XUV 3XO Specifications SUV | 5 doors | 5 seats View All Specs Mahindra XUV 3XO Features LED headlight | 26.03-inch Touchscreen display | 6 airbags View All Features Mahindra XUV 3XO Variants MX1 1.2 Petrol MT | MX2 Pro 1.2 Petrol MT | MX3 1.2 Petrol MT View All Variants In its basic shape though, the 3XO is no different than the XUV300. The 2,600mm wheelbase remains class best, but the short overhangs, particularly at the back, tell you that this is a vehicle that's brutally shortened (remember it started life as a SsangYong Tivoli) to get length under the critical 4m mark, needed to qualify as a small car and hence a lower rate of tax. New 17-inch alloys are the largest in the segment. At the back, you sur\", 'images': [{'url': 'https://img.autocarindia.com/ExtraImages/20240502111525_First Drive 3XO Web.001.jpeg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO review', 'title': 'Mahindra XUV 3XO review', 'class': 'img-fluid', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/ExtraImages/20240502012130_First Drive 3XO Web.008.jpeg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO front quarter', 'title': 'Mahindra XUV 3XO front quarter', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/ExtraImages/20240502012130_First Drive 3XO Web.014.jpeg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO review - Feature and power packed compact SUV', 'title': 'Mahindra XUV 3XO review - Feature and power packed compact SUV', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/ExtraImages/20240502012130_First Drive 3XO Web.016.jpeg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO review - Feature and power packed compact SUV', 'title': 'Mahindra XUV 3XO review - Feature and power packed compact SUV', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/model/uploads/modelimages/Mahindra-XUV-3XO-290420241902.jpg', 'alt_text': 'Latest Image of Mahindra XUV 3XO', 'title': 'Mahindra XUV 3XO', 'class': 'img-fluid wid-img', 'loading': 'lazy', 'confidence': 0.7999999999999999}], 'rank': 3}, {'url': 'https://www.mahindra.com/news-room/press-release/en/mahindra-launches-XUV-3XO-REVX-series-starting-at-rs-8.94-lakh', 'content': 'Mahindra Launches XUV 3XO REVX Series Starting at 8.94 Lakh Skip to main content Who We Are Our Purpose Drive positive change in the lives of our communities. Only when we enable others to rise will we rise. #TogetherWeRise Purpose Led Performance Driven Future Ready Leadership Our History Museum What we do Key Facts 20+ Industries 100+ Countries 324K+ Employees Industries Automotive SUVs LCVs Last Mile Mobility Iconic Motorcycles Trucks And Buses Farm Equipments Tractors Agri Services Farm Machinery Financial Services Technology Services Hospitality Logistics Real Estate Renewables Other Emerging Businesses Advanced Technologies (Defence) Aerostructures Aftermarkets (Pre-Owned Cars) Auto Components and Recycling Power Generation Retail Our Brands Global Presence Cultural Outreach Investor Relations Investor Relations Group highlights. 18% Consolidated ROE 1592 B+ Revenue 129 B+ PAT 3.31 T+ Market cap as on date Disclosures Under Regulation 46 And 62 Of SEBI (LODR) Reports Policies Regulatory Filings Sustainability newsroom Newsroom Mahindra Launches XUV 3XO REVX Series Starting at 8.94 Lakh 8 July 2025 Auto Mahindra Tractors advanced mLIFT Precision Hydraulics system set to enhance local farm productivity in Rajasthan 8 July 2025 Farm Press Releases Media Resources In The News careers careers Committed to elevate the lives of communities, guided by our core behaviours and values. Bold. Agile. Collaborative. Find A Job SOAR - Seamless Opportunity For Amazing Returnship Leadership Programs Mahindra Leadership Program Mahindra Accelerated Leadership Track Mahindra Future Shapers Mahindra Leadership University Tech Opportunities Mahindra Digital Engine Submit Popular Keywords: Business FY 21 Brands XUV700 Global Nanhi Kali Recommended for you: Annual Report 2021 - 2022 Leadership Announcement Latest Press Release Brand Guidelines Mahindra Launches XUV 3XO REVX Series Starting at 8.94 Lakh Auto Home Newsroom Press Release Mahindra Launches XUV 3XO REVX Series Starting at 8.94 Lakh Author : mahindraadmin Category : Auto Published : 7/8/2025 Feature-packed, style-forward, and revved for performance Striking new exteriors with new body colored grille, black alloy wheels, dual-tone roof, and distinctive badging. Premium interiors offering exceptional value for customers in C-SUV segment under 10 Lakh with leatherette seats and sunroof. Mumbai, July 8, 2025: Mahindra & Mahindra Ltd., Indias leading SUV manufacturer, today unveiled the exciting new XUV 3XO REVX series, starting at an attractive price of .8.94 Lakh. The XUV 3XO recently achieved an impressive milestone of over 1 lakh sales in under a year, making it Mahindras fastest SUV to reach this milestone. The REVX series will further enhance the XUV 3XO portfolio with a compelling value offering of premium features, distinctive styling and best in segment performance, resonating with customer aspirations. Catering to individuals who seek vehicles that reflect their unique personality, the REVX series celebrates the spirit of personal expressionbecause for those who dare to stand out, \"Different is in.\" REVX Series key highlights: REVX M (Ex-Showroom Price: 8.94 Lakh) This variant is powered by a 1.2L mStallion TCMPFi engine delivering a power of 82 kW and torque of 200 Nm. Its bold exterior features a sleek front with a body-colored grille, full-width LED DRLs, R16 Black Wheel covers, and a sporty dual-tone roof, exuding confidence and style. Inside, it offers plush black leatherette seats, a 26.03 cm infotainment system with steering- mounted controls, and a 4-speaker audio setup for an immersive cabin experience. Safety is prioritized with 35 standard features, including six airbags, ESC with Hill Hold Control (HHC), and All 4 Disc Brakes. REVX M(O) (Ex-Showroom Price: 9.44 Lakh) This variant enhances sophistication with the addition of a single-pane sunroof, elevating the cabin experience and overall design appeal over REVX M. REVX A (Ex-Showroom Price starting at 1', 'images': [], 'rank': 4}, {'url': 'https://auto.hindustantimes.com/new-cars/mahindra/xuv-3xo', 'content': \"Mahindra XUV 3XO - On-Road Price, Features & Reviews XUV 3XO Price Specs & Features Mileage User Reviews Images Variants Reviews News Videos 1/24 MAHINDRA XUV 3XO Launched in Apr 2024 4.0 115 Reviews Review & Win 2000 7.99 - 15.79 Lakhs* *Ex-showroom price Get on road price Delhi Videos Photos Specs Colours Variants Check Offers XUV 3XO Key Specs Engine Category Average: 1199.0 - 1497.0 cc XUV 3XO : 1197.0 - 1497.0 cc Mileage Category Average: 18.87 kmpl XUV 3XO : 18.06-21.2 kmpl Power Category Average: 108.74 bhp XUV 3XO : 110.0 - 129.0 bhp View all XUV 3XO Specs and Features Mahindra XUV 3XO Latest Updates Latest News: 9 Jul 2025 : The XUV 3XO RevX introduces M and A trims with updated features, design elements, and engine options at mid-range prices. Read Full Story 8 Jul 2025 : Mahindra expands its XUV 3XO lineup with the RevX Series, featuring value-friendly trims and upgraded features. Read Full Story 5 Jul 2025 : Mahindra launches XUV 3XO in Australia with two variants, AX5L and AX7L, featuring advanced technology and competitive pricing. Read Full Story Mahindra XUV 3XO: Overview The Mahindra XUV 3XO is the heavily updated successor to the XUV300, introduced to reinforce Mahindras presence in the sub-4-metre compact SUV space in India. It brings an revamped design, fresh interiors, new technology, and updated engine options while continuing to target popular rivals, such as the Tata Nexon, Hyundai Venue, Maruti Suzuki Brezza, and Kia Sonet. The XUV 3XO offers an aggressive styling update, a more premium feature list, and multiple drivetrain choices catering to city users, families, and enthusiasts alike. Mahindra XUV 3XO: Price The Mahindra XUV 3XO is priced from 7.99 lakh for the entry-level petrol manual variant, while diesel variants begin at 9.99 lakh. The petrol automatic versions are available from 10.54 lakh, and the diesel automatic variants are priced from 14.70 lakh. The top-spec AX7 L TGDi petrol variant is priced at 15.79 lakh (all prices, ex-showroom Delhi). This broad price range allows the 3XO to cater to a wide demographic, from budget-conscious buyers to those seeking a premium experience with advanced technology and performance. Mahindra XUV 3XO: Launch Date The Mahindra XUV 3XO was officially launched in India on April 29, 2024. Replacing the XUV300 in Mahindra's lineup, it arrives with a complete redesign and a comprehensive update to its feature list, marking a significant evolution of the brand's compact SUV offering. Mahindra XUV 3XO: Variants and Colours Mahindra offers the XUV 3XO in nine broad variantsMX1, MX2, MX3, MX3 Pro, AX5, AX5 L, AX7, and AX7 L. The base MX1 variant is the most affordable, while the AX7 L TGDi is the top-end petrol variant. Diesel-powered variants start at 9.99 lakh and go up to 14.70 lakh for the automatic version. The SUV is available in eight single-tone coloursTango Red, Citrine Yellow, Everest White, Deep Forest, Galaxy Grey, Stealth Black, Dune Beige, and Nebula Bluealong with dual-tone options with black or grey roofs, depending on the body shade. Mahindra XUV 3XO: Mileage The Mahindra XUV 3XO offers multiple engine and transmission options, leading to varying fuel economy figures. The 1.5-litre diesel engine delivers an ARAI-certified mileage of 20.6 kmpl. The 1.2-litre turbo-petrol manual variants claim 20.1 kmpl, while the automatic versions offer up to 18.2 kmpl. Real-world efficiency depends on the driving environment, vehicle load, and driving habits. Mahindra XUV 3XO: Specs & Features The Mahindra XUV 3XO sports a fully reworked exterior featuring a bold new grille, LED projector headlamps, C-shaped LED DRLs, and a full-width LED light bar at the rear. The side profile has been updated with fresh alloy wheel designs and rugged cladding. Inside, the 3XO debuts a new dashboard with a 10.25-inch touchscreen infotainment system using Mahindras AdrenoX UI, a 10.25-inch digital drivers display, dual-zone climate control with rear AC vents, and wireless c\", 'images': [{'url': 'https://auto.hindustantimes.com/cms-images/mahindra_xuv-3xo/images/exterior_mahindra-xuv-3xo_front-left-side_1063x676.jpg?imwidth=420', 'alt_text': 'Mahindra XUV 3XO Front Left Side', 'class': 'pdpImageModelElement', 'loading': 'eager', 'confidence': 0.7999999999999999}, {'url': 'https://auto.hindustantimes.com/_next/image?url=https%3A%2F%2Fhtcms-prod-images.s3.ap-south-1.amazonaws.com%2Fhtmobile1%2Fmahindra_xuv-3xo%2Fheroimage%2Fthumbnail_mahindra-xuv-3xo.png&w=3840&q=75', 'alt_text': 'Mahindra XUV 3XO', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://auto.hindustantimes.com/_next/image?url=https%3A%2F%2Fimages.hindustantimes.com%2Fauto%2Fimg%2F2024%2F05%2F08%2F600x338%2FMahindra_XUV_3XO_main_5_1715148990745_1715149067995.jpg&w=3840&q=75', 'alt_text': 'The price range of the Mahindra XUV 3XO is one of the widest in the segment with the top version nearly double than the base version.', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://auto.hindustantimes.com/_next/image?url=https%3A%2F%2Fimages.hindustantimes.com%2Fauto%2Fimg%2F2024%2F05%2F08%2F600x338%2FMahindra_XUV_3XO_main_6_1715149052848_1715149080717.jpg&w=3840&q=75', 'alt_text': 'The Mahindra XUV 3XO measures 3990 mm in length, is 1821 mm wide and stands 1647 mm with its roof rails.', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://auto.hindustantimes.com/_next/image?url=https%3A%2F%2Fimages.hindustantimes.com%2Fauto%2Fimg%2F2024%2F05%2F08%2F600x338%2FMahindra_XUV_3XO_main_7_1715149089737_1715149106474.jpg&w=3840&q=75', 'alt_text': 'The colour options on the Mahindra XUV 3XO include Yellow, Deep Forest which is basically dark Green, White, Black, Grey, Blue, Beige and Red. There are dual-tone options on the upper variants as well.', 'loading': 'lazy', 'confidence': 0.7999999999999999}], 'rank': 5}, {'url': 'https://www.team-bhp.com/news/2024-mahindra-xuv-3xo-review-8-pros-7-cons', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://www.spinny.com/cars/mahindra/xuv-3xo/', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://whatinsider.com/mahindra-xuv-3xo/', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null,
            "_meta": null
          }
        ]
      }
    },
    "validation_results": {
      "is_valid": true,
      "is_dag": true,
      "cycles": [],
      "disconnected_components": [],
      "orphaned_nodes": [],
      "root_nodes": [],
      "leaf_nodes": [
        "T001"
      ],
      "warnings": [],
      "errors": []
    }
  },
  "nodes": [
    {
      "description": "Initial Query",
      "agent": "System",
      "status": "completed",
      "id": "ROOT"
    },
    {
      "id": "T001",
      "description": "Fetch details on the features of the new Mahindra XUV 3XO vehicle, make recursive calls to itself until all the required information is fetched",
      "agent": "RetrieverAgent",
      "agent_prompt": "Fetch details on the features of the new Mahindra XUV 3XO vehicle from reliable sources. Make recursive calls to itself, until all the information is retrieved. Please make sure to visit all the relevant webpages, and aggregate all possible features of this car. Once done, output all the features of the vehicle.",
      "reads": [],
      "writes": [
        "T001"
      ],
      "status": "completed",
      "output": {
        "feature_urls": [
          {
            "type": "text",
            "text": "[{'url': 'https://auto.mahindra.com/suv/xuv3xo/X3XO.html', 'content': \"Mahindra XUV 3XO - Price, Specifications, Colors & Images Skip to main content Skip to footer content SUVs THAR ROXX 12.99L - 23.39L Book Now Book Now Explore Explore XUV 3XO 7.99L - 15.79L Book Now Book Now Explore Explore SCORPIO-N 13.99L - 25.62L Book Now Book Now Explore Explore XUV700 14.49L - 25.14L Book Now Book Now Explore Explore THAR 11.50L - 17.62L Book Now Book Now Explore Explore SCORPIO CLASSIC 13.77L - 17.72L Book Now Book Now Explore Explore BOLERO NEO 9.97L - 12.18L Book Now Book Now Explore Explore BOLERO NEO PLUS 11.41L - 14.06L Explore Explore BOLERO 9.81L - 10.93L Book Now Book Now Explore Explore XUV400 17.49L Book Now Book Now Explore Explore MARAZZO 14.59L - 17.00L Book Now Book Now Explore Explore Explore All SUVs Explore All SUVs News Contact Us Menu Build your car Test Drive Buy Buy Book Now Exchange Finance Subscribe a Vehicle Owner's Zone Owner's Zone Owner's Action Owner's Action My Dashboard Service Cost Calculator Locate Service Center Renewals Renewals Roadside Assistance Owner's Manual Care & Maintenance Important Notifications Important Notifications Service Action Adventure Adventure Club Events Expeditions Off-Road Academy Gallery Locate a Dealer Global Markets Language News Contact us Switch theme Dark Light Home XUV 3XO Know More Know More Show more Show less Show more Show less Everything you want & more Book now Book now Show more Show less Register for the latest news and exclusive updates. Stay informed Stay informed For any assistance call us on 1800 209 6006 1800 209 6006 Social links SUVs SUVs Explore All SUVs Thar Roxx Scorpio-N XUV700 XUV 3XO Thar XUV 400 Scorpio Classic Bolero Neo Bolero Bolero Neo Plus Marazzo PIK-UPs PIK-UPs Veero Maxx City Maxx HD Bolero Pik-up Bolero Camper ABOUT ABOUT About us Press Releases Stories Media kit Careers QMS Certificate OWNER OWNER Service Adventure Merchandise & Gear - Eshop Parts and accessories- Eshop Care & Maintenance Owners manual QMS Certificate customer service customer service Contact us FAQs Talk to an expert Dealer Locator Corporate Sales Enquiry Sitemap Sitemap QMS Certificate quick links quick links Vehicle configurator Test Drive Book Online Calculators Exchange Finance Scrappage Subscribe a vehicle Become a Dealer Download the M4U app now! Lets connect on Whatsapp Chat now Chat now Mahindra Corporate Terms & Conditions Our Privacy Policy Copyright 2025 Mahindra & Mahindra Ltd\", 'images': [{'url': 'https://auto.mahindra.com/dw/image/v2/BKRC_PRD/on/demandware.static/-/Sites-mahindra-product-catalog/default/dw95797f68/images/SCRC/large/ScorpioClassic_602x339.png?sw=360&sh=202', 'alt_text': 'SCORPIO CLASSIC', 'class': 'd-block img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://auto.mahindra.com/dw/image/v2/BKRC_PRD/on/demandware.static/-/Sites-mahindra-product-catalog/default/dwc6625064/images/NEOP/large/BoleroNeoPlus_602x339.png?sw=360&sh=202', 'alt_text': 'BOLERO NEO PLUS', 'class': 'd-block img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://auto.mahindra.com/on/demandware.static/Sites-amc-Site/-/default/dwbe1329bd/images/placeholder-image.png', 'alt_text': 'XUO 3XO REVX', 'width': '1400px', 'height': '700px', 'class': 'ITC-image image-fluid common-image-component flexi-height', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://auto.mahindra.com/on/demandware.static/Sites-amc-Site/-/default/dwbe1329bd/images/placeholder-image.png', 'alt_text': 'XUV 3XO Earn 5-Star Bharat-NCAP Rating', 'width': '1400px', 'height': '700px', 'class': 'ITC-image image-fluid common-image-component flexi-height', 'loading': 'lazy', 'confidence': 0.7}], 'rank': 1}, {'url': 'https://www.carwale.com/mahindra-cars/xuv-3xo/', 'content': \"Mahindra XUV 3XO Price - Images, Colours & Reviews - CarWale NEW CARS USED CARS REVIEWS & NEWS AD Mahindra XUV 3XO 3.9 Expert Rating | 4.6 User Rating (557) Rate & Win The Mahindra XUV 3XO offers a sorted ride and engaging drive, ample space, and modern-day equipment. While its boot space is limited, it isn't a deal-breaker, especially considering the compact SUVs attractive pricing. It is available with both petrol and diesel power. Overview 360 View Variants Offers Similar Cars Colours Brochure Mileage User Reviews News Expert Reviews Videos Images FAQs Colours Images View Variant Select Variant City Show price in my city Rs. 7.99 - 15.80 Lakh XUV 3XO On Road Price Ex-Showroom price, Mumbai Calculate your EMI EMI Calculator Get July Offers 4 Things to Know About XUV 3XO Has projector headlamps, 17-inch alloys and a 360-degree camera. The instrument cluster is fully digital with customisable screens. Top-spec versions get dual-zone climate control with rear AC vents. One of the USPs of the Mahindra XUV 3XO is level-2 ADAS Mahindra XUV 3XO Price Mahindra XUV 3XO price for the base model starts at Rs. 7.99 Lakh and the top model price goes upto Rs. 15.80 Lakh (Avg. ex-showroom). XUV 3XO price for 29 variants is listed below. Filter By Fuel type & Transmission Petrol Diesel Manual Automatic (TC) Automatic (AMT) Variants Ex-Showroom price Compare XUV 3XO MX1 1.2 Petrol 1197 cc, Petrol, Manual, 18.89 kmpl, 110 bhp Rs. 7.99 Lakh Compare View Price Breakup Get Offers Just Launched XUV 3XO REVX M 1.2 Petrol 1197 cc, Petrol, Manual, 110 bhp Rs. 8.94 Lakh Compare View Price Breakup Get Offers Just Launched XUV 3XO REVX M (O)1.2 Petrol 1197 cc, Petrol, Manual, 110 bhp Rs. 9.44 Lakh Compare View Price Breakup Get Offers XUV 3XO MX2 Pro 1.2 Petrol 1197 cc, Petrol, Manual, 18.89 kmpl, 110 bhp Rs. 9.54 Lakh Compare View Price Breakup Get Offers XUV 3XO MX3 1.2 Petrol 1197 cc, Petrol, Manual, 18.89 kmpl, 110 bhp Rs. 9.74 Lakh Compare View Price Breakup Get Offers XUV 3XO MX3 Pro 1.2 Petrol 1197 cc, Petrol, Manual, 18.89 kmpl, 110 bhp Rs. 9.99 Lakh Compare View Price Breakup Get Offers XUV 3XO MX2 1.5 Diesel 1497 cc, Diesel, Manual, 20.6 kmpl, 115 bhp Rs. 9.99 Lakh Compare View Price Breakup Get Offers XUV 3XO MX2 Pro 1.2 Petrol AT 1197 cc, Petrol, Automatic (TC), 17.96 kmpl, 110 bhp Rs. 10.54 Lakh Compare View Price Breakup Get Offers XUV 3XO MX2 Pro 1.5 Diesel 1497 cc, Diesel, Manual, 20.6 kmpl, 115 bhp Rs. 10.64 Lakh Compare View Price Breakup Get Offers XUV 3XO MX3 1.5 Diesel 1497 cc, Diesel, Manual, 20.6 kmpl, 115 bhp Rs. 10.99 Lakh Compare View Price Breakup Get Offers XUV 3XO AX5 1.2 Petrol 1197 cc, Petrol, Manual, 18.89 kmpl, 110 bhp Rs. 11.19 Lakh Compare View Price Breakup Get Offers XUV 3XO MX3 1.2 Petrol AT 1197 cc, Petrol, Automatic (TC), 17.96 kmpl, 110 bhp Rs. 11.40 Lakh Compare View Price Breakup Get Offers XUV 3XO MX3 Pro 1.5 Diesel 1497 cc, Diesel, Manual, 20.6 kmpl, 115 bhp Rs. 11.56 Lakh Compare View Price Breakup Get Offers XUV 3XO MX3 Pro 1.2 Petrol AT 1197 cc, Petrol, Automatic (TC), 17.96 kmpl, 110 bhp Rs. 11.69 Lakh Compare View Price Breakup Get Offers XUV 3XO MX3 1.5 Diesel Autoshift Plus 1497 cc, Diesel, Automatic (AMT), 21.2 kmpl, 115 bhp Rs. 11.79 Lakh Compare View Price Breakup Get Offers Just Launched XUV 3XO REVX A 1.2 Petrol MT 1197 cc, Petrol, Manual, 129 bhp Rs. 11.79 Lakh Compare View Price Breakup Get Offers XUV 3XO AX5 1.5 Diesel 1497 cc, Diesel, Manual, 20.6 kmpl, 115 bhp Rs. 12.19 Lakh Compare View Price Breakup Get Offers XUV 3XO AX5L 1.2 Petrol 1197 cc, Petrol, Manual, 20.1 kmpl, 129 bhp Rs. 12.62 Lakh Compare View Price Breakup Get Offers XUV 3XO AX5 1.2 Petrol AT 1197 cc, Petrol, Automatic (TC), 17.96 kmpl, 110 bhp Rs. 12.69 Lakh Compare View Price Breakup Get Offers XUV 3XO AX7 1.2 Petrol 1197 cc, Petrol, Manual, 20.1 kmpl, 129 bhp Rs. 12.80 Lakh Compare View Price Breakup Get Offers XUV 3XO AX5 1.5 Diesel Autoshift Plus 1497 cc, Diesel, Automatic (AMT), 21.2 kmpl, 115 bhp Rs. 12.99 Lakh Compare\", 'images': [{'url': 'https://imgd.aeplcdn.com/664x374/n/cw/ec/156405/xuv-3xo-exterior-right-front-three-quarter-34.jpeg?isig=0&q=80', 'alt_text': 'Mahindra XUV 3XO Right Front Three Quarter', 'title': 'Mahindra XUV 3XO Right Front Three Quarter', 'class': 'o-D o-hP o-iB o-iT o-G o-Q o-a0 o-aa o-hl o-ed', 'loading': 'eager', 'confidence': 0.7999999999999999}, {'url': 'https://imgd.aeplcdn.com/664x374/n/cw/ec/156405/xuv-3xo-exterior-right-front-three-quarter-32.jpeg?isig=0&q=80', 'alt_text': 'Mahindra XUV 3XO Right Front Three Quarter', 'title': 'Mahindra XUV 3XO Right Front Three Quarter', 'class': 'o-D o-hP o-iB o-iT o-G o-Q o-a0 o-aa o-hl o-ed', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://imgd.aeplcdn.com/664x374/n/cw/ec/156405/xuv-3xo-exterior-left-rear-three-quarter.jpeg?isig=0&q=80', 'alt_text': 'Mahindra XUV 3XO Left Rear Three Quarter', 'title': 'Mahindra XUV 3XO Left Rear Three Quarter', 'class': 'o-D o-hP o-iB o-iT o-G o-Q o-a0 o-aa o-hl o-ed', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://imgd.aeplcdn.com/664x374/n/cw/ec/156405/xuv-3xo-exterior-left-side-view.jpeg?isig=0&q=80', 'alt_text': 'Mahindra XUV 3XO Left Side View', 'title': 'Mahindra XUV 3XO Left Side View', 'class': 'o-D o-hP o-iB o-iT o-G o-Q o-a0 o-aa o-hl o-ed', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://imgd.aeplcdn.com/664x374/n/cw/ec/156405/xuv-3xo-exterior-front-view-39.jpeg?isig=0&q=80', 'alt_text': 'Mahindra XUV 3XO Front View', 'title': 'Mahindra XUV 3XO Front View', 'class': 'o-D o-hP o-iB o-iT o-G o-Q o-a0 o-aa o-hl o-ed', 'loading': 'lazy', 'confidence': 0.7999999999999999}], 'rank': 2}, {'url': 'https://www.autocarindia.com/car-reviews/mahindra-xuv-3xo-review-feature-and-power-packed-compact-suv-431439', 'content': \"Mahindra XUV300, XUV 3XO review, design, interior, features, performance, first drive - Introduction | Autocar India All All Price News Reviews Features Specifications Images Videos All All Price News Reviews Features Specifications Images Videos Signup Login Find a Car Cars Compare Cars New Cars Upcoming Cars Car Price Car Loan Calculator Find a Bike Bikes Compare Bikes New New Bikes New Scooters Upcoming Upcoming Bikes Upcoming Scooters Electric Electric Bikes Electric Scooters Bike Price Bike Loan Calculator News Cars Bikes Motorsports Industry Marketplace Reviews Car First drive / Reviews Comparisons Video reviews Long-term reviews Bike First ride / Reviews Comparisons Video reviews Long-term reviews Features Features Travelogues Blogs Interviews Partner Content Galleries Videos Images Stories Advice Signup Login Home Car Reviews Mahindra XUV 3XO review - Feature and power packed compact SUV Mahindra XUV 3XO review - Feature and power packed compact SUV Out goes the Mahindra XUV300 and in comes the XUV 3XO. The new name is just the starting point of a very comprehensive upgrade. Updated on May 02, 2024 05:35:55 PM 86,874 Views Follow us on The XUV 3XO's styling is big on flash The diamond-shaped detailing on the lights and grille are a nice touch. The infotainment is now a 10.25-inch unit and works well. By Nikhil Bhatia Share - Make : Mahindra Model : XUV 3XO We Like Upmarket interior Strong engines Long equipment list We Don't Like Boot space Competent as the Mahindra XUV300 was, it never quite made it to the list of compact SUV bestsellers. Mahindra is now gunning for glory with the updated XUV300, christened the XUV 3XO. Mind you, this is no run-of-the-mill nip and tuck update. Mahindra has gone all out with a new look, redone interior, some class-first feature introductions, some class-best specifications and very enticing pricing. The aim is to take the fight to the Tata Nexon, Maruti Brezza, Kia Sonet and Hyundai Venue, and win. Mahindra XUV 3XO: design and styling Where the XUV300s styling was understated, the XUV 3XO is big on flash. Giving the 3XO its distinctive face are the large, new vertically oriented headlights outlined by C-shaped DRLs (a link to the larger XUV700). The headlights are split into two sections with a concealed projector unit up top, and an open projector fog lamp unit lower down, both set amidst a black surround. The lights flank the new grille, which is actually a gloss panel that runs much of the XUVs width. The new front bumper with its pronounced cuts and creases is very concept car-like and the newly contoured bonnet also does its bit to add volume to the design. New C-shaped LED DRLs provide a visual link with the larger XUV700. Like the XUV300, the 3XO looks muscular in profile, and furthering the impression are the stylish new 17-inch diamond cut alloy wheels that are the largest in the segment. Theres also chunkier side cladding with cuts at the wheel arches. Mahindra says ground clearance is a generous 201mm, up from the XUV300s figure of 180mm. Mahindra XUV 3XO Price, Mileage, Specifications, Features and Variants Brand Mahindra Model Name XUV 3XO Mahindra XUV 3XO Price 9.06 - 18.39 lakh Mahindra XUV 3XO Range/Mileage Petrol : 17.96 - 20.1kpl | Diesel : 20.6 - 21.2kpl Mahindra XUV 3XO Specifications SUV | 5 doors | 5 seats View All Specs Mahindra XUV 3XO Features LED headlight | 26.03-inch Touchscreen display | 6 airbags View All Features Mahindra XUV 3XO Variants MX1 1.2 Petrol MT | MX2 Pro 1.2 Petrol MT | MX3 1.2 Petrol MT View All Variants In its basic shape though, the 3XO is no different than the XUV300. The 2,600mm wheelbase remains class best, but the short overhangs, particularly at the back, tell you that this is a vehicle that's brutally shortened (remember it started life as a SsangYong Tivoli) to get length under the critical 4m mark, needed to qualify as a small car and hence a lower rate of tax. New 17-inch alloys are the largest in the segment. At the back, you sur\", 'images': [{'url': 'https://img.autocarindia.com/ExtraImages/20240502111525_First Drive 3XO Web.001.jpeg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO review', 'title': 'Mahindra XUV 3XO review', 'class': 'img-fluid', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/ExtraImages/20240502012130_First Drive 3XO Web.008.jpeg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO front quarter', 'title': 'Mahindra XUV 3XO front quarter', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/ExtraImages/20240502012130_First Drive 3XO Web.014.jpeg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO review - Feature and power packed compact SUV', 'title': 'Mahindra XUV 3XO review - Feature and power packed compact SUV', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/ExtraImages/20240502012130_First Drive 3XO Web.016.jpeg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO review - Feature and power packed compact SUV', 'title': 'Mahindra XUV 3XO review - Feature and power packed compact SUV', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/model/uploads/modelimages/Mahindra-XUV-3XO-290420241902.jpg', 'alt_text': 'Latest Image of Mahindra XUV 3XO', 'title': 'Mahindra XUV 3XO', 'class': 'img-fluid wid-img', 'loading': 'lazy', 'confidence': 0.7999999999999999}], 'rank': 3}, {'url': 'https://www.mahindra.com/news-room/press-release/en/mahindra-launches-XUV-3XO-REVX-series-starting-at-rs-8.94-lakh', 'content': 'Mahindra Launches XUV 3XO REVX Series Starting at 8.94 Lakh Skip to main content Who We Are Our Purpose Drive positive change in the lives of our communities. Only when we enable others to rise will we rise. #TogetherWeRise Purpose Led Performance Driven Future Ready Leadership Our History Museum What we do Key Facts 20+ Industries 100+ Countries 324K+ Employees Industries Automotive SUVs LCVs Last Mile Mobility Iconic Motorcycles Trucks And Buses Farm Equipments Tractors Agri Services Farm Machinery Financial Services Technology Services Hospitality Logistics Real Estate Renewables Other Emerging Businesses Advanced Technologies (Defence) Aerostructures Aftermarkets (Pre-Owned Cars) Auto Components and Recycling Power Generation Retail Our Brands Global Presence Cultural Outreach Investor Relations Investor Relations Group highlights. 18% Consolidated ROE 1592 B+ Revenue 129 B+ PAT 3.31 T+ Market cap as on date Disclosures Under Regulation 46 And 62 Of SEBI (LODR) Reports Policies Regulatory Filings Sustainability newsroom Newsroom Mahindra Launches XUV 3XO REVX Series Starting at 8.94 Lakh 8 July 2025 Auto Mahindra Tractors advanced mLIFT Precision Hydraulics system set to enhance local farm productivity in Rajasthan 8 July 2025 Farm Press Releases Media Resources In The News careers careers Committed to elevate the lives of communities, guided by our core behaviours and values. Bold. Agile. Collaborative. Find A Job SOAR - Seamless Opportunity For Amazing Returnship Leadership Programs Mahindra Leadership Program Mahindra Accelerated Leadership Track Mahindra Future Shapers Mahindra Leadership University Tech Opportunities Mahindra Digital Engine Submit Popular Keywords: Business FY 21 Brands XUV700 Global Nanhi Kali Recommended for you: Annual Report 2021 - 2022 Leadership Announcement Latest Press Release Brand Guidelines Mahindra Launches XUV 3XO REVX Series Starting at 8.94 Lakh Auto Home Newsroom Press Release Mahindra Launches XUV 3XO REVX Series Starting at 8.94 Lakh Author : mahindraadmin Category : Auto Published : 7/8/2025 Feature-packed, style-forward, and revved for performance Striking new exteriors with new body colored grille, black alloy wheels, dual-tone roof, and distinctive badging. Premium interiors offering exceptional value for customers in C-SUV segment under 10 Lakh with leatherette seats and sunroof. Mumbai, July 8, 2025: Mahindra & Mahindra Ltd., Indias leading SUV manufacturer, today unveiled the exciting new XUV 3XO REVX series, starting at an attractive price of .8.94 Lakh. The XUV 3XO recently achieved an impressive milestone of over 1 lakh sales in under a year, making it Mahindras fastest SUV to reach this milestone. The REVX series will further enhance the XUV 3XO portfolio with a compelling value offering of premium features, distinctive styling and best in segment performance, resonating with customer aspirations. Catering to individuals who seek vehicles that reflect their unique personality, the REVX series celebrates the spirit of personal expressionbecause for those who dare to stand out, \"Different is in.\" REVX Series key highlights: REVX M (Ex-Showroom Price: 8.94 Lakh) This variant is powered by a 1.2L mStallion TCMPFi engine delivering a power of 82 kW and torque of 200 Nm. Its bold exterior features a sleek front with a body-colored grille, full-width LED DRLs, R16 Black Wheel covers, and a sporty dual-tone roof, exuding confidence and style. Inside, it offers plush black leatherette seats, a 26.03 cm infotainment system with steering- mounted controls, and a 4-speaker audio setup for an immersive cabin experience. Safety is prioritized with 35 standard features, including six airbags, ESC with Hill Hold Control (HHC), and All 4 Disc Brakes. REVX M(O) (Ex-Showroom Price: 9.44 Lakh) This variant enhances sophistication with the addition of a single-pane sunroof, elevating the cabin experience and overall design appeal over REVX M. REVX A (Ex-Showroom Price starting at 1', 'images': [], 'rank': 4}, {'url': 'https://auto.hindustantimes.com/new-cars/mahindra/xuv-3xo', 'content': \"Mahindra XUV 3XO - On-Road Price, Features & Reviews XUV 3XO Price Specs & Features Mileage User Reviews Images Variants Reviews News Videos 1/24 MAHINDRA XUV 3XO Launched in Apr 2024 4.0 115 Reviews Review & Win 2000 7.99 - 15.79 Lakhs* *Ex-showroom price Get on road price Delhi Videos Photos Specs Colours Variants Check Offers XUV 3XO Key Specs Engine Category Average: 1199.0 - 1497.0 cc XUV 3XO : 1197.0 - 1497.0 cc Mileage Category Average: 18.87 kmpl XUV 3XO : 18.06-21.2 kmpl Power Category Average: 108.74 bhp XUV 3XO : 110.0 - 129.0 bhp View all XUV 3XO Specs and Features Mahindra XUV 3XO Latest Updates Latest News: 9 Jul 2025 : The XUV 3XO RevX introduces M and A trims with updated features, design elements, and engine options at mid-range prices. Read Full Story 8 Jul 2025 : Mahindra expands its XUV 3XO lineup with the RevX Series, featuring value-friendly trims and upgraded features. Read Full Story 5 Jul 2025 : Mahindra launches XUV 3XO in Australia with two variants, AX5L and AX7L, featuring advanced technology and competitive pricing. Read Full Story Mahindra XUV 3XO: Overview The Mahindra XUV 3XO is the heavily updated successor to the XUV300, introduced to reinforce Mahindras presence in the sub-4-metre compact SUV space in India. It brings an revamped design, fresh interiors, new technology, and updated engine options while continuing to target popular rivals, such as the Tata Nexon, Hyundai Venue, Maruti Suzuki Brezza, and Kia Sonet. The XUV 3XO offers an aggressive styling update, a more premium feature list, and multiple drivetrain choices catering to city users, families, and enthusiasts alike. Mahindra XUV 3XO: Price The Mahindra XUV 3XO is priced from 7.99 lakh for the entry-level petrol manual variant, while diesel variants begin at 9.99 lakh. The petrol automatic versions are available from 10.54 lakh, and the diesel automatic variants are priced from 14.70 lakh. The top-spec AX7 L TGDi petrol variant is priced at 15.79 lakh (all prices, ex-showroom Delhi). This broad price range allows the 3XO to cater to a wide demographic, from budget-conscious buyers to those seeking a premium experience with advanced technology and performance. Mahindra XUV 3XO: Launch Date The Mahindra XUV 3XO was officially launched in India on April 29, 2024. Replacing the XUV300 in Mahindra's lineup, it arrives with a complete redesign and a comprehensive update to its feature list, marking a significant evolution of the brand's compact SUV offering. Mahindra XUV 3XO: Variants and Colours Mahindra offers the XUV 3XO in nine broad variantsMX1, MX2, MX3, MX3 Pro, AX5, AX5 L, AX7, and AX7 L. The base MX1 variant is the most affordable, while the AX7 L TGDi is the top-end petrol variant. Diesel-powered variants start at 9.99 lakh and go up to 14.70 lakh for the automatic version. The SUV is available in eight single-tone coloursTango Red, Citrine Yellow, Everest White, Deep Forest, Galaxy Grey, Stealth Black, Dune Beige, and Nebula Bluealong with dual-tone options with black or grey roofs, depending on the body shade. Mahindra XUV 3XO: Mileage The Mahindra XUV 3XO offers multiple engine and transmission options, leading to varying fuel economy figures. The 1.5-litre diesel engine delivers an ARAI-certified mileage of 20.6 kmpl. The 1.2-litre turbo-petrol manual variants claim 20.1 kmpl, while the automatic versions offer up to 18.2 kmpl. Real-world efficiency depends on the driving environment, vehicle load, and driving habits. Mahindra XUV 3XO: Specs & Features The Mahindra XUV 3XO sports a fully reworked exterior featuring a bold new grille, LED projector headlamps, C-shaped LED DRLs, and a full-width LED light bar at the rear. The side profile has been updated with fresh alloy wheel designs and rugged cladding. Inside, the 3XO debuts a new dashboard with a 10.25-inch touchscreen infotainment system using Mahindras AdrenoX UI, a 10.25-inch digital drivers display, dual-zone climate control with rear AC vents, and wireless c\", 'images': [{'url': 'https://auto.hindustantimes.com/cms-images/mahindra_xuv-3xo/images/exterior_mahindra-xuv-3xo_front-left-side_1063x676.jpg?imwidth=420', 'alt_text': 'Mahindra XUV 3XO Front Left Side', 'class': 'pdpImageModelElement', 'loading': 'eager', 'confidence': 0.7999999999999999}, {'url': 'https://auto.hindustantimes.com/_next/image?url=https%3A%2F%2Fhtcms-prod-images.s3.ap-south-1.amazonaws.com%2Fhtmobile1%2Fmahindra_xuv-3xo%2Fheroimage%2Fthumbnail_mahindra-xuv-3xo.png&w=3840&q=75', 'alt_text': 'Mahindra XUV 3XO', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://auto.hindustantimes.com/_next/image?url=https%3A%2F%2Fimages.hindustantimes.com%2Fauto%2Fimg%2F2024%2F05%2F08%2F600x338%2FMahindra_XUV_3XO_main_5_1715148990745_1715149067995.jpg&w=3840&q=75', 'alt_text': 'The price range of the Mahindra XUV 3XO is one of the widest in the segment with the top version nearly double than the base version.', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://auto.hindustantimes.com/_next/image?url=https%3A%2F%2Fimages.hindustantimes.com%2Fauto%2Fimg%2F2024%2F05%2F08%2F600x338%2FMahindra_XUV_3XO_main_6_1715149052848_1715149080717.jpg&w=3840&q=75', 'alt_text': 'The Mahindra XUV 3XO measures 3990 mm in length, is 1821 mm wide and stands 1647 mm with its roof rails.', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://auto.hindustantimes.com/_next/image?url=https%3A%2F%2Fimages.hindustantimes.com%2Fauto%2Fimg%2F2024%2F05%2F08%2F600x338%2FMahindra_XUV_3XO_main_7_1715149089737_1715149106474.jpg&w=3840&q=75', 'alt_text': 'The colour options on the Mahindra XUV 3XO include Yellow, Deep Forest which is basically dark Green, White, Black, Grey, Blue, Beige and Red. There are dual-tone options on the upper variants as well.', 'loading': 'lazy', 'confidence': 0.7999999999999999}], 'rank': 5}, {'url': 'https://www.team-bhp.com/news/2024-mahindra-xuv-3xo-review-8-pros-7-cons', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://www.spinny.com/cars/mahindra/xuv-3xo/', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://whatinsider.com/mahindra-xuv-3xo/', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null,
            "_meta": null
          }
        ]
      },
      "error": null,
      "cost": 0.0,
      "start_time": "2025-07-15T19:34:47.745406",
      "end_time": "2025-07-15T19:35:03.710029",
      "execution_time": 15.964623,
      "input_tokens": 0,
      "output_tokens": 0,
      "execution_result": null
    }
  ],
  "links": [
    {
      "source": "ROOT",
      "target": "T001"
    }
  ]
}