{
  "directed": true,
  "multigraph": false,
  "graph": {
    "session_id": "53015686",
    "original_query": "You are a stock researcher, prepare a very very detailed and comprehensive report on Asian Paints. You must include graphs, tables, comparisons. Finally you must share a well formatted and polished HTML report. You get extra money for making the report very comprehensive and visually appealing! (use Report Generator Agent directly to generate charts, tables and HTML report).",
    "file_manifest": [],
    "created_at": "2025-07-20T12:48:06.626679",
    "status": "running",
    "output_chain": {
      "T001": {
        "iterations": [
          {
            "iteration": 1,
            "output": {
              "asian_paints_data": [
                {
                  "type": "text",
                  "text": "[{'url': 'https://startuptalky.com/asian-paints-case-study/', 'content': \"Asian Paints: Asian Paints: A Leader in Innovation in the Paint Industry | Founders | Business Model | Case Study | Marketing Companies News StartupTalker Interviews Opinions Tools Insights Learnings Podcasts Get Featured Asian Paints: A Leader in Innovation in the Paint Industry Company Profiles Rishita Jain , Apoorva Bajj 21              Nov 2024 16 min read Asian Paints Case Study Asian Paints is the leading paint company in India and primarily focuses on the manufacturing, selling, and distribution of paints, coatings, and other products related to home dcor , bath fittings , and more. Asian Paints is headquartered in Mumbai, Maharashtra. Talking about Asian Paints, it is a leading name in the paint industry, known for its innovative products, high-quality solutions, and strong customer focus. It is the largest paints corporation in India and the third-largest in Asia. Asian Paints is also known as the holding company of Berger International. The manufacturing operations of Asian Paints are currently spread across 15 countries in the world, including India and the Middle East. As per Statista, Asian Paints generated an operating revenue of INR 30800 crore in FY24. Read to know more about the Asian Paints Case study, where you will learn about Asian Paints founders, history, tools and products, its intriguing business model, distribution strategy, supply chain network, marketing strategies & successful campaigns led by Asian Paints, Asian Paints acquisitions, and a distinct global analysis of Asian Paints. Case Study on Asian Paints Asian Paints Information Company Asian Paints Headquarters Mumbai Founded 1 February 1942 Founders Champaklal Choksey, Chimanlal Choksi, Suryakant Dani, Arvind Vakil CEO Amit Syngle (1 Apr 2020 - Present) Key People Ashwin Dani (Chairman) Manish Choksi (Vice Chairman) Amit Syngle (CEO) Abhay Vakil (Non Executive Director) Revenue INR 308.5 billion (2024) Type Public Asian Paints - Industry Asian Paints - Startup Story and History Asian Paints - Logo and Tagline Asian Paints - Vision, Mission and Goals Asian Paints - Tools, Products and Services Asian Paints - Global Analysis Asian Paints - Marketing Strategies Asian Paints - Marketing Campaigns Asian Paints - Business Model & Supply Chain Asian Paints - Growth Asian Paints - Weaknesses Asian Paints - Acquisitions Asian Paints - Challenges Asian Paints - Future Plans Asian Paints - Industry Asian Paints came out as the market leader in the paints segment, when last seen in 2023-2024. The company boasted of having a market share of around 59%. Talking about the organized segment, Asian Paints led the decorative market segment, while Kansai Nerolac led the industrial segment. The India Paints and Coatings Market is valued at USD 9.56 billion in 2024 and is expected to grow to USD 15.00 billion by 2029, with a growth rate (CAGR) of 9.38% during this period. The current market share of Asian Paints has been recorded at 59% of the Indian paints industry. Market Share of Paint Companies in India Asian Paints - Startup Story and History Asian Paints was started in 1942 by four entrepreneurs: Champaklal H. Choksey, Chimanlal N. Choksi, Suryakant C.Dani, and Arvind R. Vakil. Champaklal and others initially functioned out of a garage in Bombay that was rented at INR 75 per month. The main aim behind the launch of Asian Paints was to found the world's biggest and the most successful paint company operating in India. Asian Paints was known as The Asian Oil & Paint Company' in the beginning; the name was randomly picked up at that time from a telephone directory. It was a set up as a partnership firm of four friends when it was started in 1942. In 1945, the partnership firm turned itself into a private limited company following a turnover of INR 0.35 million that year. During World War II and the Quit India Movement of 1942, there was a temporary ban on paint imports. As a result, companies such Shalimar Paints and Asian Paints took it up thems\", 'images': [{'url': 'https://static.startuptalky.com/2021/06/Asian-Paints-Infographic.jpg', 'alt_text': 'Asian Paints success story', 'width': '1424', 'height': '3230', 'class': 'kg-image', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://static.startuptalky.com/2024/01/Market-Share-of-Paint-Companies-in-India-StartupTalky.jpg', 'alt_text': 'Market Share of Paint Companies in India', 'width': '1200', 'height': '800', 'class': 'kg-image', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://static.startuptalky.com/2020/09/Gattu_startuptalky.png', 'alt_text': 'Asian Paints Logo', 'width': '800', 'height': '450', 'class': 'kg-image', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://static.startuptalky.com/2024/11/Revenue-Share-of-Asian-Paints-StartupTalky.png', 'alt_text': 'Revenue Share From International Operations for Asian Paints Limited in the Financial Year 2024, by Region', 'width': '1200', 'height': '800', 'class': 'kg-image', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://static.startuptalky.com/2024/11/Asian-Paints-Shareholding-Pattern-StartupTalky.png', 'alt_text': 'Asian Paints Shareholding Pattern', 'width': '1200', 'height': '800', 'class': 'kg-image', 'loading': 'lazy', 'confidence': 0.8999999999999999}], 'rank': 1}, {'url': 'https://www.tradersideology.com/fundamental-analysis-of-asian-paints/', 'content': '[no text]', 'images': [], 'rank': 2}, {'url': 'https://enrichmoney.in/blog-article/asian-paints-history-subsidiaries-and-share-price', 'content': \"Asian Paints: History, Latest Updates, Milestones, Subsidiaries & Share Price About Research Equity Report Nifty and Bank Nifty Market Outlooks Commodity Report Gold, Crude Oil, Silver, Natural Gas, etc Live Level Support, Resistance and Pivot Levels Expert Webinar Online Sessions from Industry Experts Knowledge Center Learn Fundamental and Technical Analysis Pricing Orca Partner Login Open Demat Blog Stocks Asian Paints: History, Latest Updates, Milestones, Subsidiaries & Share Price Asian Paints: History, Latest Updates, Milestones, Subsidiaries & Share Price Introduction Asian Paints manufactures a wide range of paints for decoration and industrial use. It offers products for wall coverings, water proofing, adhesives and services too. It also offers interior designing, along with decors for bath and kitchen rooms. It has also included lightnings, furnishings and furniture in its portfolio. Asian Paints has entered into an agreement with Weatherseal Fenestration for engaging in the business of interior decoration / furnishing. The company has also entered into an agreement with White Teak firm to involve in business of decorative lightning products and fans Asian PaintsMoves In 2025: January 2025 Asian Paints witnessed a significant decline in its stock valuation, reaching its lowest point in the past 52 weeks. The downturn was primarily on account of muted investor sentiments and prevailing market woes, placing pressure on the stock's performance against benchmark indices. February 2025 The Q3 FY25 results of the company reported a year-over-year fall in net profit by more than 20%. Operating margins also narrowed on account of higher input costs and competitive pricing, leading to concerns over future earnings momentum. March 2025 Asian Paints initiated leadership changes in its global operations. Joseph Eapen was elevated to head its global business, a decision to enhance the company's international presence and consolidate expansion plans. April 2025 Increased competition from Aditya Birla's recently introduced brand 'Birla Opus' started affecting Asian Paints' market position. The aggressive pricing policy of the competitor put pressure on the decorative paints segment. May 2025 In Q4 FY25, Asian Paints reported a steep decline in profitalmost 45% lower year-on-yearbecause of soft domestic demand and a one-time loss associated with exiting its Indonesia business. Asian Paints Moves In 2023-2024: Asian Paints has made an announcement of their financial results for the Q1, Q2 and Q3 quarter for the financial year 2024. Asian Paints share price today (23.01.2024) is Rs. 3061.65. Asian Paints share price is also trading at a bearish price change of -2.61%. Evolution Of Asian Paints: From Past to Present: Year Evolution 1942 Founding of Asian Paints in Bombay (now Mumbai) by four visionary friends. 1945 Establishment of the company under the name Asian Oil and Paint Company Pvt. Ltd., with a focus on surface coatings and latex for rubber tires. 1965 Change of the company's name to Asian Paints (India) Pvt. Ltd. 1973 Conversion of Asian Paints into a Public Limited Company. 1975 Issuance of bonus equity shares to shareholders. 1985 Expansion with new paint units in Patancheru and collaboration with Nippon Paints for powder coatings. 1987 Entry into synthetic rubber lattices production and receipt of a letter of intent for phthalic anhydride manufacturing. 1988 Issuance of secured non-convertible debentures to financial institutions. 1990 Expansion to Fiji, Tonga, Australia, and collaborations in Nepal and Sri Lanka. 1991 Pentasia Chemicals Ltd. became a subsidiary and later merge into Asian Paints. 1993 Operations expanded to Australia, and a joint venture with Mauritius was established. 1995 Expansion of manufacturing capacities in Visakhapatnam, and collaboration with PT Abadi Coating Solusi, Indonesia. 1996 Formation of a joint venture with PPG Industries, USA, for automotive paints. 1999 Acquisition of a majority stake in\", 'images': [{'url': 'https://fileserver.enrichmoney.in/Content\\\\UploadedFiles\\\\MFXWyIfx-KM85UniE3-zy6f3_20240228102425357.jpg', 'alt_text': 'Asian Paints', 'width': '1000', 'height': '500', 'confidence': 0.8999999999999999}, {'url': 'https://enrichmoney.in/_next/image?url=%2Fimages%2Fhero%2Fwhatsapp.png&w=1920&q=75', 'alt_text': 'Enrich money logo', 'width': '800', 'height': '800', 'loading': 'lazy', 'confidence': 0.8999999999999999}], 'rank': 3}, {'url': 'https://dcfmodeling.com/blogs/history/asianpaintns-history-mission-ownership', 'content': \"Asian Paints (ASIANPAINTNS): history, ownership, mission, how it works & makes money DCFmodeling.com Skip to content STOCK EXCHANGES AMEX NASDAQ NYSE SHZ HKSE LSE JPX NSE SHH EURONEXT PRODUCTS Business Model Canvas BCG Matrix Company Profile DCF Valuation SWOT Analysis Porter's Five Forces Analysis PESTLE Analysis Marketing Mix Analysis ANSOFF Matrix VRIO Analysis BLOGS History Financial Health Investor Profile Vision Other Search Cart 0 / $0.00 EN EN ES PT FR AR DE Asian Paints Limited: history, ownership, mission, how it works & makes money IN | Basic Materials | Chemicals - Specialty | NSE Company Profile Vision Financial Health Investor Profile Asian Paints Limited (ASIANPAINT.NS) Bundle Get Full Bundle: DCF Model $25 $15 Porter's Five Forces $12 $7 ANSOFF Matrix $12 $7 BCG Matrix $12 $7 Canvas $12 $7 Marketing Mix $12 $7 PESTLE Analysis $12 $7 VRIO Analysis $12 $7 SWOT Analysis $12 $7 TOTAL: ADD SELECTED TO CART Home History Owners Mission How It Works How It Makes Money A Brief History of Asian Paints Limited Asian Paints Limited, established in 1942 , is the largest paint manufacturer in India and one of the leading companies in the Asia-Pacific region. The company was founded by four friends B. D. Ghosh, S. P. Sinha, B. R. Rathi, and S. B. Sinhain a small garage in Mumbai. Initially, the company focused on producing paints for local markets. In the 1960s, Asian Paints expanded its product line by introducing a range of synthetic paints, which contributed to its growth. The introduction of the 'Asian Paints Color World' in 1973 enabled consumers to select colors more effectively. The company further diversified by entering into the decorative paints segment in 1980 . By the end of the 1990s , Asian Paints became a house-hold name in India, with a market share of approximately 40% . In 1996 , the company was listed on the stock exchanges, achieving a market capitalization growth to around 30,000 crore by 2021 . Asian Paints' international expansion included ventures in countries like Bangladesh, Egypt, and Mauritius . The establishment of the companys subsidiary, Berger International , in 1993 , further solidified its footprint in Southeast Asia. As of March 2023 , Asian Paints has a presence in over 15 countries and operates more than 25 manufacturing facilities . Year Key Milestones Market Share (%) Revenue ( Crores) 1942 Company Founded N/A N/A 1973 Introduction of Color World N/A N/A 1980 Diversification into Decorative Paints N/A N/A 1996 Listed on Stock Exchanges Approx. 40% N/A 2021 Market Capitalization Growth N/A 30,000 2023 Presence in 15 Countries Approx. 42% 25,000 In 2020 , the COVID-19 pandemic posed significant challenges, impacting sales and manufacturing. However, Asian Paints adapted its operations, embracing digital initiatives for reach and engagement. By the end of 2021 , the company reported a revenue of 22,508 crores with a net profit of 3,939 crores . As of September 2023 , Asian Paints continues to lead in the Indian paint industry with a market capitalization of approximately 2.75 lakh crores . The companys commitment to sustainability remains strong, with eco-friendly products constituting a growing portion of its offerings. Asian Paints' stock showed resilience, closing at about 3,200 per share in early October 2023 , reflecting a year-to-date return of approximately 20% , outperforming the broader market indices. A Who Owns Asian Paints Limited Asian Paints Limited is one of India's largest paint companies, with a diverse ownership structure. It was founded in 1942 and operates in over 20 countries. As of the latest available data, the ownership breakdown is as follows: Ownership Category Percentage Ownership Number of Shares Promoters 52.80% 1,908,249,976 Foreign Institutional Investors (FIIs) 23.46% 844,837,183 Domestic Institutional Investors (DIIs) 10.28% 373,212,362 Retail Investors 13.46% 486,024,456 The largest shareholder among the promoters is the Narayana Murthy family, which holds\", 'images': [], 'rank': 4}, {'url': 'https://quaintel.com/store/report/asian-paints-ltd-company-profile-swot-pestle-value-chain-analysis', 'content': \"Asian Paints SWOT & PESTLE Analysis Quaintel Research Home Contact Us FAQs 0 Login/Register Home Industries Aerospace & Defense Agriculture & Forestry Automotive Business & Consumer Services Chemicals Construction Consumer Packaged Goods Environmental & Waste Management Financial Services Industrial Goods & Machinery Leisure & Arts Media Medical Devices Metals & Mining Oil & Gas Paper & Packaging Pharmaceuticals & Healthcare Power Retail Technology & Communications Textiles Transport & Logistics Wholesale Miscellaneous Services Strategy & Innovation Sales Intelligence Investment Attractiveness Competitive Intelligence Consulting Report Store View Point About Us Asian Paints Ltd (ASIANPAINT:NSE) Strategic SWOT, PESTLE Analysis and Financial Insight - Assessment of Opportunities, Challenges and Risk, Corporate and ESG Strategies, Competitive Intelligence, Financial and Operational KPI's, and Recent Trends Asian Paints Limited operates as a paint manufacturing company. Asian Paints Limited operates in the decorative paints segment providing interior and exterior paints, wood finishes, waterproofing and... Get Insights Home Chemicals Asian Paints Ltd (ASIANPAINT:NSE) Strategic SWOT, PESTLE Analysis and Financial Insight - Assessment of Opportunities, Challenges and Risk, Corporate and ESG Strategies, Competitive Intelligence, Financial and Operational KPI's, and Recent Trends Summary Table of Contents FAQs Enquire / Request Samples Email this Page to a Colleague Report Spotlight Asian Paints Limited operates as a paint manufacturing company. Asian Paints Limited operates in the decorative paints segment providing interior and exterior paints, wood finishes, waterproofing and other related products and services. It also operates in the home improvement and decor segment. Asian Paints Limited offers a wide range of products and services including paints for home decoration, wood finishes, waterproofing solutions, wallpapers, adhesives, bath fittings, modular kitchens, lighting products, furniture, personalized design services, safe painting services, and color consultancy. The company provides interior and exterior wall paints, enamels, undercoats, thinners, varnishers, sanitizers, and surface disinfectants under brands like Asian Paints, Apco Coatings, Asian Paints Berger, Asian Paints Causeway, SCIB Paints, Taubmans, and Kadisco Asian Paints. Founded in 1942, the company is headquartered in Mumbai, Maharashtra, India. The report offers a comprehensive and easily accessible overview of the Asian Paints Ltd's business operations. It presents all available data in a detailed format, including SWOT and PESTLE Analysis, ESG Spotlight, Financial KPI's & Benchmarking and more. By integrating these strategic analyses, the report provides a comprehensive understanding of the Asian Paints Ltd's overall strategic standing. This comprehensive assessment supports informed decision-making, strategic planning, and the development of sustainable business strategies. Key Inclusions in the report: In-depth Asian Paints Ltd Information:- Deep dive into the internal workings of the company, this section provides unparalleled knowledge and facilitates a comprehensive understanding of the company's key attributes. Asian Paints Ltd's Strategic Standing:- The report presents a comprehensive assessment of the Asian Paints Ltd's strategic standing, incorporating key elements such as ESG (Environmental, Social, and Governance) spotlight, SWOT and PESTLE Analysis. By analysing these internal factors, the report provides insights into the company's sustainability efforts and its alignment with ethical and responsible business practices, Asian Paints Ltd's current standing and areas for strategic focus. By understanding the company's external factors, the report highlights opportunities to enhance efficiency, reduce costs, gain a competitive advantage and on the same time identify potential risks and opportunities arising from the external landscape. Asian Pa\", 'images': [{'url': 'https://quaintel.com/uploads/files1/6553781c6739c.webp', 'alt_text': 'Quaintel Research', 'confidence': 0.7}], 'rank': 5}, {'url': 'https://www.pocketful.in/blog/asian-paints-case-study-business-segments-kpis-financials-and-swot-analysis/', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://www.ijfmr.com/papers/2023/4/5866.pdf', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://www.thebusinessscroll.com/asian-paints-business-model/', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
                  "annotations": null
                }
              ]
            }
          }
        ],
        "final_output": null,
        "iteration_count": 1
      }
    },
    "validation_results": {
      "is_valid": true,
      "is_dag": true,
      "cycles": [],
      "disconnected_components": [],
      "orphaned_nodes": [],
      "root_nodes": [],
      "leaf_nodes": [
        "T005"
      ],
      "warnings": [],
      "errors": []
    }
  },
  "nodes": [
    {
      "description": "Initial Query",
      "agent": "System",
      "status": "completed",
      "id": "ROOT"
    },
    {
      "id": "T001",
      "description": "Gather general information about Asian Paints, including its history, products, services, and market presence.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Research and gather comprehensive information about Asian Paints, including its history, products, services, market share, business model and overall operations. Focus on aspects relevant to stock analysis and investment.",
      "reads": [],
      "writes": [
        "T001"
      ],
      "status": "running",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": "2025-07-20T12:48:06.639588",
      "end_time": null,
      "execution_time": 0.0,
      "execution_result": {
        "status": "success",
        "session_id": "53015686",
        "operations": [
          "python_code"
        ],
        "created_files": [],
        "file_results": {},
        "code_results": {
          "status": "success",
          "result": {
            "asian_paints_data": [
              {
                "type": "text",
                "text": "[{'url': 'https://startuptalky.com/asian-paints-case-study/', 'content': \"Asian Paints: Asian Paints: A Leader in Innovation in the Paint Industry | Founders | Business Model | Case Study | Marketing Companies News StartupTalker Interviews Opinions Tools Insights Learnings Podcasts Get Featured Asian Paints: A Leader in Innovation in the Paint Industry Company Profiles Rishita Jain , Apoorva Bajj 21              Nov 2024 16 min read Asian Paints Case Study Asian Paints is the leading paint company in India and primarily focuses on the manufacturing, selling, and distribution of paints, coatings, and other products related to home dcor , bath fittings , and more. Asian Paints is headquartered in Mumbai, Maharashtra. Talking about Asian Paints, it is a leading name in the paint industry, known for its innovative products, high-quality solutions, and strong customer focus. It is the largest paints corporation in India and the third-largest in Asia. Asian Paints is also known as the holding company of Berger International. The manufacturing operations of Asian Paints are currently spread across 15 countries in the world, including India and the Middle East. As per Statista, Asian Paints generated an operating revenue of INR 30800 crore in FY24. Read to know more about the Asian Paints Case study, where you will learn about Asian Paints founders, history, tools and products, its intriguing business model, distribution strategy, supply chain network, marketing strategies & successful campaigns led by Asian Paints, Asian Paints acquisitions, and a distinct global analysis of Asian Paints. Case Study on Asian Paints Asian Paints Information Company Asian Paints Headquarters Mumbai Founded 1 February 1942 Founders Champaklal Choksey, Chimanlal Choksi, Suryakant Dani, Arvind Vakil CEO Amit Syngle (1 Apr 2020 - Present) Key People Ashwin Dani (Chairman) Manish Choksi (Vice Chairman) Amit Syngle (CEO) Abhay Vakil (Non Executive Director) Revenue INR 308.5 billion (2024) Type Public Asian Paints - Industry Asian Paints - Startup Story and History Asian Paints - Logo and Tagline Asian Paints - Vision, Mission and Goals Asian Paints - Tools, Products and Services Asian Paints - Global Analysis Asian Paints - Marketing Strategies Asian Paints - Marketing Campaigns Asian Paints - Business Model & Supply Chain Asian Paints - Growth Asian Paints - Weaknesses Asian Paints - Acquisitions Asian Paints - Challenges Asian Paints - Future Plans Asian Paints - Industry Asian Paints came out as the market leader in the paints segment, when last seen in 2023-2024. The company boasted of having a market share of around 59%. Talking about the organized segment, Asian Paints led the decorative market segment, while Kansai Nerolac led the industrial segment. The India Paints and Coatings Market is valued at USD 9.56 billion in 2024 and is expected to grow to USD 15.00 billion by 2029, with a growth rate (CAGR) of 9.38% during this period. The current market share of Asian Paints has been recorded at 59% of the Indian paints industry. Market Share of Paint Companies in India Asian Paints - Startup Story and History Asian Paints was started in 1942 by four entrepreneurs: Champaklal H. Choksey, Chimanlal N. Choksi, Suryakant C.Dani, and Arvind R. Vakil. Champaklal and others initially functioned out of a garage in Bombay that was rented at INR 75 per month. The main aim behind the launch of Asian Paints was to found the world's biggest and the most successful paint company operating in India. Asian Paints was known as The Asian Oil & Paint Company' in the beginning; the name was randomly picked up at that time from a telephone directory. It was a set up as a partnership firm of four friends when it was started in 1942. In 1945, the partnership firm turned itself into a private limited company following a turnover of INR 0.35 million that year. During World War II and the Quit India Movement of 1942, there was a temporary ban on paint imports. As a result, companies such Shalimar Paints and Asian Paints took it up thems\", 'images': [{'url': 'https://static.startuptalky.com/2021/06/Asian-Paints-Infographic.jpg', 'alt_text': 'Asian Paints success story', 'width': '1424', 'height': '3230', 'class': 'kg-image', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://static.startuptalky.com/2024/01/Market-Share-of-Paint-Companies-in-India-StartupTalky.jpg', 'alt_text': 'Market Share of Paint Companies in India', 'width': '1200', 'height': '800', 'class': 'kg-image', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://static.startuptalky.com/2020/09/Gattu_startuptalky.png', 'alt_text': 'Asian Paints Logo', 'width': '800', 'height': '450', 'class': 'kg-image', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://static.startuptalky.com/2024/11/Revenue-Share-of-Asian-Paints-StartupTalky.png', 'alt_text': 'Revenue Share From International Operations for Asian Paints Limited in the Financial Year 2024, by Region', 'width': '1200', 'height': '800', 'class': 'kg-image', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://static.startuptalky.com/2024/11/Asian-Paints-Shareholding-Pattern-StartupTalky.png', 'alt_text': 'Asian Paints Shareholding Pattern', 'width': '1200', 'height': '800', 'class': 'kg-image', 'loading': 'lazy', 'confidence': 0.8999999999999999}], 'rank': 1}, {'url': 'https://www.tradersideology.com/fundamental-analysis-of-asian-paints/', 'content': '[no text]', 'images': [], 'rank': 2}, {'url': 'https://enrichmoney.in/blog-article/asian-paints-history-subsidiaries-and-share-price', 'content': \"Asian Paints: History, Latest Updates, Milestones, Subsidiaries & Share Price About Research Equity Report Nifty and Bank Nifty Market Outlooks Commodity Report Gold, Crude Oil, Silver, Natural Gas, etc Live Level Support, Resistance and Pivot Levels Expert Webinar Online Sessions from Industry Experts Knowledge Center Learn Fundamental and Technical Analysis Pricing Orca Partner Login Open Demat Blog Stocks Asian Paints: History, Latest Updates, Milestones, Subsidiaries & Share Price Asian Paints: History, Latest Updates, Milestones, Subsidiaries & Share Price Introduction Asian Paints manufactures a wide range of paints for decoration and industrial use. It offers products for wall coverings, water proofing, adhesives and services too. It also offers interior designing, along with decors for bath and kitchen rooms. It has also included lightnings, furnishings and furniture in its portfolio. Asian Paints has entered into an agreement with Weatherseal Fenestration for engaging in the business of interior decoration / furnishing. The company has also entered into an agreement with White Teak firm to involve in business of decorative lightning products and fans Asian PaintsMoves In 2025: January 2025 Asian Paints witnessed a significant decline in its stock valuation, reaching its lowest point in the past 52 weeks. The downturn was primarily on account of muted investor sentiments and prevailing market woes, placing pressure on the stock's performance against benchmark indices. February 2025 The Q3 FY25 results of the company reported a year-over-year fall in net profit by more than 20%. Operating margins also narrowed on account of higher input costs and competitive pricing, leading to concerns over future earnings momentum. March 2025 Asian Paints initiated leadership changes in its global operations. Joseph Eapen was elevated to head its global business, a decision to enhance the company's international presence and consolidate expansion plans. April 2025 Increased competition from Aditya Birla's recently introduced brand 'Birla Opus' started affecting Asian Paints' market position. The aggressive pricing policy of the competitor put pressure on the decorative paints segment. May 2025 In Q4 FY25, Asian Paints reported a steep decline in profitalmost 45% lower year-on-yearbecause of soft domestic demand and a one-time loss associated with exiting its Indonesia business. Asian Paints Moves In 2023-2024: Asian Paints has made an announcement of their financial results for the Q1, Q2 and Q3 quarter for the financial year 2024. Asian Paints share price today (23.01.2024) is Rs. 3061.65. Asian Paints share price is also trading at a bearish price change of -2.61%. Evolution Of Asian Paints: From Past to Present: Year Evolution 1942 Founding of Asian Paints in Bombay (now Mumbai) by four visionary friends. 1945 Establishment of the company under the name Asian Oil and Paint Company Pvt. Ltd., with a focus on surface coatings and latex for rubber tires. 1965 Change of the company's name to Asian Paints (India) Pvt. Ltd. 1973 Conversion of Asian Paints into a Public Limited Company. 1975 Issuance of bonus equity shares to shareholders. 1985 Expansion with new paint units in Patancheru and collaboration with Nippon Paints for powder coatings. 1987 Entry into synthetic rubber lattices production and receipt of a letter of intent for phthalic anhydride manufacturing. 1988 Issuance of secured non-convertible debentures to financial institutions. 1990 Expansion to Fiji, Tonga, Australia, and collaborations in Nepal and Sri Lanka. 1991 Pentasia Chemicals Ltd. became a subsidiary and later merge into Asian Paints. 1993 Operations expanded to Australia, and a joint venture with Mauritius was established. 1995 Expansion of manufacturing capacities in Visakhapatnam, and collaboration with PT Abadi Coating Solusi, Indonesia. 1996 Formation of a joint venture with PPG Industries, USA, for automotive paints. 1999 Acquisition of a majority stake in\", 'images': [{'url': 'https://fileserver.enrichmoney.in/Content\\\\UploadedFiles\\\\MFXWyIfx-KM85UniE3-zy6f3_20240228102425357.jpg', 'alt_text': 'Asian Paints', 'width': '1000', 'height': '500', 'confidence': 0.8999999999999999}, {'url': 'https://enrichmoney.in/_next/image?url=%2Fimages%2Fhero%2Fwhatsapp.png&w=1920&q=75', 'alt_text': 'Enrich money logo', 'width': '800', 'height': '800', 'loading': 'lazy', 'confidence': 0.8999999999999999}], 'rank': 3}, {'url': 'https://dcfmodeling.com/blogs/history/asianpaintns-history-mission-ownership', 'content': \"Asian Paints (ASIANPAINTNS): history, ownership, mission, how it works & makes money DCFmodeling.com Skip to content STOCK EXCHANGES AMEX NASDAQ NYSE SHZ HKSE LSE JPX NSE SHH EURONEXT PRODUCTS Business Model Canvas BCG Matrix Company Profile DCF Valuation SWOT Analysis Porter's Five Forces Analysis PESTLE Analysis Marketing Mix Analysis ANSOFF Matrix VRIO Analysis BLOGS History Financial Health Investor Profile Vision Other Search Cart 0 / $0.00 EN EN ES PT FR AR DE Asian Paints Limited: history, ownership, mission, how it works & makes money IN | Basic Materials | Chemicals - Specialty | NSE Company Profile Vision Financial Health Investor Profile Asian Paints Limited (ASIANPAINT.NS) Bundle Get Full Bundle: DCF Model $25 $15 Porter's Five Forces $12 $7 ANSOFF Matrix $12 $7 BCG Matrix $12 $7 Canvas $12 $7 Marketing Mix $12 $7 PESTLE Analysis $12 $7 VRIO Analysis $12 $7 SWOT Analysis $12 $7 TOTAL: ADD SELECTED TO CART Home History Owners Mission How It Works How It Makes Money A Brief History of Asian Paints Limited Asian Paints Limited, established in 1942 , is the largest paint manufacturer in India and one of the leading companies in the Asia-Pacific region. The company was founded by four friends B. D. Ghosh, S. P. Sinha, B. R. Rathi, and S. B. Sinhain a small garage in Mumbai. Initially, the company focused on producing paints for local markets. In the 1960s, Asian Paints expanded its product line by introducing a range of synthetic paints, which contributed to its growth. The introduction of the 'Asian Paints Color World' in 1973 enabled consumers to select colors more effectively. The company further diversified by entering into the decorative paints segment in 1980 . By the end of the 1990s , Asian Paints became a house-hold name in India, with a market share of approximately 40% . In 1996 , the company was listed on the stock exchanges, achieving a market capitalization growth to around 30,000 crore by 2021 . Asian Paints' international expansion included ventures in countries like Bangladesh, Egypt, and Mauritius . The establishment of the companys subsidiary, Berger International , in 1993 , further solidified its footprint in Southeast Asia. As of March 2023 , Asian Paints has a presence in over 15 countries and operates more than 25 manufacturing facilities . Year Key Milestones Market Share (%) Revenue ( Crores) 1942 Company Founded N/A N/A 1973 Introduction of Color World N/A N/A 1980 Diversification into Decorative Paints N/A N/A 1996 Listed on Stock Exchanges Approx. 40% N/A 2021 Market Capitalization Growth N/A 30,000 2023 Presence in 15 Countries Approx. 42% 25,000 In 2020 , the COVID-19 pandemic posed significant challenges, impacting sales and manufacturing. However, Asian Paints adapted its operations, embracing digital initiatives for reach and engagement. By the end of 2021 , the company reported a revenue of 22,508 crores with a net profit of 3,939 crores . As of September 2023 , Asian Paints continues to lead in the Indian paint industry with a market capitalization of approximately 2.75 lakh crores . The companys commitment to sustainability remains strong, with eco-friendly products constituting a growing portion of its offerings. Asian Paints' stock showed resilience, closing at about 3,200 per share in early October 2023 , reflecting a year-to-date return of approximately 20% , outperforming the broader market indices. A Who Owns Asian Paints Limited Asian Paints Limited is one of India's largest paint companies, with a diverse ownership structure. It was founded in 1942 and operates in over 20 countries. As of the latest available data, the ownership breakdown is as follows: Ownership Category Percentage Ownership Number of Shares Promoters 52.80% 1,908,249,976 Foreign Institutional Investors (FIIs) 23.46% 844,837,183 Domestic Institutional Investors (DIIs) 10.28% 373,212,362 Retail Investors 13.46% 486,024,456 The largest shareholder among the promoters is the Narayana Murthy family, which holds\", 'images': [], 'rank': 4}, {'url': 'https://quaintel.com/store/report/asian-paints-ltd-company-profile-swot-pestle-value-chain-analysis', 'content': \"Asian Paints SWOT & PESTLE Analysis Quaintel Research Home Contact Us FAQs 0 Login/Register Home Industries Aerospace & Defense Agriculture & Forestry Automotive Business & Consumer Services Chemicals Construction Consumer Packaged Goods Environmental & Waste Management Financial Services Industrial Goods & Machinery Leisure & Arts Media Medical Devices Metals & Mining Oil & Gas Paper & Packaging Pharmaceuticals & Healthcare Power Retail Technology & Communications Textiles Transport & Logistics Wholesale Miscellaneous Services Strategy & Innovation Sales Intelligence Investment Attractiveness Competitive Intelligence Consulting Report Store View Point About Us Asian Paints Ltd (ASIANPAINT:NSE) Strategic SWOT, PESTLE Analysis and Financial Insight - Assessment of Opportunities, Challenges and Risk, Corporate and ESG Strategies, Competitive Intelligence, Financial and Operational KPI's, and Recent Trends Asian Paints Limited operates as a paint manufacturing company. Asian Paints Limited operates in the decorative paints segment providing interior and exterior paints, wood finishes, waterproofing and... Get Insights Home Chemicals Asian Paints Ltd (ASIANPAINT:NSE) Strategic SWOT, PESTLE Analysis and Financial Insight - Assessment of Opportunities, Challenges and Risk, Corporate and ESG Strategies, Competitive Intelligence, Financial and Operational KPI's, and Recent Trends Summary Table of Contents FAQs Enquire / Request Samples Email this Page to a Colleague Report Spotlight Asian Paints Limited operates as a paint manufacturing company. Asian Paints Limited operates in the decorative paints segment providing interior and exterior paints, wood finishes, waterproofing and other related products and services. It also operates in the home improvement and decor segment. Asian Paints Limited offers a wide range of products and services including paints for home decoration, wood finishes, waterproofing solutions, wallpapers, adhesives, bath fittings, modular kitchens, lighting products, furniture, personalized design services, safe painting services, and color consultancy. The company provides interior and exterior wall paints, enamels, undercoats, thinners, varnishers, sanitizers, and surface disinfectants under brands like Asian Paints, Apco Coatings, Asian Paints Berger, Asian Paints Causeway, SCIB Paints, Taubmans, and Kadisco Asian Paints. Founded in 1942, the company is headquartered in Mumbai, Maharashtra, India. The report offers a comprehensive and easily accessible overview of the Asian Paints Ltd's business operations. It presents all available data in a detailed format, including SWOT and PESTLE Analysis, ESG Spotlight, Financial KPI's & Benchmarking and more. By integrating these strategic analyses, the report provides a comprehensive understanding of the Asian Paints Ltd's overall strategic standing. This comprehensive assessment supports informed decision-making, strategic planning, and the development of sustainable business strategies. Key Inclusions in the report: In-depth Asian Paints Ltd Information:- Deep dive into the internal workings of the company, this section provides unparalleled knowledge and facilitates a comprehensive understanding of the company's key attributes. Asian Paints Ltd's Strategic Standing:- The report presents a comprehensive assessment of the Asian Paints Ltd's strategic standing, incorporating key elements such as ESG (Environmental, Social, and Governance) spotlight, SWOT and PESTLE Analysis. By analysing these internal factors, the report provides insights into the company's sustainability efforts and its alignment with ethical and responsible business practices, Asian Paints Ltd's current standing and areas for strategic focus. By understanding the company's external factors, the report highlights opportunities to enhance efficiency, reduce costs, gain a competitive advantage and on the same time identify potential risks and opportunities arising from the external landscape. Asian Pa\", 'images': [{'url': 'https://quaintel.com/uploads/files1/6553781c6739c.webp', 'alt_text': 'Quaintel Research', 'confidence': 0.7}], 'rank': 5}, {'url': 'https://www.pocketful.in/blog/asian-paints-case-study-business-segments-kpis-financials-and-swot-analysis/', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://www.ijfmr.com/papers/2023/4/5866.pdf', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://www.thebusinessscroll.com/asian-paints-business-model/', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
                "annotations": null
              }
            ]
          },
          "created_files": [],
          "execution_time": 34.75414079998154,
          "error": null,
          "successful_variant": "CODE_1",
          "total_variants_tried": 1,
          "all_errors": []
        },
        "total_time": 34.7607065999764,
        "error": null
      }
    },
    {
      "id": "T002",
      "description": "Research Asian Paints' financial performance over the past 5 years, including revenue, profit, expenses, and key financial ratios.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Research and gather detailed financial data for Asian Paints for the past 5 years. This should include annual and quarterly reports, revenue, profit margins, expenses, key financial ratios (e.g., P/E ratio, EPS, ROE), and any significant financial events or announcements. Focus on extracting data suitable for creating tables and graphs.",
      "reads": [],
      "writes": [
        "T002"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    },
    {
      "id": "T003",
      "description": "Identify and research Asian Paints' main competitors in the market, analyzing their market share, products, and strategies.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Identify Asian Paints' main competitors in the market. Research their market share, product offerings, business models, and competitive strategies. Gather data that allows for a comparative analysis of Asian Paints against its competitors.",
      "reads": [],
      "writes": [
        "T003"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    },
    {
      "id": "T004",
      "description": "Analyze the gathered information to identify key insights and trends related to Asian Paints' performance and market position.",
      "agent": "ThinkerAgent",
      "agent_prompt": "Analyze the information gathered from T001, T002, and T003 to identify key insights and trends. This should include a SWOT analysis, identification of growth opportunities, assessment of financial risks, and a comparison of Asian Paints' performance against its competitors. Prepare a structured analysis suitable for inclusion in a comprehensive report.",
      "reads": [
        "T001",
        "T002",
        "T003"
      ],
      "writes": [
        "T004"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    },
    {
      "id": "T005",
      "description": "Generate a well-formatted and polished HTML report on Asian Paints, including graphs, tables, comparisons, and key insights.",
      "agent": "ReportGeneratorAgent",
      "agent_prompt": "Using the analyzed data and insights from T004, generate a comprehensive and visually appealing HTML report on Asian Paints. The report should include: \n\n- An executive summary\n- A company overview (from T001)\n- Detailed financial analysis with tables and graphs (from T002 and T004)\n- Competitive landscape analysis (from T003 and T004)\n- SWOT analysis (from T004)\n- Key insights and recommendations (from T004)\n\nThe report should be well-formatted, polished, and ready for presentation to stakeholders. Ensure the graphs and tables are clear, concise, and visually appealing.",
      "reads": [
        "T001",
        "T002",
        "T003",
        "T004"
      ],
      "writes": [
        "T005"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    }
  ],
  "links": [
    {
      "source": "ROOT",
      "target": "T001"
    },
    {
      "source": "ROOT",
      "target": "T002"
    },
    {
      "source": "ROOT",
      "target": "T003"
    },
    {
      "source": "T001",
      "target": "T004"
    },
    {
      "source": "T002",
      "target": "T004"
    },
    {
      "source": "T003",
      "target": "T004"
    },
    {
      "source": "T004",
      "target": "T005"
    }
  ]
}