{
  "directed": true,
  "multigraph": false,
  "graph": {
    "session_id": "52754576",
    "original_query": "I want to know the details of features for Mahindra XUV 3XO, use a single step for Retriever Agent but use multiple iterations in a single step to fetch detailed information (using the pattern --> find sources → extract details) and then create a report. Suggested approach is to fetch the releavnt urls first and then look for data in those URLs",
    "file_manifest": [],
    "created_at": "2025-07-17T12:16:16.086274",
    "status": "running",
    "output_chain": {
      "T001": {
        "xuv_3xo_feature_urls": [
          {
            "type": "text",
            "text": "[{'url': 'https://auto.mahindra.com/suv/xuv3xo/X3XO.html', 'content': \"Mahindra XUV 3XO - Price, Specifications, Colors & Images Skip to main content Skip to footer content SUVs THAR ROXX 12.99L - 23.39L Book Now Book Now Explore Explore XUV 3XO 7.99L - 15.79L Book Now Book Now Explore Explore SCORPIO-N 13.99L - 25.62L Book Now Book Now Explore Explore XUV700 14.49L - 25.14L Book Now Book Now Explore Explore THAR 11.50L - 17.62L Book Now Book Now Explore Explore SCORPIO CLASSIC 13.77L - 17.72L Book Now Book Now Explore Explore BOLERO NEO 9.97L - 12.18L Book Now Book Now Explore Explore BOLERO NEO PLUS 11.41L - 14.06L Explore Explore BOLERO 9.81L - 10.93L Book Now Book Now Explore Explore XUV400 17.49L Book Now Book Now Explore Explore MARAZZO 14.59L - 17.00L Book Now Book Now Explore Explore Explore All SUVs Explore All SUVs News Contact Us Menu Build your car Test Drive Buy Buy Book Now Exchange Finance Subscribe a Vehicle Owner's Zone Owner's Zone Owner's Action Owner's Action My Dashboard Service Cost Calculator Locate Service Center Renewals Renewals Roadside Assistance Owner's Manual Care & Maintenance Important Notifications Important Notifications Service Action Adventure Adventure Club Events Expeditions Off-Road Academy Gallery Locate a Dealer Global Markets Language News Contact us Switch theme Dark Light Home XUV 3XO Know More Know More Show more Show less Show more Show less Everything you want & more Book now Book now Show more Show less Register for the latest news and exclusive updates. Stay informed Stay informed For any assistance call us on 1800 209 6006 1800 209 6006 Social links SUVs SUVs Explore All SUVs Thar Roxx Scorpio-N XUV700 XUV 3XO Thar XUV 400 Scorpio Classic Bolero Neo Bolero Bolero Neo Plus Marazzo PIK-UPs PIK-UPs Veero Maxx City Maxx HD Bolero Pik-up Bolero Camper ABOUT ABOUT About us Press Releases Stories Media kit Careers QMS Certificate OWNER OWNER Service Adventure Merchandise & Gear - Eshop Parts and accessories- Eshop Care & Maintenance Owners manual QMS Certificate customer service customer service Contact us FAQs Talk to an expert Dealer Locator Corporate Sales Enquiry Sitemap Sitemap QMS Certificate quick links quick links Vehicle configurator Test Drive Book Online Calculators Exchange Finance Scrappage Subscribe a vehicle Become a Dealer Download the M4U app now! Lets connect on Whatsapp Chat now Chat now Mahindra Corporate Terms & Conditions Our Privacy Policy Copyright 2025 Mahindra & Mahindra Ltd\", 'images': [{'url': 'https://auto.mahindra.com/dw/image/v2/BKRC_PRD/on/demandware.static/-/Sites-mahindra-product-catalog/default/dw95797f68/images/SCRC/large/ScorpioClassic_602x339.png?sw=360&sh=202', 'alt_text': 'SCORPIO CLASSIC', 'class': 'd-block img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://auto.mahindra.com/dw/image/v2/BKRC_PRD/on/demandware.static/-/Sites-mahindra-product-catalog/default/dwc6625064/images/NEOP/large/BoleroNeoPlus_602x339.png?sw=360&sh=202', 'alt_text': 'BOLERO NEO PLUS', 'class': 'd-block img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://auto.mahindra.com/on/demandware.static/Sites-amc-Site/-/default/dwbe1329bd/images/placeholder-image.png', 'alt_text': 'XUO 3XO REVX', 'width': '1400px', 'height': '700px', 'class': 'ITC-image image-fluid common-image-component flexi-height', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://auto.mahindra.com/on/demandware.static/Sites-amc-Site/-/default/dwbe1329bd/images/placeholder-image.png', 'alt_text': 'XUV 3XO Earn 5-Star Bharat-NCAP Rating', 'width': '1400px', 'height': '700px', 'class': 'ITC-image image-fluid common-image-component flexi-height', 'loading': 'lazy', 'confidence': 0.7}], 'rank': 1}, {'url': 'https://www.mahindra.com/news-room/press-release/en/mahindra-launches-the-xuv-3xo-the-new-disruptor-in-compact-suvs', 'content': \"Mahindra launches the XUV 3XO the New Disruptor in compact SUVs Skip to main content Who We Are Our Purpose Drive positive change in the lives of our communities. Only when we enable others to rise will we rise. #TogetherWeRise Purpose Led Performance Driven Future Ready Leadership Our History Museum What we do Key Facts 20+ Industries 100+ Countries 324K+ Employees Industries Automotive SUVs LCVs Last Mile Mobility Iconic Motorcycles Trucks And Buses Farm Equipments Tractors Agri Services Farm Machinery Financial Services Technology Services Hospitality Logistics Real Estate Renewables Other Emerging Businesses Advanced Technologies (Defence) Aerostructures Aftermarkets (Pre-Owned Cars) Auto Components and Recycling Power Generation Retail Our Brands Global Presence Cultural Outreach Investor Relations Investor Relations Group highlights. 18% Consolidated ROE 1592 B+ Revenue 129 B+ PAT 3.31 T+ Market cap as on date Disclosures Under Regulation 46 And 62 Of SEBI (LODR) Reports Policies Regulatory Filings Sustainability newsroom Newsroom Tech Mahindra reports EBIT of 1,477 Crores, up 34% YoY; YoY margins expand by 260 bps; New deal-wins at USD 809 Mn YoY growth of 51% 17 July 2025 Technology Mahindra Launches XUV 3XO REVX Series Starting at 8.94 Lakh 8 July 2025 Auto Press Releases Media Resources In The News careers careers Committed to elevate the lives of communities, guided by our core behaviours and values. Bold. Agile. Collaborative. Find A Job SOAR - Seamless Opportunity For Amazing Returnship Leadership Programs Mahindra Leadership Program Mahindra Accelerated Leadership Track Mahindra Future Shapers Mahindra Leadership University Tech Opportunities Mahindra Digital Engine Submit Popular Keywords: Business FY 21 Brands XUV700 Global Nanhi Kali Recommended for you: Annual Report 2021 - 2022 Leadership Announcement Latest Press Release Brand Guidelines Mahindra launches the XUV 3XO the New Disruptor in compact SUVs Auto Home Newsroom Press Release Mahindra launches the XUV 3XO the New Disruptor in compact SUVs Author : mahindraadmin Category : Auto Published : 4/29/2024 Prices start at 7.49 Lakh Disrupting the category: The XUV 3XO disrupts with 6+1 key pillars: Turn on Design: Bold, athletic silhouette that commands attention Ivory colour interiors wrapped with a Soft touch leatherette dashboard and door trims SUV Command Seating: Best-in-class forward visibility of 23.7that matches with XUV 700 Command seating position with eye level at 1398 mm above the ground R17 Alloy Wheels and water wading depth of 350 mm Safe Cocoon: 35 standard safety features including 6 airbags, ESC with Hill Hold Control (HHC) & All 4 Disc Brakes and more Engineered to meet the highest B-NCAP safety rating Drive of Your Life: World-class turbocharged engines with best-in-class Torque of 230 Nm (1.2 L TDGi) and 300 Nm (1.5 L Diesel) 6-speed AISIN 3rd Gen Automatic Transmission Thrilling acceleration of 0 to 60 km/h in 4.5 s (1.2 L TGDi) and best-in-class mileage of 20.1 km/l* (1.2 L TGDi MT) Ride of Your Life: First-in-segment MTV-CL (Multi-Tuned Valve Concentric Land) technology Advanced suspension system with MacPherson Strut Fully Independent Front Suspension and a Twist Beam Semi-independent Rear Suspension Quietness of gasoline matching XUV 700 gasoline Space where it counts: Best-in-class wheelbase, occupant space, and legroom Spacious cargo area measuring 364 L**, further expanded with standard 60:40 split seats to maximise storage capacity. Sci-Fi Technology First-in-segment: SkyroofTM, Dual Zone Climate Control, 65 W USB-C charging, Electronic Parking brake with Auto Hold, 3 Smart Steering Modes, Level 2 ADAS (1R1V) 3XO is also equipped with Twin HD Screens one 26.03 cm infotainment and the other 26.03 cm full digital cluster, Harman Kardon Premium Audio with amplifier & Sub-woofer, 360-degree surround view system with blind view monitor Mumbai, April 29, 2024: Mahindra & Mahindra Ltd., India's leading SUV manufacturer, today\", 'images': [], 'rank': 2}, {'url': 'https://www.autocarindia.com/car-reviews/mahindra-xuv-3xo-review-feature-and-power-packed-compact-suv-431439', 'content': \"Mahindra XUV300, XUV 3XO review, design, interior, features, performance, first drive - Introduction | Autocar India All All Price News Reviews Features Specifications Images Videos All All Price News Reviews Features Specifications Images Videos Signup Login Find a Car Cars Compare Cars New Cars Upcoming Cars Car Price Car Loan Calculator Find a Bike Bikes Compare Bikes New New Bikes New Scooters Upcoming Upcoming Bikes Upcoming Scooters Electric Electric Bikes Electric Scooters Bike Price Bike Loan Calculator News Cars Bikes Motorsports Industry Marketplace Reviews Car First drive / Reviews Comparisons Video reviews Long-term reviews Bike First ride / Reviews Comparisons Video reviews Long-term reviews Features Features Travelogues Blogs Interviews Partner Content Galleries Videos Images Stories Advice Signup Login Home Car Reviews Mahindra XUV 3XO review - Feature and power packed compact SUV Mahindra XUV 3XO review - Feature and power packed compact SUV Out goes the Mahindra XUV300 and in comes the XUV 3XO. The new name is just the starting point of a very comprehensive upgrade. Updated on May 02, 2024 05:35:55 PM 86,985 Views Follow us on The XUV 3XO's styling is big on flash The diamond-shaped detailing on the lights and grille are a nice touch. The infotainment is now a 10.25-inch unit and works well. By Nikhil Bhatia Share - Make : Mahindra Model : XUV 3XO We Like Upmarket interior Strong engines Long equipment list We Don't Like Boot space Competent as the Mahindra XUV300 was, it never quite made it to the list of compact SUV bestsellers. Mahindra is now gunning for glory with the updated XUV300, christened the XUV 3XO. Mind you, this is no run-of-the-mill nip and tuck update. Mahindra has gone all out with a new look, redone interior, some class-first feature introductions, some class-best specifications and very enticing pricing. The aim is to take the fight to the Tata Nexon, Maruti Brezza, Kia Sonet and Hyundai Venue, and win. Mahindra XUV 3XO: design and styling Where the XUV300s styling was understated, the XUV 3XO is big on flash. Giving the 3XO its distinctive face are the large, new vertically oriented headlights outlined by C-shaped DRLs (a link to the larger XUV700). The headlights are split into two sections with a concealed projector unit up top, and an open projector fog lamp unit lower down, both set amidst a black surround. The lights flank the new grille, which is actually a gloss panel that runs much of the XUVs width. The new front bumper with its pronounced cuts and creases is very concept car-like and the newly contoured bonnet also does its bit to add volume to the design. New C-shaped LED DRLs provide a visual link with the larger XUV700. Like the XUV300, the 3XO looks muscular in profile, and furthering the impression are the stylish new 17-inch diamond cut alloy wheels that are the largest in the segment. Theres also chunkier side cladding with cuts at the wheel arches. Mahindra says ground clearance is a generous 201mm, up from the XUV300s figure of 180mm. Mahindra XUV 3XO Price, Mileage, Specifications, Features and Variants Brand Mahindra Model Name XUV 3XO Mahindra XUV 3XO Price 9.06 - 18.39 lakh Mahindra XUV 3XO Range/Mileage Petrol : 17.96 - 20.1kpl | Diesel : 20.6 - 21.2kpl Mahindra XUV 3XO Specifications SUV | 5 doors | 5 seats View All Specs Mahindra XUV 3XO Features LED headlight | 10.25-inch Touchscreen display | 6 airbags View All Features Mahindra XUV 3XO Variants MX1 1.2 Petrol MT | REVX M 1.2 Petrol MT | REVX M (O) 1.2 Petrol MT View All Variants In its basic shape though, the 3XO is no different than the XUV300. The 2,600mm wheelbase remains class best, but the short overhangs, particularly at the back, tell you that this is a vehicle that's brutally shortened (remember it started life as a SsangYong Tivoli) to get length under the critical 4m mark, needed to qualify as a small car and hence a lower rate of tax. New 17-inch alloys are the largest in the segment. At the back, y\", 'images': [{'url': 'https://img.autocarindia.com/ExtraImages/20240502111525_First Drive 3XO Web.001.jpeg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO review', 'title': 'Mahindra XUV 3XO review', 'class': 'img-fluid', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/ExtraImages/20240502012130_First Drive 3XO Web.008.jpeg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO front quarter', 'title': 'Mahindra XUV 3XO front quarter', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/ExtraImages/20240502012130_First Drive 3XO Web.014.jpeg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO review - Feature and power packed compact SUV', 'title': 'Mahindra XUV 3XO review - Feature and power packed compact SUV', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/ExtraImages/20240502012130_First Drive 3XO Web.016.jpeg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO review - Feature and power packed compact SUV', 'title': 'Mahindra XUV 3XO review - Feature and power packed compact SUV', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/model/uploads/modelimages/Mahindra-XUV-3XO-290420241902.jpg', 'alt_text': 'Latest Image of Mahindra XUV 3XO', 'title': 'Mahindra XUV 3XO', 'class': 'img-fluid wid-img', 'loading': 'lazy', 'confidence': 0.7999999999999999}], 'rank': 3}, {'url': 'https://www.team-bhp.com/forum/official-new-car-reviews/279937-2024-mahindra-xuv-3xo-review.html', 'content': \"2024 Mahindra XUV 3XO Review - Team-BHP About Us | Advertise | Contact Us Forum Hot Threads News Reviews Photos Buy Used Car Spare Parts Buy Accessories Classifieds Store Team-BHP > Team-BHP Reviews > Official New Car Reviews 2024 Mahindra XUV 3XO Review Log In Register User Name Password Register New Topics New Posts Top Thanked Team-BHP FAQ Search Search Forums Show Threads Show Posts Search Titles Only Advanced Search Go to Page... Page 1 of 101 1 2 3 4 5 6 7 8 9 10 11 51 > Last 570 Photos Search this Thread 2,367,292 views 2nd May 2024, 11:00 # 1 Omkar Team-BHP Support Join Date: Apr 2016 Location: Mumbai Posts: 3,137 Thanked: 30,300 Times 2024 Mahindra XUV 3XO Review 2024 Mahindra XUV 3XO Review Mahindra XUV 3XO Pros A truly premium crossover. Nice build, quality & refinement levels Cabin has enough space for 5. Quality-wise, the interior is more like a Hyundai Fantastic petrol & diesel engine line-up; they offer fast performance & good driveability Finally gets a smooth torque converter automatic with the turbo-petrol engines Wide variant spread ensures there's something for everyone A compliant ride with sorted road manners 5-star NCAP rating & kit. Level 2 ADAS, 6 airbags, ESP, ABS, all-wheel disc brakes, TPMS, seatbelt reminders for all & more Loaded to the gills with equipment (360-degree camera, big sunroof, drive modes, Harman Kardon audio system, wireless smartphone connectivity, auto headlamps & wipers etc.) Mahindra XUV 3XO Cons The new edgy & outlandish design may not be to everyone's liking. Some love it, some don't. It is very polarizing Top-end variants are expensive. Not overpriced, but definitely higher than expected 295-liter boot is the smallest in the segment. There are cheaper hatchbacks that have a larger boot No proper diesel automatic option, just a jerky AMT which has no place in a premium crossover Light & disconnected steering is the biggest drawback in a competent handling package Mahindra's after-sales service quality is a hit or miss. Remains a gamble Some important features missing (ventilated seats, parcel tray, full-sized spare wheel, paddle shifters etc.) This review has been jointly compiled with Axe77 . Thanks to him for the expert observations! Since the Mahindra XUV 300 has already been reviewed by Team-BHP, this report will only focus on changes made to the 2024 facelift. To read the full official review, click here . The 2021 1.2L Petrol Automatic (AMT) Link to Review Introduction It's hard to believe how big the small SUV / crossover segment has become. Almost all the manufacturers have introduced products in this lucrative segment. Mahindra is no exception. Their smallest SUV, the XUV300 was launched in India back in 2019. While it didn't make a very big impact in the market, over the years, it has seen some good sales numbers. The car has essentially remained the same since the launch, but now in 2024, Mahindra has finally decided to introduce a facelift. Since it is a major update after a long time, Mahindra has decided to rename the car as well - the XUV300 is now the XUV 3XO. So, what's new on the XUV 3XO? It gets a refreshed exterior, some changes to the interiors, quite a few feature additions and a new 6-speed Aisin-sourced automatic gearbox for its petrol engines. There's a lot to cover, so let's get right into it. Mahindra XUV 3XO Price & Brochure Back in 2019, the XUV300 was launched with a diesel and a turbo-petrol engine with manual transmissions. Now, the XUV 3XO is being offered with 3 engine options with manual and automatic options. You get a 1.5-litre, 115 BHP, diesel engine mated to a 6-speed MT with the option of an AMT. Then you have a 110 BHP, 1.2-litre turbo-petrol engine with Multipoint Fuel Injection (MPFI) mated to 6-speed MT or the new 6-speed AT. Finally, you have the 129 BHP, 1.2-litre turbo-petrol engine with Gasoline Direct injection (GDi) mated to a 6-speed MT or the 6-speed AT. Prices start at Rs. 7.49 lakh for the base MX1 variant w\", 'images': [{'url': 'https://www.team-bhp.com/forum/attachments/official-new-car-reviews/2601348d1714564249t-2024-mahindra-xuv-3xo-review-2024_mahindra_xuv3xo_exterior_01.jpg', 'alt_text': '2024 Mahindra XUV 3XO Review-2024_mahindra_xuv3xo_exterior_01.jpg', 'width': '800', 'height': '533', 'class': 'thumbnail', 'confidence': 0.9999999999999999}, {'url': 'https://www.team-bhp.com/forum/attachments/official-new-car-reviews/2601349d1714564293t-2024-mahindra-xuv-3xo-review-2024_mahindra_xuv3xo_exterior_02.jpg', 'alt_text': '2024 Mahindra XUV 3XO Review-2024_mahindra_xuv3xo_exterior_02.jpg', 'width': '800', 'height': '533', 'class': 'thumbnail', 'confidence': 0.9999999999999999}, {'url': 'https://www.team-bhp.com/forum/attachments/official-new-car-reviews/2601350d1714564293t-2024-mahindra-xuv-3xo-review-2024_mahindra_xuv3xo_exterior_03.jpg', 'alt_text': '2024 Mahindra XUV 3XO Review-2024_mahindra_xuv3xo_exterior_03.jpg', 'width': '800', 'height': '533', 'class': 'thumbnail', 'confidence': 0.9999999999999999}, {'url': 'https://www.team-bhp.com/forum/attachments/official-new-car-reviews/2601351d1714564293t-2024-mahindra-xuv-3xo-review-2024_mahindra_xuv3xo_exterior_04.jpg', 'alt_text': '2024 Mahindra XUV 3XO Review-2024_mahindra_xuv3xo_exterior_04.jpg', 'width': '800', 'height': '533', 'class': 'thumbnail', 'confidence': 0.9999999999999999}, {'url': 'https://www.team-bhp.com/forum/attachments/official-new-car-reviews/2601352d1714564293t-2024-mahindra-xuv-3xo-review-2024_mahindra_xuv3xo_exterior_05.jpg', 'alt_text': '2024 Mahindra XUV 3XO Review-2024_mahindra_xuv3xo_exterior_05.jpg', 'width': '800', 'height': '533', 'class': 'thumbnail', 'confidence': 0.9999999999999999}], 'rank': 4}, {'url': 'https://ackodrive.com/car-guide/mahindra-xuv-3xo-features-explained/', 'content': 'Mahindra XUV 3XO Features Explained: Your Complete Guide Home / Articles / Car Guide / Mahindra XUV 3XO Features Explained: A Comprehensive Guide. Mahindra XUV 3XO Features Explained: A Comprehensive Guide. Published on 27 Aug, 2024, 9:41 AM IST Updated on 28 Aug, 2024, 5:59 AM IST Team Ackodrive 8 min read Interesting Articles Follow us on Share Post Mahindra recently launched the much-awaited Mahindra XUV 3XO as a compact SUV in the Indian automotive industry. Outperforming its rivals, the Tata Nexon, Hyundai Venue and Maruti Suzuki Brezza, the Mahindra XUV 3XO brings a fresh look to the segment. With the latest updates and comfortable features, the Mahindra XUV 3XO is on the list of must-buy compact SUVs in India. Here, we will take a closer look at the Mahindra XUV 3XO features explained and help you choose the ideal car. Contents Price of Mahindra XUV 3XO Variants After the Mahindra XUV 3XO features are explained, you must know the price of each variant. Hence, we have prepared a table for you highlighting the ex-showroom price of each XUV 3XO variant: Mahindra XUV 3XO Variant Ex-Showroom Price MX1 Rs. 7.49 Lakhs MX2 Rs. 9.99 Lakhs MX2 PRO Rs. 8.99 Lakhs to Rs. 10.39 Lakhs MX3 Rs. 9.49 Lakhs to Rs. 11.68 Lakhs MX3 PRO Rs. 9.99 Lakhs to Rs. 11.49 Lakhs AX5 Rs. 10.69 Lakhs to Rs. 12.88 Lakhs AX5 Luxury Rs. 11.99 Lakhs to Rs. 13.49 Lakhs AX7 Rs. 12.49 Lakhs to Rs. 14.49 Lakhs AX7 Luxury Rs. 13.99 Lakhs to Rs. 15.49 Lakhs Note : The prices of the Mahindra XUV 3XO variants can change without any prior notice. So, before booking your car, talk with your nearest dealer to know the latest price. Check out: Mahindra XUV 3XO Variants Unlatch Elated Driving Experience with the All New Mahindra XUV 3XO Making its presence felt in the Indian compact SUV market, the Mahindra XUV 3XO is one of the best cars in this segment manufactured by Mahindra. It offers more convenience and comfort when driving on different terrains. The following are detailed discussions of the Mahindra XUV 3XO tech specs and features: 1. Influencing Exterior Look The Mahindra XUV 3XO has a specific design to turn heads with its athletic stance. It commands respect and exudes the confidence of a true SUV. The all-new Mahindra XUV 3XO has an ample ground clearance of 201 mm, making it easy for you to drive on rocky terrains. In addition, the XUV 3XO comes with a command seating position to offer an exhilarating driving experience. The Mahindra XUV 3XO has LED DRLs and headlamps that will lead the road to envy you whenever you turn them on. Furthermore, the infinity tail lamps add an X factor to your style quotient. The car also features 17-inch diamond-cut alloy wheels for that sporty look. Check out: Mahindra XUV 3XO Dimensions 2. Comforting Interior When you drive the Mahindra XUV 3XO, it elevates your every journey. Stepping inside the XUV 3XOs cabin will let you discover a sanctuary of sophistication and comfort. It is one of the key parts of the Mahindra XUV 3XO features explained, as it has a meticulous design for the finest SUV lovers. The Mahindra XUV 3XO features a Skyroof and soft-touch leatherette on the door trims and dashboard. Furthermore, the car has premium leatherette seats, a cooled glovebox with illumination, and a passive keyless entry. It also features a front armrest with storage and a console with a cup holder for a comfortable drive. Check out: Mahindra XUV 3XO Interior 3. Smart Connectivity Another key Mahindra XUV 3XO configuration is its smart connectivity and technology. The car comes with a Harman Kardon 7-speaker audio system to make your drive enjoyable. In addition, the sound system lets you experience sonic expanse, and the bass enhancer technology uplifts your mood while driving in crowded areas. The Mahindra XUV 3XO features a high-definition touchscreen system for infotainment and navigation and has built-in Amazon Alexa for entertainment. Moreover, with the ADRENOX Connect technology, you can control your cars features through y', 'images': [{'url': 'https://acko-cms.ackoassets.com/image_21_09398560b1.webp', 'alt_text': 'image_21_09398560b1.webp', 'loading': 'lazy', 'confidence': 0.7}, {'url': 'https://acko-cms.ackoassets.com/Mahindra_XUV_3_XO_1_50764da01b.png', 'alt_text': 'Mahindra', 'width': '740', 'height': '400', 'loading': 'lazy', 'confidence': 0.7}], 'rank': 5}, {'url': 'https://whatinsider.com/mahindra-xuv-3xo/', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://www.carbikereview.com/cars/everything-you-want-to-know-about-mahindra-xuv-3xo/', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://auto.mahindra.com/own-online/variant-selection?pid=X3XO', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null,
            "_meta": null
          }
        ]
      }
    },
    "validation_results": {
      "is_valid": true,
      "is_dag": true,
      "cycles": [],
      "disconnected_components": [],
      "orphaned_nodes": [],
      "root_nodes": [],
      "leaf_nodes": [
        "T003"
      ],
      "warnings": [],
      "errors": []
    }
  },
  "nodes": [
    {
      "description": "Initial Query",
      "agent": "System",
      "status": "completed",
      "id": "ROOT"
    },
    {
      "id": "T001",
      "description": "Find relevant URLs for Mahindra XUV 3XO features",
      "agent": "RetrieverAgent",
      "agent_prompt": "Find at least 5 URLs that contain detailed information about the features of the Mahindra XUV 3XO. Ensure these URLs are from reliable and reputable sources such as official Mahindra websites, well-known automotive news sites, and detailed review publications.",
      "reads": [],
      "writes": [
        "T001"
      ],
      "status": "completed",
      "output": {
        "xuv_3xo_feature_urls": [
          {
            "type": "text",
            "text": "[{'url': 'https://auto.mahindra.com/suv/xuv3xo/X3XO.html', 'content': \"Mahindra XUV 3XO - Price, Specifications, Colors & Images Skip to main content Skip to footer content SUVs THAR ROXX 12.99L - 23.39L Book Now Book Now Explore Explore XUV 3XO 7.99L - 15.79L Book Now Book Now Explore Explore SCORPIO-N 13.99L - 25.62L Book Now Book Now Explore Explore XUV700 14.49L - 25.14L Book Now Book Now Explore Explore THAR 11.50L - 17.62L Book Now Book Now Explore Explore SCORPIO CLASSIC 13.77L - 17.72L Book Now Book Now Explore Explore BOLERO NEO 9.97L - 12.18L Book Now Book Now Explore Explore BOLERO NEO PLUS 11.41L - 14.06L Explore Explore BOLERO 9.81L - 10.93L Book Now Book Now Explore Explore XUV400 17.49L Book Now Book Now Explore Explore MARAZZO 14.59L - 17.00L Book Now Book Now Explore Explore Explore All SUVs Explore All SUVs News Contact Us Menu Build your car Test Drive Buy Buy Book Now Exchange Finance Subscribe a Vehicle Owner's Zone Owner's Zone Owner's Action Owner's Action My Dashboard Service Cost Calculator Locate Service Center Renewals Renewals Roadside Assistance Owner's Manual Care & Maintenance Important Notifications Important Notifications Service Action Adventure Adventure Club Events Expeditions Off-Road Academy Gallery Locate a Dealer Global Markets Language News Contact us Switch theme Dark Light Home XUV 3XO Know More Know More Show more Show less Show more Show less Everything you want & more Book now Book now Show more Show less Register for the latest news and exclusive updates. Stay informed Stay informed For any assistance call us on 1800 209 6006 1800 209 6006 Social links SUVs SUVs Explore All SUVs Thar Roxx Scorpio-N XUV700 XUV 3XO Thar XUV 400 Scorpio Classic Bolero Neo Bolero Bolero Neo Plus Marazzo PIK-UPs PIK-UPs Veero Maxx City Maxx HD Bolero Pik-up Bolero Camper ABOUT ABOUT About us Press Releases Stories Media kit Careers QMS Certificate OWNER OWNER Service Adventure Merchandise & Gear - Eshop Parts and accessories- Eshop Care & Maintenance Owners manual QMS Certificate customer service customer service Contact us FAQs Talk to an expert Dealer Locator Corporate Sales Enquiry Sitemap Sitemap QMS Certificate quick links quick links Vehicle configurator Test Drive Book Online Calculators Exchange Finance Scrappage Subscribe a vehicle Become a Dealer Download the M4U app now! Lets connect on Whatsapp Chat now Chat now Mahindra Corporate Terms & Conditions Our Privacy Policy Copyright 2025 Mahindra & Mahindra Ltd\", 'images': [{'url': 'https://auto.mahindra.com/dw/image/v2/BKRC_PRD/on/demandware.static/-/Sites-mahindra-product-catalog/default/dw95797f68/images/SCRC/large/ScorpioClassic_602x339.png?sw=360&sh=202', 'alt_text': 'SCORPIO CLASSIC', 'class': 'd-block img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://auto.mahindra.com/dw/image/v2/BKRC_PRD/on/demandware.static/-/Sites-mahindra-product-catalog/default/dwc6625064/images/NEOP/large/BoleroNeoPlus_602x339.png?sw=360&sh=202', 'alt_text': 'BOLERO NEO PLUS', 'class': 'd-block img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://auto.mahindra.com/on/demandware.static/Sites-amc-Site/-/default/dwbe1329bd/images/placeholder-image.png', 'alt_text': 'XUO 3XO REVX', 'width': '1400px', 'height': '700px', 'class': 'ITC-image image-fluid common-image-component flexi-height', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://auto.mahindra.com/on/demandware.static/Sites-amc-Site/-/default/dwbe1329bd/images/placeholder-image.png', 'alt_text': 'XUV 3XO Earn 5-Star Bharat-NCAP Rating', 'width': '1400px', 'height': '700px', 'class': 'ITC-image image-fluid common-image-component flexi-height', 'loading': 'lazy', 'confidence': 0.7}], 'rank': 1}, {'url': 'https://www.mahindra.com/news-room/press-release/en/mahindra-launches-the-xuv-3xo-the-new-disruptor-in-compact-suvs', 'content': \"Mahindra launches the XUV 3XO the New Disruptor in compact SUVs Skip to main content Who We Are Our Purpose Drive positive change in the lives of our communities. Only when we enable others to rise will we rise. #TogetherWeRise Purpose Led Performance Driven Future Ready Leadership Our History Museum What we do Key Facts 20+ Industries 100+ Countries 324K+ Employees Industries Automotive SUVs LCVs Last Mile Mobility Iconic Motorcycles Trucks And Buses Farm Equipments Tractors Agri Services Farm Machinery Financial Services Technology Services Hospitality Logistics Real Estate Renewables Other Emerging Businesses Advanced Technologies (Defence) Aerostructures Aftermarkets (Pre-Owned Cars) Auto Components and Recycling Power Generation Retail Our Brands Global Presence Cultural Outreach Investor Relations Investor Relations Group highlights. 18% Consolidated ROE 1592 B+ Revenue 129 B+ PAT 3.31 T+ Market cap as on date Disclosures Under Regulation 46 And 62 Of SEBI (LODR) Reports Policies Regulatory Filings Sustainability newsroom Newsroom Tech Mahindra reports EBIT of 1,477 Crores, up 34% YoY; YoY margins expand by 260 bps; New deal-wins at USD 809 Mn YoY growth of 51% 17 July 2025 Technology Mahindra Launches XUV 3XO REVX Series Starting at 8.94 Lakh 8 July 2025 Auto Press Releases Media Resources In The News careers careers Committed to elevate the lives of communities, guided by our core behaviours and values. Bold. Agile. Collaborative. Find A Job SOAR - Seamless Opportunity For Amazing Returnship Leadership Programs Mahindra Leadership Program Mahindra Accelerated Leadership Track Mahindra Future Shapers Mahindra Leadership University Tech Opportunities Mahindra Digital Engine Submit Popular Keywords: Business FY 21 Brands XUV700 Global Nanhi Kali Recommended for you: Annual Report 2021 - 2022 Leadership Announcement Latest Press Release Brand Guidelines Mahindra launches the XUV 3XO the New Disruptor in compact SUVs Auto Home Newsroom Press Release Mahindra launches the XUV 3XO the New Disruptor in compact SUVs Author : mahindraadmin Category : Auto Published : 4/29/2024 Prices start at 7.49 Lakh Disrupting the category: The XUV 3XO disrupts with 6+1 key pillars: Turn on Design: Bold, athletic silhouette that commands attention Ivory colour interiors wrapped with a Soft touch leatherette dashboard and door trims SUV Command Seating: Best-in-class forward visibility of 23.7that matches with XUV 700 Command seating position with eye level at 1398 mm above the ground R17 Alloy Wheels and water wading depth of 350 mm Safe Cocoon: 35 standard safety features including 6 airbags, ESC with Hill Hold Control (HHC) & All 4 Disc Brakes and more Engineered to meet the highest B-NCAP safety rating Drive of Your Life: World-class turbocharged engines with best-in-class Torque of 230 Nm (1.2 L TDGi) and 300 Nm (1.5 L Diesel) 6-speed AISIN 3rd Gen Automatic Transmission Thrilling acceleration of 0 to 60 km/h in 4.5 s (1.2 L TGDi) and best-in-class mileage of 20.1 km/l* (1.2 L TGDi MT) Ride of Your Life: First-in-segment MTV-CL (Multi-Tuned Valve Concentric Land) technology Advanced suspension system with MacPherson Strut Fully Independent Front Suspension and a Twist Beam Semi-independent Rear Suspension Quietness of gasoline matching XUV 700 gasoline Space where it counts: Best-in-class wheelbase, occupant space, and legroom Spacious cargo area measuring 364 L**, further expanded with standard 60:40 split seats to maximise storage capacity. Sci-Fi Technology First-in-segment: SkyroofTM, Dual Zone Climate Control, 65 W USB-C charging, Electronic Parking brake with Auto Hold, 3 Smart Steering Modes, Level 2 ADAS (1R1V) 3XO is also equipped with Twin HD Screens one 26.03 cm infotainment and the other 26.03 cm full digital cluster, Harman Kardon Premium Audio with amplifier & Sub-woofer, 360-degree surround view system with blind view monitor Mumbai, April 29, 2024: Mahindra & Mahindra Ltd., India's leading SUV manufacturer, today\", 'images': [], 'rank': 2}, {'url': 'https://www.autocarindia.com/car-reviews/mahindra-xuv-3xo-review-feature-and-power-packed-compact-suv-431439', 'content': \"Mahindra XUV300, XUV 3XO review, design, interior, features, performance, first drive - Introduction | Autocar India All All Price News Reviews Features Specifications Images Videos All All Price News Reviews Features Specifications Images Videos Signup Login Find a Car Cars Compare Cars New Cars Upcoming Cars Car Price Car Loan Calculator Find a Bike Bikes Compare Bikes New New Bikes New Scooters Upcoming Upcoming Bikes Upcoming Scooters Electric Electric Bikes Electric Scooters Bike Price Bike Loan Calculator News Cars Bikes Motorsports Industry Marketplace Reviews Car First drive / Reviews Comparisons Video reviews Long-term reviews Bike First ride / Reviews Comparisons Video reviews Long-term reviews Features Features Travelogues Blogs Interviews Partner Content Galleries Videos Images Stories Advice Signup Login Home Car Reviews Mahindra XUV 3XO review - Feature and power packed compact SUV Mahindra XUV 3XO review - Feature and power packed compact SUV Out goes the Mahindra XUV300 and in comes the XUV 3XO. The new name is just the starting point of a very comprehensive upgrade. Updated on May 02, 2024 05:35:55 PM 86,985 Views Follow us on The XUV 3XO's styling is big on flash The diamond-shaped detailing on the lights and grille are a nice touch. The infotainment is now a 10.25-inch unit and works well. By Nikhil Bhatia Share - Make : Mahindra Model : XUV 3XO We Like Upmarket interior Strong engines Long equipment list We Don't Like Boot space Competent as the Mahindra XUV300 was, it never quite made it to the list of compact SUV bestsellers. Mahindra is now gunning for glory with the updated XUV300, christened the XUV 3XO. Mind you, this is no run-of-the-mill nip and tuck update. Mahindra has gone all out with a new look, redone interior, some class-first feature introductions, some class-best specifications and very enticing pricing. The aim is to take the fight to the Tata Nexon, Maruti Brezza, Kia Sonet and Hyundai Venue, and win. Mahindra XUV 3XO: design and styling Where the XUV300s styling was understated, the XUV 3XO is big on flash. Giving the 3XO its distinctive face are the large, new vertically oriented headlights outlined by C-shaped DRLs (a link to the larger XUV700). The headlights are split into two sections with a concealed projector unit up top, and an open projector fog lamp unit lower down, both set amidst a black surround. The lights flank the new grille, which is actually a gloss panel that runs much of the XUVs width. The new front bumper with its pronounced cuts and creases is very concept car-like and the newly contoured bonnet also does its bit to add volume to the design. New C-shaped LED DRLs provide a visual link with the larger XUV700. Like the XUV300, the 3XO looks muscular in profile, and furthering the impression are the stylish new 17-inch diamond cut alloy wheels that are the largest in the segment. Theres also chunkier side cladding with cuts at the wheel arches. Mahindra says ground clearance is a generous 201mm, up from the XUV300s figure of 180mm. Mahindra XUV 3XO Price, Mileage, Specifications, Features and Variants Brand Mahindra Model Name XUV 3XO Mahindra XUV 3XO Price 9.06 - 18.39 lakh Mahindra XUV 3XO Range/Mileage Petrol : 17.96 - 20.1kpl | Diesel : 20.6 - 21.2kpl Mahindra XUV 3XO Specifications SUV | 5 doors | 5 seats View All Specs Mahindra XUV 3XO Features LED headlight | 10.25-inch Touchscreen display | 6 airbags View All Features Mahindra XUV 3XO Variants MX1 1.2 Petrol MT | REVX M 1.2 Petrol MT | REVX M (O) 1.2 Petrol MT View All Variants In its basic shape though, the 3XO is no different than the XUV300. The 2,600mm wheelbase remains class best, but the short overhangs, particularly at the back, tell you that this is a vehicle that's brutally shortened (remember it started life as a SsangYong Tivoli) to get length under the critical 4m mark, needed to qualify as a small car and hence a lower rate of tax. New 17-inch alloys are the largest in the segment. At the back, y\", 'images': [{'url': 'https://img.autocarindia.com/ExtraImages/20240502111525_First Drive 3XO Web.001.jpeg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO review', 'title': 'Mahindra XUV 3XO review', 'class': 'img-fluid', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/ExtraImages/20240502012130_First Drive 3XO Web.008.jpeg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO front quarter', 'title': 'Mahindra XUV 3XO front quarter', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/ExtraImages/20240502012130_First Drive 3XO Web.014.jpeg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO review - Feature and power packed compact SUV', 'title': 'Mahindra XUV 3XO review - Feature and power packed compact SUV', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/ExtraImages/20240502012130_First Drive 3XO Web.016.jpeg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO review - Feature and power packed compact SUV', 'title': 'Mahindra XUV 3XO review - Feature and power packed compact SUV', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/model/uploads/modelimages/Mahindra-XUV-3XO-290420241902.jpg', 'alt_text': 'Latest Image of Mahindra XUV 3XO', 'title': 'Mahindra XUV 3XO', 'class': 'img-fluid wid-img', 'loading': 'lazy', 'confidence': 0.7999999999999999}], 'rank': 3}, {'url': 'https://www.team-bhp.com/forum/official-new-car-reviews/279937-2024-mahindra-xuv-3xo-review.html', 'content': \"2024 Mahindra XUV 3XO Review - Team-BHP About Us | Advertise | Contact Us Forum Hot Threads News Reviews Photos Buy Used Car Spare Parts Buy Accessories Classifieds Store Team-BHP > Team-BHP Reviews > Official New Car Reviews 2024 Mahindra XUV 3XO Review Log In Register User Name Password Register New Topics New Posts Top Thanked Team-BHP FAQ Search Search Forums Show Threads Show Posts Search Titles Only Advanced Search Go to Page... Page 1 of 101 1 2 3 4 5 6 7 8 9 10 11 51 > Last 570 Photos Search this Thread 2,367,292 views 2nd May 2024, 11:00 # 1 Omkar Team-BHP Support Join Date: Apr 2016 Location: Mumbai Posts: 3,137 Thanked: 30,300 Times 2024 Mahindra XUV 3XO Review 2024 Mahindra XUV 3XO Review Mahindra XUV 3XO Pros A truly premium crossover. Nice build, quality & refinement levels Cabin has enough space for 5. Quality-wise, the interior is more like a Hyundai Fantastic petrol & diesel engine line-up; they offer fast performance & good driveability Finally gets a smooth torque converter automatic with the turbo-petrol engines Wide variant spread ensures there's something for everyone A compliant ride with sorted road manners 5-star NCAP rating & kit. Level 2 ADAS, 6 airbags, ESP, ABS, all-wheel disc brakes, TPMS, seatbelt reminders for all & more Loaded to the gills with equipment (360-degree camera, big sunroof, drive modes, Harman Kardon audio system, wireless smartphone connectivity, auto headlamps & wipers etc.) Mahindra XUV 3XO Cons The new edgy & outlandish design may not be to everyone's liking. Some love it, some don't. It is very polarizing Top-end variants are expensive. Not overpriced, but definitely higher than expected 295-liter boot is the smallest in the segment. There are cheaper hatchbacks that have a larger boot No proper diesel automatic option, just a jerky AMT which has no place in a premium crossover Light & disconnected steering is the biggest drawback in a competent handling package Mahindra's after-sales service quality is a hit or miss. Remains a gamble Some important features missing (ventilated seats, parcel tray, full-sized spare wheel, paddle shifters etc.) This review has been jointly compiled with Axe77 . Thanks to him for the expert observations! Since the Mahindra XUV 300 has already been reviewed by Team-BHP, this report will only focus on changes made to the 2024 facelift. To read the full official review, click here . The 2021 1.2L Petrol Automatic (AMT) Link to Review Introduction It's hard to believe how big the small SUV / crossover segment has become. Almost all the manufacturers have introduced products in this lucrative segment. Mahindra is no exception. Their smallest SUV, the XUV300 was launched in India back in 2019. While it didn't make a very big impact in the market, over the years, it has seen some good sales numbers. The car has essentially remained the same since the launch, but now in 2024, Mahindra has finally decided to introduce a facelift. Since it is a major update after a long time, Mahindra has decided to rename the car as well - the XUV300 is now the XUV 3XO. So, what's new on the XUV 3XO? It gets a refreshed exterior, some changes to the interiors, quite a few feature additions and a new 6-speed Aisin-sourced automatic gearbox for its petrol engines. There's a lot to cover, so let's get right into it. Mahindra XUV 3XO Price & Brochure Back in 2019, the XUV300 was launched with a diesel and a turbo-petrol engine with manual transmissions. Now, the XUV 3XO is being offered with 3 engine options with manual and automatic options. You get a 1.5-litre, 115 BHP, diesel engine mated to a 6-speed MT with the option of an AMT. Then you have a 110 BHP, 1.2-litre turbo-petrol engine with Multipoint Fuel Injection (MPFI) mated to 6-speed MT or the new 6-speed AT. Finally, you have the 129 BHP, 1.2-litre turbo-petrol engine with Gasoline Direct injection (GDi) mated to a 6-speed MT or the 6-speed AT. Prices start at Rs. 7.49 lakh for the base MX1 variant w\", 'images': [{'url': 'https://www.team-bhp.com/forum/attachments/official-new-car-reviews/2601348d1714564249t-2024-mahindra-xuv-3xo-review-2024_mahindra_xuv3xo_exterior_01.jpg', 'alt_text': '2024 Mahindra XUV 3XO Review-2024_mahindra_xuv3xo_exterior_01.jpg', 'width': '800', 'height': '533', 'class': 'thumbnail', 'confidence': 0.9999999999999999}, {'url': 'https://www.team-bhp.com/forum/attachments/official-new-car-reviews/2601349d1714564293t-2024-mahindra-xuv-3xo-review-2024_mahindra_xuv3xo_exterior_02.jpg', 'alt_text': '2024 Mahindra XUV 3XO Review-2024_mahindra_xuv3xo_exterior_02.jpg', 'width': '800', 'height': '533', 'class': 'thumbnail', 'confidence': 0.9999999999999999}, {'url': 'https://www.team-bhp.com/forum/attachments/official-new-car-reviews/2601350d1714564293t-2024-mahindra-xuv-3xo-review-2024_mahindra_xuv3xo_exterior_03.jpg', 'alt_text': '2024 Mahindra XUV 3XO Review-2024_mahindra_xuv3xo_exterior_03.jpg', 'width': '800', 'height': '533', 'class': 'thumbnail', 'confidence': 0.9999999999999999}, {'url': 'https://www.team-bhp.com/forum/attachments/official-new-car-reviews/2601351d1714564293t-2024-mahindra-xuv-3xo-review-2024_mahindra_xuv3xo_exterior_04.jpg', 'alt_text': '2024 Mahindra XUV 3XO Review-2024_mahindra_xuv3xo_exterior_04.jpg', 'width': '800', 'height': '533', 'class': 'thumbnail', 'confidence': 0.9999999999999999}, {'url': 'https://www.team-bhp.com/forum/attachments/official-new-car-reviews/2601352d1714564293t-2024-mahindra-xuv-3xo-review-2024_mahindra_xuv3xo_exterior_05.jpg', 'alt_text': '2024 Mahindra XUV 3XO Review-2024_mahindra_xuv3xo_exterior_05.jpg', 'width': '800', 'height': '533', 'class': 'thumbnail', 'confidence': 0.9999999999999999}], 'rank': 4}, {'url': 'https://ackodrive.com/car-guide/mahindra-xuv-3xo-features-explained/', 'content': 'Mahindra XUV 3XO Features Explained: Your Complete Guide Home / Articles / Car Guide / Mahindra XUV 3XO Features Explained: A Comprehensive Guide. Mahindra XUV 3XO Features Explained: A Comprehensive Guide. Published on 27 Aug, 2024, 9:41 AM IST Updated on 28 Aug, 2024, 5:59 AM IST Team Ackodrive 8 min read Interesting Articles Follow us on Share Post Mahindra recently launched the much-awaited Mahindra XUV 3XO as a compact SUV in the Indian automotive industry. Outperforming its rivals, the Tata Nexon, Hyundai Venue and Maruti Suzuki Brezza, the Mahindra XUV 3XO brings a fresh look to the segment. With the latest updates and comfortable features, the Mahindra XUV 3XO is on the list of must-buy compact SUVs in India. Here, we will take a closer look at the Mahindra XUV 3XO features explained and help you choose the ideal car. Contents Price of Mahindra XUV 3XO Variants After the Mahindra XUV 3XO features are explained, you must know the price of each variant. Hence, we have prepared a table for you highlighting the ex-showroom price of each XUV 3XO variant: Mahindra XUV 3XO Variant Ex-Showroom Price MX1 Rs. 7.49 Lakhs MX2 Rs. 9.99 Lakhs MX2 PRO Rs. 8.99 Lakhs to Rs. 10.39 Lakhs MX3 Rs. 9.49 Lakhs to Rs. 11.68 Lakhs MX3 PRO Rs. 9.99 Lakhs to Rs. 11.49 Lakhs AX5 Rs. 10.69 Lakhs to Rs. 12.88 Lakhs AX5 Luxury Rs. 11.99 Lakhs to Rs. 13.49 Lakhs AX7 Rs. 12.49 Lakhs to Rs. 14.49 Lakhs AX7 Luxury Rs. 13.99 Lakhs to Rs. 15.49 Lakhs Note : The prices of the Mahindra XUV 3XO variants can change without any prior notice. So, before booking your car, talk with your nearest dealer to know the latest price. Check out: Mahindra XUV 3XO Variants Unlatch Elated Driving Experience with the All New Mahindra XUV 3XO Making its presence felt in the Indian compact SUV market, the Mahindra XUV 3XO is one of the best cars in this segment manufactured by Mahindra. It offers more convenience and comfort when driving on different terrains. The following are detailed discussions of the Mahindra XUV 3XO tech specs and features: 1. Influencing Exterior Look The Mahindra XUV 3XO has a specific design to turn heads with its athletic stance. It commands respect and exudes the confidence of a true SUV. The all-new Mahindra XUV 3XO has an ample ground clearance of 201 mm, making it easy for you to drive on rocky terrains. In addition, the XUV 3XO comes with a command seating position to offer an exhilarating driving experience. The Mahindra XUV 3XO has LED DRLs and headlamps that will lead the road to envy you whenever you turn them on. Furthermore, the infinity tail lamps add an X factor to your style quotient. The car also features 17-inch diamond-cut alloy wheels for that sporty look. Check out: Mahindra XUV 3XO Dimensions 2. Comforting Interior When you drive the Mahindra XUV 3XO, it elevates your every journey. Stepping inside the XUV 3XOs cabin will let you discover a sanctuary of sophistication and comfort. It is one of the key parts of the Mahindra XUV 3XO features explained, as it has a meticulous design for the finest SUV lovers. The Mahindra XUV 3XO features a Skyroof and soft-touch leatherette on the door trims and dashboard. Furthermore, the car has premium leatherette seats, a cooled glovebox with illumination, and a passive keyless entry. It also features a front armrest with storage and a console with a cup holder for a comfortable drive. Check out: Mahindra XUV 3XO Interior 3. Smart Connectivity Another key Mahindra XUV 3XO configuration is its smart connectivity and technology. The car comes with a Harman Kardon 7-speaker audio system to make your drive enjoyable. In addition, the sound system lets you experience sonic expanse, and the bass enhancer technology uplifts your mood while driving in crowded areas. The Mahindra XUV 3XO features a high-definition touchscreen system for infotainment and navigation and has built-in Amazon Alexa for entertainment. Moreover, with the ADRENOX Connect technology, you can control your cars features through y', 'images': [{'url': 'https://acko-cms.ackoassets.com/image_21_09398560b1.webp', 'alt_text': 'image_21_09398560b1.webp', 'loading': 'lazy', 'confidence': 0.7}, {'url': 'https://acko-cms.ackoassets.com/Mahindra_XUV_3_XO_1_50764da01b.png', 'alt_text': 'Mahindra', 'width': '740', 'height': '400', 'loading': 'lazy', 'confidence': 0.7}], 'rank': 5}, {'url': 'https://whatinsider.com/mahindra-xuv-3xo/', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://www.carbikereview.com/cars/everything-you-want-to-know-about-mahindra-xuv-3xo/', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://auto.mahindra.com/own-online/variant-selection?pid=X3XO', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null,
            "_meta": null
          }
        ]
      },
      "error": null,
      "cost": 0.0,
      "start_time": "2025-07-17T12:16:16.096270",
      "end_time": "2025-07-17T12:16:49.892481",
      "execution_time": 33.796211,
      "input_tokens": 0,
      "output_tokens": 0,
      "execution_result": null
    },
    {
      "id": "T002",
      "description": "Extract detailed features of Mahindra XUV 3XO from the URLs found in T001",
      "agent": "RetrieverAgent",
      "agent_prompt": "Extract all available details on the features of the Mahindra XUV 3XO from the following URLs. Focus on key aspects like engine specifications, safety features, infotainment system, dimensions, available colors, and any unique selling points. Ensure to capture precise data and specifications. The URLs are: {{T001.output}}",
      "reads": [
        "T001"
      ],
      "writes": [
        "T002"
      ],
      "status": "running",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": "2025-07-17T12:16:49.898471",
      "end_time": null,
      "execution_time": 0.0
    },
    {
      "id": "T003",
      "description": "Create a detailed report of the Mahindra XUV 3XO features",
      "agent": "FormatterAgent",
      "agent_prompt": "Create a comprehensive and visually appealing report detailing the features of the Mahindra XUV 3XO. Use the information extracted in the previous steps. Include sections for engine specifications, safety features, infotainment system, dimensions, available colors, and any unique selling points. Format the report to be easily readable and well-organized, suitable for presentation to a client. Use HTML format.",
      "reads": [
        "T002"
      ],
      "writes": [
        "T003"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    }
  ],
  "links": [
    {
      "source": "ROOT",
      "target": "T001"
    },
    {
      "source": "T001",
      "target": "T002"
    },
    {
      "source": "T002",
      "target": "T003"
    }
  ]
}