{
  "directed": true,
  "multigraph": false,
  "graph": {
    "session_id": "52765195",
    "original_query": "I want to buy a Mahindra Car, help me understand what are the recent launches, recommend a latest vehichle. I want to know the details on the features for your recommended vehicle",
    "file_manifest": [],
    "created_at": "2025-07-17T15:13:15.460969",
    "status": "running",
    "output_chain": {
      "T001": {
        "data": [
          {
            "type": "text",
            "text": "[{'url': 'https://www.indiacarnews.com/news/upcoming-mahindra-cars-20433/', 'content': 'New Upcoming Mahindra Cars In India In 2023, 2024 & 2025 News Reviews Comparisons Two Wheelers Web Stories About Us Contact Us Search India Car News Know everything about new and upcoming cars and bikes in India Facebook Twitter Thursday, July 17, 2025 Facebook Twitter Youtube India Car News Know everything about new and upcoming cars and bikes in India News Reviews Comparisons Two Wheelers Web Stories About Us Contact Us Search April 18, 2023 Upcoming Mahindra Cars in India in the Next Two Years Facebook Twitter Pinterest WhatsApp Famous for its utility and sports utility vehicles, the homegrown auto major, Mahindra ruled the segment for long. However, it is facing tough competition from the likes of Maruti Suzuki, Hyundai and Tata Motors in the UV space. Determined to regain lost ground in the segment, Mahindra had introduced multiple new SUVs including the new Thar, XUV700 and the Scorpio-N. In order to further strengthen its position in the UV segment, Mahindra plans to launch a range of new SUVs in the next 2-3 years. Heres a look at all upcoming Mahindra cars in India in 2023, 2024 and 2025. ads Upcoming Mahindra Cars in 2023, 2024, 2025 1. Mahindra Bolero Neo Plus Mahindra is all set to introduce the extended version of the Bolero Neo in the country. Called the Bolero Neo Plus, the SUV is likely to be offered with two seating configurations 7 and 9-seats. It will also be offered with an ambulance variant with 4-seats layout and a patient bed. In terms of proportions, the SUV is 4400mm long, 1795mm wide and 1812mm tall, and has a wheelbase of 2680mm. The new model looks largely identical to the Bolero Neo; however, it received some changes to keep things fresh. Instead of a blacked-out C-pillar, it has body-coloured pillars. It gets new rear bumper and smaller reflector panels, a tailgate-mounted spare tyre with badging and extended rear door. The SUV will be powered by a 2.2L mHawk diesel engine with a 6-speed manual gearbox. This powertrain produces 130PS and 300Nm of torque. 2. 5-door Mahindra Thar The next model in our list of upcoming Mahindra cars is the 5-door or long wheelbase version of the Mahindra Thar. It is expected to be launched by the end of 2023 or early 2024. The 5-door Mahindra Thar will have 300mm longer wheelbase than its 3-door model. It is expected to be based on the new Scorpio-Ns ladder-frame chassis with increased width between the wheelbase for bettery wheelbase-to-track ratio. The SUV will have an extra door for the middle row passengers. The cabin layout will be similar to the existing model and will have a three seat bench layout in the middle row and provide bigger boot space. The SUV is expected to share its powertrains with the Scorpio N. It will be offered with a 200bhp, 2.0L turbo petrol and a 172bhp, 2.2L turbo diesel engine. It can be had with either a manual or an automatic gearbox. 3. New-gen Mahindra Bolero Mahindra will launch the next gen Bolero in our market in 2024. The SUV enjoys huge popularity among buyers in rural and semi-urban markets. It is reportedly to be based on the new ladder-frame chassis that underpins the Thar and the Scorpio-N. The new model is likely to retain the original look; however, it will come with several new design elements and body panels. The cabin will receive maximum changes with better fit & finish levels and material quality. It could also get some modern day features like a touchscreen infotainment system, a multi-functional steering wheel, height adjustable drivers seat and automatic AC. The SUV is likely to feature a 2.2L mHawk diesel and a 2.0L turbo petrol engine along with manual and automatic gearbox options. 4. New Mahindra XUV500 Mahindra had replaced the XUV500 SUV with an all-new XUV700 that is offered in 5-and 7-seat options. The homegrown UV maker has confirmed that the XUV500 nameplate will return and will come with significant changes. It will be significantly smaller than the previous model. If reports are to be believed, the new', 'images': [{'url': 'https://www.indiacarnews.com/wp-content/uploads/2023/02/Mahindra-BE.07.jpg', 'alt_text': 'Mahindra BE.07', 'title': 'Mahindra BE.07', 'width': '1068', 'height': '711', 'class': 'entry-thumb', 'confidence': 0.8999999999999999}, {'url': 'https://www.indiacarnews.com/wp-content/uploads/2023/02/mahindra-bolero-neo-plus-7-seater.jpg', 'alt_text': 'Mahindra bolero neo plus 7 seater', 'width': '1200', 'height': '800', 'class': 'wp-image-56702', 'confidence': 0.8999999999999999}, {'url': 'https://www.indiacarnews.com/wp-content/uploads/2022/12/5-Door-Mahindra-Thar-Launch.jpg', 'alt_text': '5-Door Mahindra Thar Launch', 'width': '1200', 'height': '800', 'class': 'wp-image-55097', 'confidence': 0.8999999999999999}, {'url': 'https://www.indiacarnews.com/wp-content/uploads/2023/03/Mahindra-Bolero-Diesel.jpg', 'alt_text': 'Mahindra Bolero Diesel', 'width': '1200', 'height': '675', 'class': 'wp-image-56877', 'confidence': 0.8999999999999999}, {'url': 'https://www.indiacarnews.com/wp-content/uploads/2021/05/Mahindra-Design-Sketch-1.jpg', 'alt_text': 'Mahindra Design Sketch (1)', 'width': '1201', 'height': '800', 'class': 'wp-image-46382', 'loading': 'lazy', 'confidence': 0.8999999999999999}], 'rank': 1}, {'url': 'https://www.financialexpress.com/auto/car-news/top-5-upcoming-mahindra-vehicle-launches/2991432/', 'content': 'Top 5 upcoming Mahindra vehicle launches - Car News | The Financial Express FE AUTO NEWS CAR NEWS BIKE NEWS New Cars New Cars Best Cars REVIEWS PHOTOS VIDEOS WEB STORIES EV FE AUTO NEWS CAR NEWS BIKE NEWS New Cars New Cars Best Cars REVIEWS PHOTOS VIDEOS WEB STORIES EV Auto Car News Top 5 upcoming Mahindra vehicle launches Top 5 upcoming Mahindra vehicle launches Upcoming Mahindra launches in 2023 and 2024. Here are the top five Mahindra SUV and electric vehicle launches expected in India. Written by Rajkamal Narayanan February 24, 2023 11:55 IST Follow Us Mahindra has been on a spree of launching new vehicles such as the XUV700 , the new Scorpio -N, the all-electric XUV400, and the rear-wheel-drive Thar. The carmakers not done just yet, as there are more launches to expect from Mahindra. The company has plans to launch SUVs, cars, and electric vehicles in India. Here are the top 5 upcoming Mahindra vehicles, including new SUVs, electric vehicles, and cars. Mahindra Thar 5-door The Mahindra Thar has seen a fair bit of success in India since its launch as its a huge leap over the older-gen vehicle. To make the Thar lineup more practical, the carmaker has plans to launch a long-wheelbase version of the SUV, which will have five doors. The Mahindra Thar 5-door version has been spied numerous times while testing and is expected to launch this year. The 5-door Thar could carry over the same 2.2-litre diesel and 2.0-litre petrol engines, along with manual and automatic gearbox options. Similar to the current-gen Thar, the 5-door version could be offered in 4X2 and 4X4 trims. Mahindra Bolero Neo Plus Image credit: Rushlane Next on the cards is again a long-wheelbase version of an SUV currently on sale the Mahindra Bolero Neo. To be called the Bolero Neo Plus, the SUV is based on the Mahindra TUV300 Plus that was discontinued in India. The Mahindra Bolero Neo Plus has been spotted testing in India, and when launched later this year, it will be offered with different seating configurations and could be powered by a 2.2-litre diesel engine making 120bhp. Mahindra e20 NXT Mahindras first-ever electric car, the e20 is due for an update as the EV market is picking up pace. The e20 was showcased earlier with new updates, however, there has been no word from Mahindra about its launch, and looking at Tatas Tiago EV racking up numbers, Mahindra could think of a similar strategy. Also Read Tata Tiago EV launched in India at Rs 8.49 lakh Mahindra eKUV100 The KUV100 is a strong contender to be electrified, as this makes a practical vehicle for city use. Mahindra could rename the vehicle altogether, however, it will borrow most of its design elements from the KUV100. If Mahindra manages to price it right, the eKUV100 could be a strong competitor to the Tata Tiago EV. Also Read Four upcoming Maruti Suzuki cars and SUVs in 2023 Mahindra XUV500 This may get fans excited, as Mahindra confirmed that the XUV500 will be making a comeback, either late this year or early next year. The Mahindra XUV500 will see significant design updates compared to its older-gen model, while it will sit between the XUV300 and the XUV700 in Mahindras lineup. The new Mahindra XUV500 is expected to carry forward the same engine from the XUV700, but in a detuned state to make less power. Also, when launched, the XUV500 is expected to feature ADAS tech along with a host of other interior upgrades. Discover the latest in the auto world with new cars and new bikes , explore upcoming cars in India, and find your perfect match with cars under 5 lakh , 10 lakh or 15 lakh. Stay updated with the latest auto news and the rise of electric vehicles. This article was first uploaded on February twenty-four, twenty twenty-three, at fifty-five minutes past eleven in the morning. Latest Auto News Drive Safer, Drive Smarter: The updated Toyota Glanza raises the bar India-bound Renault Boreal unveiled: All you need to know Hero Vida VX2 first ride review The versatile family scooter Mahindra', 'images': [{'url': 'https://www.financialexpress.com/wp-content/themes/ie-network-theme/assets/src/img/default-ie.jpg', 'alt_text': 'Toyota Glanza 2025, Glanza Prestige Edition, Toyota Glanza six airbags, Toyota Glanza safety features, Glanza new variant 2025, Glanza vs Baleno, Glanza fuel efficiency, Toyota Glanza engine specs, Toyota Glanza price in India, Toyota Glanza mileage, Glanza CNG variant, Toyota Glanza features, Toyota Glanza HUD, Toyota Glanza connected features, Toyota Glanza updates, Toyota hatchback India, Glanza vs i20 vs Altroz, Premium hatchback India 2025, Glanza accessories Prestige Edition, Toyota Glanza maintenance warranty', 'width': '310', 'height': '174', 'class': 'attachment-newspack-article-block-landscape-medium size-newspack-article-block-landscape-medium wp-post-image lazyloading', 'loading': 'lazy', 'confidence': 1.0}, {'url': 'https://www.financialexpress.com/wp-content/themes/ie-network-theme/assets/src/img/default-ie.jpg', 'alt_text': 'Renault Boreal India, 7-seater SUV 2026, Renault Boreal specifications, Renault Boreal design, Renault Boreal safety features, Renault Boreal engine, Renault Boreal launch date, Renault Duster 7-seater, Renault Boreal price India, Renault Boreal ADAS', 'width': '310', 'height': '174', 'class': 'attachment-newspack-article-block-landscape-medium size-newspack-article-block-landscape-medium wp-post-image lazyloading', 'loading': 'lazy', 'confidence': 1.0}, {'url': 'https://www.financialexpress.com/wp-content/themes/ie-network-theme/assets/src/img/default-ie.jpg', 'alt_text': 'Mahindra XUV 3XO, RevX lineup, sub-4-metre SUV, price, features, petrol engine, panoramic sunroof, ADAS, Maruti Suzuki Brezza, Tata Nexon', 'width': '310', 'height': '174', 'class': 'attachment-newspack-article-block-landscape-medium size-newspack-article-block-landscape-medium wp-post-image lazyloading', 'loading': 'lazy', 'confidence': 1.0}, {'url': 'https://www.financialexpress.com/wp-content/themes/ie-network-theme/assets/src/img/default-ie.jpg', 'alt_text': 'Road trip: Chennai to Mahabalipuram; Where timeless history meets the endless sea', 'width': '310', 'height': '174', 'class': 'attachment-newspack-article-block-landscape-medium size-newspack-article-block-landscape-medium wp-post-image lazyloading', 'loading': 'lazy', 'confidence': 1.0}, {'url': 'https://www.financialexpress.com/wp-content/themes/ie-network-theme/assets/src/img/default-ie.jpg', 'alt_text': 'Luxury car sales in the slow lane in H1', 'width': '310', 'height': '174', 'class': 'attachment-newspack-article-block-landscape-medium size-newspack-article-block-landscape-medium wp-post-image lazyloading', 'loading': 'lazy', 'confidence': 1.0}], 'rank': 2}, {'url': 'https://teamcardelight.com/mahindras-4-new-launches-in-2024-all-the-details/', 'content': 'Mahindra\\'s 4 New Launches in 2024: All the Details. - Team Car Delight Team Car Delight Menu News Bikes Cars Reviews Bikes Cars Service Cost Finder Contact Us Home Uncategorized Mahindra\\'s 4 New Launches in 2024: All the Details. Mahindras 4 New Launches in 2024: All the Details. contact@teamcardelight.com Uncategorized December 3, 2024 Mahindra is expected to launch four new vehicles this year, including an EV, to broaden its range and meet the needs of customers. For its rivals, this will make for fierce competition. Xuv300 Facelift: For an overall bold SUV character, we will get a redesigned front and rear fascia with new projector designs and a crisp LED taillamp layout, in addition to a new alloy wheel design. A redesigned dashboard with a larger touchscreen infotainment system, a luxurious cabin, and numerous cutting-edge connectivity capabilities. A panoramic sunroof will also be included . Three Engine Options: 1.2 L MPI Turbo-Petrol (110 BHP / 200 Nm) 1.2 L TGDI Petrol (131 BHP / 230 Nm) 1.5 L Turbo Diesel (117 BHP / 300 Nm) 6-Speed manual and automatic, along with Aisin-sourced 6-speed Torque converter for TGDI Price: Between Rs. 8.5 L to Rs. 16 L (ex-showroom)* Launch: February 2024. Xuv300 Ev: Similar design language as the facelifted Xuv300, with some EV tweaks inside and out. will be placed below xuv400. will likely get a 35-kWh battery pack with an expected range of 400+ kilometres on a single charge. Will be offered in the FWD variant initially. Price: Between 12 and 17 lakhs (ex-showroom) Launch: Second Half of 2024. For latest Car Discounts, News, and More, Join Our WhatsApp Group: https://chat.whatsapp.com/LCpASDXKeAp3c2r5o9zmcu Mahindra Thar Armada: Based on the ladder frame chassis. Will have a similar design language to the three-door Thar, with a few designer tweaks, such as LED projectors and an updated look for the LED taillamps. Will be bigger in size yet provide a similar arrangement of two rows of seats. Together with a sophisticated interior and a slew of new generational features, we will receive a redesigned dashboard with a larger touchscreen infotainment system and an electric sunroof. Two Engine Options: 2.0 L MStallion Turbo-Petrol (152 BHP / 320 Nm) 2.2 L MHawk Diesel (132 BHP / 300 Nm) 6-Speed Manual and Automatic Transmission Options. Price: Between Rs. 15 lakhs and 20 lakhs (ex-showroom). Launch: Second Half of 2024. Bolero Neo Plus: will be similar to Bolero Neo in terms of design language, with some minor changes. will offer 7 and 9 seating configurations. will be powered by a 2.2-litre diesel engine producing 120 hp, similar to other Bolero models with a 6-speed manual transmission. Will be available in only 42 drivetrain. Price: Between Rs. 9 lakhs and Rs. 15 lakhs (ex-showroom). Launch: later, in 2024. For latest Car Discounts, News, and More, Join Our WhatsApp Group: https://chat.whatsapp.com/LCpASDXKeAp3c2r5o9zmcu https://teamcardelight.com/news/mahindras-4-new-launches-in-2024-all-the-details/ Share this post Post navigation Previous Post Tatas new CNG SUV will soon hit the market. All the details. Next Post 3 New Maruti Cars Launching This Year 2 ICE, 1 EV! Leave a Comment Cancel reply Name Email Website Save my name, email, and website in this browser for the next time I comment. Comment [ajax_load_more container_type=\"div\" post_type=\"post\" posts_per_page=\"1\" scroll_distance=\"50\" transition_delay=\"1\"] Related Posts Uncategorized Joseph June 24, 2025 Indias Safest SUV? Tata Harrier EV Scores Big in Crash Tests! Uncategorized Joseph June 9, 2025 Rs. 4 Lakh Damage: Luxury SUV Breaks Down After Refuelling at HPCL! Uncategorized Joseph March 8, 2025 Upcoming 3 New Compact SUVs Launching in India This Year! Car Service Cost Joseph March 4, 2025 Maruti Ciaz 10 Years Service Cost Uncategorized contact@teamcardelight.com December 23, 2024 Uncategorized contact@teamcardelight.com December 23, 2024 Uncategorized contact@teamcardelight.com December 23, 2024 Uncategorized contact@teamcardel', 'images': [{'url': 'https://i0.wp.com/test.teamcardelight.com/wp-content/uploads/2022/03/mahindra-bolero-2.jpeg?w=660&ssl=1', 'alt_text': 'Bolero Mahindra', 'class': 'wp-image-7873', 'confidence': 0.7}], 'rank': 3}, {'url': 'https://www.zigwheels.com/news-features/general-news/4-upcoming-mahindra-cars-worth-keeping-an-eye-on-in-2024/51747/?is_amp=1&onlyStory=6', 'content': \"Mahindra Upcoming Car Launches In 2024: Thar 5-Door, XUV300 Facelift, XUV.e8, XUV400 Facelift - ZigWheels News & Reviews New Cars New Bikes Scooters Auto Expo 2025 Electric Vehicles Used Cars Home News 4 Upcoming Mahindra Cars Worth Keeping An Eye On In 2024 Overview Price Variants Mileage Specs Colours Images Videos UserReviews ExpertReviews Q&A News FAQs SimilarCars 360View Thar5DoorCommunity Dealers Services Brochures Thar5DoorEMI Loans Thar5DoorInsurance 4 Upcoming Mahindra Cars Worth Keeping An Eye On In 2024 Dec 20, 2023 | Views: 6119 | 2 min read By Sumit Khanchandani 2024 will finally be the year when we witness the launch of the larger version of Mahindra's capable off-roader The upcoming year for Mahindra looks exciting, with the launch of the larger version of its capable off-roader and the introduction of the electric version of their popular mid-size SUV, along with the release of a couple of facelifts. These are the upcoming launches from Mahindra in 2024 that you should look out for Mahindra Thar 5-Door Mahindra is set to launch the highly anticipated 5-door version of the Thar next year. With a larger footprint than the 3-door model, it will boast additional features such as a bigger infotainment system and a sunroof. The Thar 5-door will be offered with both petrol and diesel engine options and is expected to be available in 4-wheel-drive (4WD) and rear-wheel-drive (RWD) configurations. Expected Price : Rs 15 lakh Expected Launch : March 2024 Mahindra XUV300 Facelift Mahindras sub-4m SUV, the XUV300 , is due for a significant refresh in 2024. It will feature exterior design changes, along with a redesigned cabin. Mahindra may also equip the facelifted XUV300 with ADAS, while offering it in both petrol and diesel engine options. Expected Price : Rs 9 lakh Expected Launch : March 2024 Mahindra XUV.e8 In 2024, we may also see the launch of the all-electric version of the XUV700 , the XUV.e8 . The electric SUV is expected to be offered with two battery pack options, ranging from 60 kWh to 80 kWh, along with the availability of a dual-motor all-wheel drivetrain . We expect the XUV.e8 to have a range of around 450 km. Expected Price : Rs 35 lakh Expected Launch : End of 2024 Mahindra XUV400 Facelift Recent spy images of the updated XUV400 suggest its potential launch in 2024. We expect the updated EV to showcase design updates reminiscent of the facelifted XUV300 with similar features. With the facelift, the XUV400 is expected to come with an improved range while retaining its existing 34.5 kWh and 39.4 kWh battery pack options that could offer better range. Expected Price : Rs 16 lakh Expected Launch : Second half of 2024 This wraps up the upcoming launches from Mahindra in 2024. Let us know in the comments which car you are most excited about. Mahindra Thar 5-Door Video Review Add Your Comment Mahindra Thar ROXX 4.4/5 39 reviews Rs. 12.99 Lakh View July Offers Latest News Range Rover Velar Autobiography Launched At Rs 89.9 Lakh, Heres Everything You Need To Know BMW 2 Series Gran Coupe Launched In India At Rs 46.9 Lakh 6 Airbags Now Offered As Standard With The Maruti Baleno And Ertiga! Prices Hiked By Heres How You Book A Tesla Model Y In India! View All Latest News Popular News Teslas Grand India Debut: Model Y Hits Roads At Rs 59.89 Lakh! Mahindra XUV 3XO Gets A New REVX Variant Lineup, Makes A Crowd-favourite Feature More Accessible! EXCLUSIVE: Kia Carens Clavis EV To Be A 7-Seater Only? Here's What We Know! Mahindra XEV 9e And BE 6 Now Get A Bigger Battery In Pack Two Variant! View All Similar Cars Review 2024 Hyundai Creta Facelift vs Rivals: Which Compact SUV Shines On The Road? Hyundai Creta 2024 Review: First Drive 2022 Mahindra Scorpio N First Drive: Perfect Middle Ground? Trending Mahindra Cars Mahindra Thar Rs. 11.50 Lakh Mahindra Scorpio N Rs. 13.99 Lakh Mahindra XUV700 Rs. 14.49 Lakh Mahindra Bolero Rs. 9.70 Lakh Mahindra Scorpio Rs. 13.77 Lakh All Mahindra Cars Trending SUV Cars Defender Rs. 1.05\", 'images': [{'url': 'https://media.zigcdn.com/media/content/2023/Dec/6581758c9390a.jpg?tr=w-420', 'alt_text': 'Upcoming Mahindra Cars In 2024', 'title': 'Upcoming Mahindra Cars In 2024', 'class': 'i-amphtml-fill-content i-amphtml-replaced-content', 'loading': 'lazy', 'confidence': 0.8999999999999999}], 'rank': 4}, {'url': 'https://www.rushlane.com/new-mahindra-suv-launches-planned-for-2024-12483885.html', 'content': 'New Mahindra SUV Launches Planned For 2024 - RushLane Facebook Instagram Linkedin Mail Twitter Youtube Car News Bike News EV News CV News Spy Shots Scoops Reviews Search RUSHLANE DAILY AUTO NEWS RUSHLANE DAILY AUTO NEWS RUSHLANE DAILY AUTO NEWS Whatsapp Group Telegram About Us Tips Contact Us Car News Bike News EV News CV News Spy Shots Scoops Reviews Search RUSHLANE DAILY AUTO NEWS Car News Bike News EV News CV News Spy Shots Scoops Reviews SEARCH Home Car News New Mahindra SUV Launches Planned For 2024 New Mahindra SUV Launches Planned For 2024 Pearl Daniels December 25, 2023 New Mahindra Thar 5D Mahindra XUV400 EV, XUV300 Facelift, XUV700 EV, XUV300 EV, Thar 5 Door and XUV.e8 are among the SUVs set to be launched next year Several automakers in India have plans to launch new cars in 2024. Mahindra, the largest SUV maker in India, could have an interesting lineup of 6 new SUVs all of which are slated for launch in 2024. Some are facelifts while there are also some that are being launched in the electric segment. We give details of each of these upcoming models, their estimated launch period and prices as per what is known as on date. 1. Mahindra XUV300 facelift In view of rising competition from the likes of Tata Nexon and Kia Sonet, the Mahindra XUV300 is also set to receive a facelift in early 2023. It has been seen with an all new front and rear with LED lighting and full-width LED light bar at the rear. Its cabin also gets an overhaul with a larger 10.25 inch touchscreen while it could also get a panoramic sunroof, new central console and redesigned panel for AC controls. It will see no change in its engine lineup and continue to draw power via a 1.5 liter diesel, 1.2 liter turbo petrol and 1.2 liter direct injection turbo petrol (TGDI) with transmission options to include new Aisin sourced 6 speed automatic and 6 speed manual. View this post on Instagram A post shared by RushLane (@rushlane) 2. Mahindra Thar 5-Door Mahindra Thar 5-door is also doing the test rounds ahead of launch in 2024. It however, may be called by another name as the company has trademarked 7 names associated with the upcoming Thar. The model on test sported some changes in design over its 3-door counterpart while it also rides on a longer wheelbase. These included a single-pane sunroof, roof mounted speakers, new front grille design, LED headlamps, revised bumper and new alloy wheels while it also gets an extra pair of doors. The interiors get a larger 10 inch touchscreen infotainment system, new steering wheel and heavily upholstered seating in the front. It will however see no change in its engine options and the Thar 5-door continues to draw power via a 2.0 liter petrol and 2.2 liter diesel engine mated to 6 speed manual and 6 speed automatic transmission options. Mahindra XUV700 Electric Spied 3. Mahindra XUV700 6-seater with captain seats The current Mahindra XUV700 is offered with 5 and 7 seater options. However, a leaked manual has shown off a 6 seater variant that is set to launch sometime in early 2024. This update will keep it abreast in competition with the Hyundai Alcazar and Tata Safari, both of which are available in 6 seater versions. The Mahindra XUV700 6 seater version with captain seats in second row will see a 60:40 split with folding arm rests and slide and recline function. Feature updates will also include auto dimming IRVMs with anti-glare auto adjustment function, wherein the reflection rate of inside mirrors can be adjusted via a switch. Apart from these two features, the Mahindra XUV700 sees no other changes or mechanical updates. It will continue to be powered by the same 2.0 liter turbo petrol and 2.2 liter turbo diesel engines mated to 6 speed manual and 6 speed automatic gearbox options. 4. Mahindra XUV300 EV Upcoming XUV300 EV will be positioned as an entry level electric SUV, will be in the sub 4 meter segment and will sit below the XUV400 in the company portfolio. In terms of features, it will see all the updates t', 'images': [{'url': 'https://www.rushlane.com/wp-content/uploads/2023/12/mahindra-thar-5-door-launch-price-spy-shots-600x338.jpg', 'alt_text': 'New Mahindra Thar 5D', 'width': '600', 'height': '338', 'class': 'size-medium wp-image-484152', 'confidence': 0.8999999999999999}, {'url': 'https://www.rushlane.com/wp-content/uploads/2022/09/mahindra-xuv700-electric-spied-bangalore-range-price-2-600x338.jpg', 'alt_text': 'Mahindra XUV700 Electric Spied', 'width': '600', 'height': '338', 'class': 'size-medium wp-image-449768', 'confidence': 0.8999999999999999}, {'url': 'https://www.rushlane.com/wp-content/uploads/2019/04/unnamed-1.png', 'alt_text': 'rushlane logo', 'title': 'rushlane logo', 'class': 'tdb-logo-img td-retina-data', 'confidence': 0.7}, {'url': 'https://www.rushlane.com/wp-content/uploads/2019/04/unnamed-1.png', 'alt_text': 'rushlane logo', 'title': 'rushlane logo', 'class': 'tdb-logo-img td-retina-data', 'confidence': 0.7}, {'url': 'https://www.rushlane.com/wp-content/uploads/2019/04/unnamed-1.png', 'alt_text': 'rushlane logo', 'title': 'rushlane logo', 'class': 'tdb-logo-img td-retina-data', 'confidence': 0.7}], 'rank': 5}, {'url': 'https://www.acko.com/car-guide/upcoming-mahindra-cars-in-india/', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://www.cardekho.com/india-car-news/all-major-car-launches-of-2024-in-india-33657.htm', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://www.v3cars.com/news/mahindra-upcoming-cars-suvs-and-evs-in-2024', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null,
            "_meta": null
          }
        ]
      }
    },
    "validation_results": {
      "is_valid": true,
      "is_dag": true,
      "cycles": [],
      "disconnected_components": [],
      "orphaned_nodes": [],
      "root_nodes": [],
      "leaf_nodes": [
        "T004"
      ],
      "warnings": [],
      "errors": []
    }
  },
  "nodes": [
    {
      "description": "Initial Query",
      "agent": "System",
      "status": "completed",
      "id": "ROOT"
    },
    {
      "id": "T001",
      "description": "Research Mahindra's recent car launches in the last 1 year",
      "agent": "RetrieverAgent",
      "agent_prompt": "Find information about Mahindra's recent car launches in the last one year. Focus on new models and updated versions of existing models.",
      "reads": [],
      "writes": [
        "T001"
      ],
      "status": "completed",
      "output": {
        "data": [
          {
            "type": "text",
            "text": "[{'url': 'https://www.indiacarnews.com/news/upcoming-mahindra-cars-20433/', 'content': 'New Upcoming Mahindra Cars In India In 2023, 2024 & 2025 News Reviews Comparisons Two Wheelers Web Stories About Us Contact Us Search India Car News Know everything about new and upcoming cars and bikes in India Facebook Twitter Thursday, July 17, 2025 Facebook Twitter Youtube India Car News Know everything about new and upcoming cars and bikes in India News Reviews Comparisons Two Wheelers Web Stories About Us Contact Us Search April 18, 2023 Upcoming Mahindra Cars in India in the Next Two Years Facebook Twitter Pinterest WhatsApp Famous for its utility and sports utility vehicles, the homegrown auto major, Mahindra ruled the segment for long. However, it is facing tough competition from the likes of Maruti Suzuki, Hyundai and Tata Motors in the UV space. Determined to regain lost ground in the segment, Mahindra had introduced multiple new SUVs including the new Thar, XUV700 and the Scorpio-N. In order to further strengthen its position in the UV segment, Mahindra plans to launch a range of new SUVs in the next 2-3 years. Heres a look at all upcoming Mahindra cars in India in 2023, 2024 and 2025. ads Upcoming Mahindra Cars in 2023, 2024, 2025 1. Mahindra Bolero Neo Plus Mahindra is all set to introduce the extended version of the Bolero Neo in the country. Called the Bolero Neo Plus, the SUV is likely to be offered with two seating configurations 7 and 9-seats. It will also be offered with an ambulance variant with 4-seats layout and a patient bed. In terms of proportions, the SUV is 4400mm long, 1795mm wide and 1812mm tall, and has a wheelbase of 2680mm. The new model looks largely identical to the Bolero Neo; however, it received some changes to keep things fresh. Instead of a blacked-out C-pillar, it has body-coloured pillars. It gets new rear bumper and smaller reflector panels, a tailgate-mounted spare tyre with badging and extended rear door. The SUV will be powered by a 2.2L mHawk diesel engine with a 6-speed manual gearbox. This powertrain produces 130PS and 300Nm of torque. 2. 5-door Mahindra Thar The next model in our list of upcoming Mahindra cars is the 5-door or long wheelbase version of the Mahindra Thar. It is expected to be launched by the end of 2023 or early 2024. The 5-door Mahindra Thar will have 300mm longer wheelbase than its 3-door model. It is expected to be based on the new Scorpio-Ns ladder-frame chassis with increased width between the wheelbase for bettery wheelbase-to-track ratio. The SUV will have an extra door for the middle row passengers. The cabin layout will be similar to the existing model and will have a three seat bench layout in the middle row and provide bigger boot space. The SUV is expected to share its powertrains with the Scorpio N. It will be offered with a 200bhp, 2.0L turbo petrol and a 172bhp, 2.2L turbo diesel engine. It can be had with either a manual or an automatic gearbox. 3. New-gen Mahindra Bolero Mahindra will launch the next gen Bolero in our market in 2024. The SUV enjoys huge popularity among buyers in rural and semi-urban markets. It is reportedly to be based on the new ladder-frame chassis that underpins the Thar and the Scorpio-N. The new model is likely to retain the original look; however, it will come with several new design elements and body panels. The cabin will receive maximum changes with better fit & finish levels and material quality. It could also get some modern day features like a touchscreen infotainment system, a multi-functional steering wheel, height adjustable drivers seat and automatic AC. The SUV is likely to feature a 2.2L mHawk diesel and a 2.0L turbo petrol engine along with manual and automatic gearbox options. 4. New Mahindra XUV500 Mahindra had replaced the XUV500 SUV with an all-new XUV700 that is offered in 5-and 7-seat options. The homegrown UV maker has confirmed that the XUV500 nameplate will return and will come with significant changes. It will be significantly smaller than the previous model. If reports are to be believed, the new', 'images': [{'url': 'https://www.indiacarnews.com/wp-content/uploads/2023/02/Mahindra-BE.07.jpg', 'alt_text': 'Mahindra BE.07', 'title': 'Mahindra BE.07', 'width': '1068', 'height': '711', 'class': 'entry-thumb', 'confidence': 0.8999999999999999}, {'url': 'https://www.indiacarnews.com/wp-content/uploads/2023/02/mahindra-bolero-neo-plus-7-seater.jpg', 'alt_text': 'Mahindra bolero neo plus 7 seater', 'width': '1200', 'height': '800', 'class': 'wp-image-56702', 'confidence': 0.8999999999999999}, {'url': 'https://www.indiacarnews.com/wp-content/uploads/2022/12/5-Door-Mahindra-Thar-Launch.jpg', 'alt_text': '5-Door Mahindra Thar Launch', 'width': '1200', 'height': '800', 'class': 'wp-image-55097', 'confidence': 0.8999999999999999}, {'url': 'https://www.indiacarnews.com/wp-content/uploads/2023/03/Mahindra-Bolero-Diesel.jpg', 'alt_text': 'Mahindra Bolero Diesel', 'width': '1200', 'height': '675', 'class': 'wp-image-56877', 'confidence': 0.8999999999999999}, {'url': 'https://www.indiacarnews.com/wp-content/uploads/2021/05/Mahindra-Design-Sketch-1.jpg', 'alt_text': 'Mahindra Design Sketch (1)', 'width': '1201', 'height': '800', 'class': 'wp-image-46382', 'loading': 'lazy', 'confidence': 0.8999999999999999}], 'rank': 1}, {'url': 'https://www.financialexpress.com/auto/car-news/top-5-upcoming-mahindra-vehicle-launches/2991432/', 'content': 'Top 5 upcoming Mahindra vehicle launches - Car News | The Financial Express FE AUTO NEWS CAR NEWS BIKE NEWS New Cars New Cars Best Cars REVIEWS PHOTOS VIDEOS WEB STORIES EV FE AUTO NEWS CAR NEWS BIKE NEWS New Cars New Cars Best Cars REVIEWS PHOTOS VIDEOS WEB STORIES EV Auto Car News Top 5 upcoming Mahindra vehicle launches Top 5 upcoming Mahindra vehicle launches Upcoming Mahindra launches in 2023 and 2024. Here are the top five Mahindra SUV and electric vehicle launches expected in India. Written by Rajkamal Narayanan February 24, 2023 11:55 IST Follow Us Mahindra has been on a spree of launching new vehicles such as the XUV700 , the new Scorpio -N, the all-electric XUV400, and the rear-wheel-drive Thar. The carmakers not done just yet, as there are more launches to expect from Mahindra. The company has plans to launch SUVs, cars, and electric vehicles in India. Here are the top 5 upcoming Mahindra vehicles, including new SUVs, electric vehicles, and cars. Mahindra Thar 5-door The Mahindra Thar has seen a fair bit of success in India since its launch as its a huge leap over the older-gen vehicle. To make the Thar lineup more practical, the carmaker has plans to launch a long-wheelbase version of the SUV, which will have five doors. The Mahindra Thar 5-door version has been spied numerous times while testing and is expected to launch this year. The 5-door Thar could carry over the same 2.2-litre diesel and 2.0-litre petrol engines, along with manual and automatic gearbox options. Similar to the current-gen Thar, the 5-door version could be offered in 4X2 and 4X4 trims. Mahindra Bolero Neo Plus Image credit: Rushlane Next on the cards is again a long-wheelbase version of an SUV currently on sale the Mahindra Bolero Neo. To be called the Bolero Neo Plus, the SUV is based on the Mahindra TUV300 Plus that was discontinued in India. The Mahindra Bolero Neo Plus has been spotted testing in India, and when launched later this year, it will be offered with different seating configurations and could be powered by a 2.2-litre diesel engine making 120bhp. Mahindra e20 NXT Mahindras first-ever electric car, the e20 is due for an update as the EV market is picking up pace. The e20 was showcased earlier with new updates, however, there has been no word from Mahindra about its launch, and looking at Tatas Tiago EV racking up numbers, Mahindra could think of a similar strategy. Also Read Tata Tiago EV launched in India at Rs 8.49 lakh Mahindra eKUV100 The KUV100 is a strong contender to be electrified, as this makes a practical vehicle for city use. Mahindra could rename the vehicle altogether, however, it will borrow most of its design elements from the KUV100. If Mahindra manages to price it right, the eKUV100 could be a strong competitor to the Tata Tiago EV. Also Read Four upcoming Maruti Suzuki cars and SUVs in 2023 Mahindra XUV500 This may get fans excited, as Mahindra confirmed that the XUV500 will be making a comeback, either late this year or early next year. The Mahindra XUV500 will see significant design updates compared to its older-gen model, while it will sit between the XUV300 and the XUV700 in Mahindras lineup. The new Mahindra XUV500 is expected to carry forward the same engine from the XUV700, but in a detuned state to make less power. Also, when launched, the XUV500 is expected to feature ADAS tech along with a host of other interior upgrades. Discover the latest in the auto world with new cars and new bikes , explore upcoming cars in India, and find your perfect match with cars under 5 lakh , 10 lakh or 15 lakh. Stay updated with the latest auto news and the rise of electric vehicles. This article was first uploaded on February twenty-four, twenty twenty-three, at fifty-five minutes past eleven in the morning. Latest Auto News Drive Safer, Drive Smarter: The updated Toyota Glanza raises the bar India-bound Renault Boreal unveiled: All you need to know Hero Vida VX2 first ride review The versatile family scooter Mahindra', 'images': [{'url': 'https://www.financialexpress.com/wp-content/themes/ie-network-theme/assets/src/img/default-ie.jpg', 'alt_text': 'Toyota Glanza 2025, Glanza Prestige Edition, Toyota Glanza six airbags, Toyota Glanza safety features, Glanza new variant 2025, Glanza vs Baleno, Glanza fuel efficiency, Toyota Glanza engine specs, Toyota Glanza price in India, Toyota Glanza mileage, Glanza CNG variant, Toyota Glanza features, Toyota Glanza HUD, Toyota Glanza connected features, Toyota Glanza updates, Toyota hatchback India, Glanza vs i20 vs Altroz, Premium hatchback India 2025, Glanza accessories Prestige Edition, Toyota Glanza maintenance warranty', 'width': '310', 'height': '174', 'class': 'attachment-newspack-article-block-landscape-medium size-newspack-article-block-landscape-medium wp-post-image lazyloading', 'loading': 'lazy', 'confidence': 1.0}, {'url': 'https://www.financialexpress.com/wp-content/themes/ie-network-theme/assets/src/img/default-ie.jpg', 'alt_text': 'Renault Boreal India, 7-seater SUV 2026, Renault Boreal specifications, Renault Boreal design, Renault Boreal safety features, Renault Boreal engine, Renault Boreal launch date, Renault Duster 7-seater, Renault Boreal price India, Renault Boreal ADAS', 'width': '310', 'height': '174', 'class': 'attachment-newspack-article-block-landscape-medium size-newspack-article-block-landscape-medium wp-post-image lazyloading', 'loading': 'lazy', 'confidence': 1.0}, {'url': 'https://www.financialexpress.com/wp-content/themes/ie-network-theme/assets/src/img/default-ie.jpg', 'alt_text': 'Mahindra XUV 3XO, RevX lineup, sub-4-metre SUV, price, features, petrol engine, panoramic sunroof, ADAS, Maruti Suzuki Brezza, Tata Nexon', 'width': '310', 'height': '174', 'class': 'attachment-newspack-article-block-landscape-medium size-newspack-article-block-landscape-medium wp-post-image lazyloading', 'loading': 'lazy', 'confidence': 1.0}, {'url': 'https://www.financialexpress.com/wp-content/themes/ie-network-theme/assets/src/img/default-ie.jpg', 'alt_text': 'Road trip: Chennai to Mahabalipuram; Where timeless history meets the endless sea', 'width': '310', 'height': '174', 'class': 'attachment-newspack-article-block-landscape-medium size-newspack-article-block-landscape-medium wp-post-image lazyloading', 'loading': 'lazy', 'confidence': 1.0}, {'url': 'https://www.financialexpress.com/wp-content/themes/ie-network-theme/assets/src/img/default-ie.jpg', 'alt_text': 'Luxury car sales in the slow lane in H1', 'width': '310', 'height': '174', 'class': 'attachment-newspack-article-block-landscape-medium size-newspack-article-block-landscape-medium wp-post-image lazyloading', 'loading': 'lazy', 'confidence': 1.0}], 'rank': 2}, {'url': 'https://teamcardelight.com/mahindras-4-new-launches-in-2024-all-the-details/', 'content': 'Mahindra\\'s 4 New Launches in 2024: All the Details. - Team Car Delight Team Car Delight Menu News Bikes Cars Reviews Bikes Cars Service Cost Finder Contact Us Home Uncategorized Mahindra\\'s 4 New Launches in 2024: All the Details. Mahindras 4 New Launches in 2024: All the Details. contact@teamcardelight.com Uncategorized December 3, 2024 Mahindra is expected to launch four new vehicles this year, including an EV, to broaden its range and meet the needs of customers. For its rivals, this will make for fierce competition. Xuv300 Facelift: For an overall bold SUV character, we will get a redesigned front and rear fascia with new projector designs and a crisp LED taillamp layout, in addition to a new alloy wheel design. A redesigned dashboard with a larger touchscreen infotainment system, a luxurious cabin, and numerous cutting-edge connectivity capabilities. A panoramic sunroof will also be included . Three Engine Options: 1.2 L MPI Turbo-Petrol (110 BHP / 200 Nm) 1.2 L TGDI Petrol (131 BHP / 230 Nm) 1.5 L Turbo Diesel (117 BHP / 300 Nm) 6-Speed manual and automatic, along with Aisin-sourced 6-speed Torque converter for TGDI Price: Between Rs. 8.5 L to Rs. 16 L (ex-showroom)* Launch: February 2024. Xuv300 Ev: Similar design language as the facelifted Xuv300, with some EV tweaks inside and out. will be placed below xuv400. will likely get a 35-kWh battery pack with an expected range of 400+ kilometres on a single charge. Will be offered in the FWD variant initially. Price: Between 12 and 17 lakhs (ex-showroom) Launch: Second Half of 2024. For latest Car Discounts, News, and More, Join Our WhatsApp Group: https://chat.whatsapp.com/LCpASDXKeAp3c2r5o9zmcu Mahindra Thar Armada: Based on the ladder frame chassis. Will have a similar design language to the three-door Thar, with a few designer tweaks, such as LED projectors and an updated look for the LED taillamps. Will be bigger in size yet provide a similar arrangement of two rows of seats. Together with a sophisticated interior and a slew of new generational features, we will receive a redesigned dashboard with a larger touchscreen infotainment system and an electric sunroof. Two Engine Options: 2.0 L MStallion Turbo-Petrol (152 BHP / 320 Nm) 2.2 L MHawk Diesel (132 BHP / 300 Nm) 6-Speed Manual and Automatic Transmission Options. Price: Between Rs. 15 lakhs and 20 lakhs (ex-showroom). Launch: Second Half of 2024. Bolero Neo Plus: will be similar to Bolero Neo in terms of design language, with some minor changes. will offer 7 and 9 seating configurations. will be powered by a 2.2-litre diesel engine producing 120 hp, similar to other Bolero models with a 6-speed manual transmission. Will be available in only 42 drivetrain. Price: Between Rs. 9 lakhs and Rs. 15 lakhs (ex-showroom). Launch: later, in 2024. For latest Car Discounts, News, and More, Join Our WhatsApp Group: https://chat.whatsapp.com/LCpASDXKeAp3c2r5o9zmcu https://teamcardelight.com/news/mahindras-4-new-launches-in-2024-all-the-details/ Share this post Post navigation Previous Post Tatas new CNG SUV will soon hit the market. All the details. Next Post 3 New Maruti Cars Launching This Year 2 ICE, 1 EV! Leave a Comment Cancel reply Name Email Website Save my name, email, and website in this browser for the next time I comment. Comment [ajax_load_more container_type=\"div\" post_type=\"post\" posts_per_page=\"1\" scroll_distance=\"50\" transition_delay=\"1\"] Related Posts Uncategorized Joseph June 24, 2025 Indias Safest SUV? Tata Harrier EV Scores Big in Crash Tests! Uncategorized Joseph June 9, 2025 Rs. 4 Lakh Damage: Luxury SUV Breaks Down After Refuelling at HPCL! Uncategorized Joseph March 8, 2025 Upcoming 3 New Compact SUVs Launching in India This Year! Car Service Cost Joseph March 4, 2025 Maruti Ciaz 10 Years Service Cost Uncategorized contact@teamcardelight.com December 23, 2024 Uncategorized contact@teamcardelight.com December 23, 2024 Uncategorized contact@teamcardelight.com December 23, 2024 Uncategorized contact@teamcardel', 'images': [{'url': 'https://i0.wp.com/test.teamcardelight.com/wp-content/uploads/2022/03/mahindra-bolero-2.jpeg?w=660&ssl=1', 'alt_text': 'Bolero Mahindra', 'class': 'wp-image-7873', 'confidence': 0.7}], 'rank': 3}, {'url': 'https://www.zigwheels.com/news-features/general-news/4-upcoming-mahindra-cars-worth-keeping-an-eye-on-in-2024/51747/?is_amp=1&onlyStory=6', 'content': \"Mahindra Upcoming Car Launches In 2024: Thar 5-Door, XUV300 Facelift, XUV.e8, XUV400 Facelift - ZigWheels News & Reviews New Cars New Bikes Scooters Auto Expo 2025 Electric Vehicles Used Cars Home News 4 Upcoming Mahindra Cars Worth Keeping An Eye On In 2024 Overview Price Variants Mileage Specs Colours Images Videos UserReviews ExpertReviews Q&A News FAQs SimilarCars 360View Thar5DoorCommunity Dealers Services Brochures Thar5DoorEMI Loans Thar5DoorInsurance 4 Upcoming Mahindra Cars Worth Keeping An Eye On In 2024 Dec 20, 2023 | Views: 6119 | 2 min read By Sumit Khanchandani 2024 will finally be the year when we witness the launch of the larger version of Mahindra's capable off-roader The upcoming year for Mahindra looks exciting, with the launch of the larger version of its capable off-roader and the introduction of the electric version of their popular mid-size SUV, along with the release of a couple of facelifts. These are the upcoming launches from Mahindra in 2024 that you should look out for Mahindra Thar 5-Door Mahindra is set to launch the highly anticipated 5-door version of the Thar next year. With a larger footprint than the 3-door model, it will boast additional features such as a bigger infotainment system and a sunroof. The Thar 5-door will be offered with both petrol and diesel engine options and is expected to be available in 4-wheel-drive (4WD) and rear-wheel-drive (RWD) configurations. Expected Price : Rs 15 lakh Expected Launch : March 2024 Mahindra XUV300 Facelift Mahindras sub-4m SUV, the XUV300 , is due for a significant refresh in 2024. It will feature exterior design changes, along with a redesigned cabin. Mahindra may also equip the facelifted XUV300 with ADAS, while offering it in both petrol and diesel engine options. Expected Price : Rs 9 lakh Expected Launch : March 2024 Mahindra XUV.e8 In 2024, we may also see the launch of the all-electric version of the XUV700 , the XUV.e8 . The electric SUV is expected to be offered with two battery pack options, ranging from 60 kWh to 80 kWh, along with the availability of a dual-motor all-wheel drivetrain . We expect the XUV.e8 to have a range of around 450 km. Expected Price : Rs 35 lakh Expected Launch : End of 2024 Mahindra XUV400 Facelift Recent spy images of the updated XUV400 suggest its potential launch in 2024. We expect the updated EV to showcase design updates reminiscent of the facelifted XUV300 with similar features. With the facelift, the XUV400 is expected to come with an improved range while retaining its existing 34.5 kWh and 39.4 kWh battery pack options that could offer better range. Expected Price : Rs 16 lakh Expected Launch : Second half of 2024 This wraps up the upcoming launches from Mahindra in 2024. Let us know in the comments which car you are most excited about. Mahindra Thar 5-Door Video Review Add Your Comment Mahindra Thar ROXX 4.4/5 39 reviews Rs. 12.99 Lakh View July Offers Latest News Range Rover Velar Autobiography Launched At Rs 89.9 Lakh, Heres Everything You Need To Know BMW 2 Series Gran Coupe Launched In India At Rs 46.9 Lakh 6 Airbags Now Offered As Standard With The Maruti Baleno And Ertiga! Prices Hiked By Heres How You Book A Tesla Model Y In India! View All Latest News Popular News Teslas Grand India Debut: Model Y Hits Roads At Rs 59.89 Lakh! Mahindra XUV 3XO Gets A New REVX Variant Lineup, Makes A Crowd-favourite Feature More Accessible! EXCLUSIVE: Kia Carens Clavis EV To Be A 7-Seater Only? Here's What We Know! Mahindra XEV 9e And BE 6 Now Get A Bigger Battery In Pack Two Variant! View All Similar Cars Review 2024 Hyundai Creta Facelift vs Rivals: Which Compact SUV Shines On The Road? Hyundai Creta 2024 Review: First Drive 2022 Mahindra Scorpio N First Drive: Perfect Middle Ground? Trending Mahindra Cars Mahindra Thar Rs. 11.50 Lakh Mahindra Scorpio N Rs. 13.99 Lakh Mahindra XUV700 Rs. 14.49 Lakh Mahindra Bolero Rs. 9.70 Lakh Mahindra Scorpio Rs. 13.77 Lakh All Mahindra Cars Trending SUV Cars Defender Rs. 1.05\", 'images': [{'url': 'https://media.zigcdn.com/media/content/2023/Dec/6581758c9390a.jpg?tr=w-420', 'alt_text': 'Upcoming Mahindra Cars In 2024', 'title': 'Upcoming Mahindra Cars In 2024', 'class': 'i-amphtml-fill-content i-amphtml-replaced-content', 'loading': 'lazy', 'confidence': 0.8999999999999999}], 'rank': 4}, {'url': 'https://www.rushlane.com/new-mahindra-suv-launches-planned-for-2024-12483885.html', 'content': 'New Mahindra SUV Launches Planned For 2024 - RushLane Facebook Instagram Linkedin Mail Twitter Youtube Car News Bike News EV News CV News Spy Shots Scoops Reviews Search RUSHLANE DAILY AUTO NEWS RUSHLANE DAILY AUTO NEWS RUSHLANE DAILY AUTO NEWS Whatsapp Group Telegram About Us Tips Contact Us Car News Bike News EV News CV News Spy Shots Scoops Reviews Search RUSHLANE DAILY AUTO NEWS Car News Bike News EV News CV News Spy Shots Scoops Reviews SEARCH Home Car News New Mahindra SUV Launches Planned For 2024 New Mahindra SUV Launches Planned For 2024 Pearl Daniels December 25, 2023 New Mahindra Thar 5D Mahindra XUV400 EV, XUV300 Facelift, XUV700 EV, XUV300 EV, Thar 5 Door and XUV.e8 are among the SUVs set to be launched next year Several automakers in India have plans to launch new cars in 2024. Mahindra, the largest SUV maker in India, could have an interesting lineup of 6 new SUVs all of which are slated for launch in 2024. Some are facelifts while there are also some that are being launched in the electric segment. We give details of each of these upcoming models, their estimated launch period and prices as per what is known as on date. 1. Mahindra XUV300 facelift In view of rising competition from the likes of Tata Nexon and Kia Sonet, the Mahindra XUV300 is also set to receive a facelift in early 2023. It has been seen with an all new front and rear with LED lighting and full-width LED light bar at the rear. Its cabin also gets an overhaul with a larger 10.25 inch touchscreen while it could also get a panoramic sunroof, new central console and redesigned panel for AC controls. It will see no change in its engine lineup and continue to draw power via a 1.5 liter diesel, 1.2 liter turbo petrol and 1.2 liter direct injection turbo petrol (TGDI) with transmission options to include new Aisin sourced 6 speed automatic and 6 speed manual. View this post on Instagram A post shared by RushLane (@rushlane) 2. Mahindra Thar 5-Door Mahindra Thar 5-door is also doing the test rounds ahead of launch in 2024. It however, may be called by another name as the company has trademarked 7 names associated with the upcoming Thar. The model on test sported some changes in design over its 3-door counterpart while it also rides on a longer wheelbase. These included a single-pane sunroof, roof mounted speakers, new front grille design, LED headlamps, revised bumper and new alloy wheels while it also gets an extra pair of doors. The interiors get a larger 10 inch touchscreen infotainment system, new steering wheel and heavily upholstered seating in the front. It will however see no change in its engine options and the Thar 5-door continues to draw power via a 2.0 liter petrol and 2.2 liter diesel engine mated to 6 speed manual and 6 speed automatic transmission options. Mahindra XUV700 Electric Spied 3. Mahindra XUV700 6-seater with captain seats The current Mahindra XUV700 is offered with 5 and 7 seater options. However, a leaked manual has shown off a 6 seater variant that is set to launch sometime in early 2024. This update will keep it abreast in competition with the Hyundai Alcazar and Tata Safari, both of which are available in 6 seater versions. The Mahindra XUV700 6 seater version with captain seats in second row will see a 60:40 split with folding arm rests and slide and recline function. Feature updates will also include auto dimming IRVMs with anti-glare auto adjustment function, wherein the reflection rate of inside mirrors can be adjusted via a switch. Apart from these two features, the Mahindra XUV700 sees no other changes or mechanical updates. It will continue to be powered by the same 2.0 liter turbo petrol and 2.2 liter turbo diesel engines mated to 6 speed manual and 6 speed automatic gearbox options. 4. Mahindra XUV300 EV Upcoming XUV300 EV will be positioned as an entry level electric SUV, will be in the sub 4 meter segment and will sit below the XUV400 in the company portfolio. In terms of features, it will see all the updates t', 'images': [{'url': 'https://www.rushlane.com/wp-content/uploads/2023/12/mahindra-thar-5-door-launch-price-spy-shots-600x338.jpg', 'alt_text': 'New Mahindra Thar 5D', 'width': '600', 'height': '338', 'class': 'size-medium wp-image-484152', 'confidence': 0.8999999999999999}, {'url': 'https://www.rushlane.com/wp-content/uploads/2022/09/mahindra-xuv700-electric-spied-bangalore-range-price-2-600x338.jpg', 'alt_text': 'Mahindra XUV700 Electric Spied', 'width': '600', 'height': '338', 'class': 'size-medium wp-image-449768', 'confidence': 0.8999999999999999}, {'url': 'https://www.rushlane.com/wp-content/uploads/2019/04/unnamed-1.png', 'alt_text': 'rushlane logo', 'title': 'rushlane logo', 'class': 'tdb-logo-img td-retina-data', 'confidence': 0.7}, {'url': 'https://www.rushlane.com/wp-content/uploads/2019/04/unnamed-1.png', 'alt_text': 'rushlane logo', 'title': 'rushlane logo', 'class': 'tdb-logo-img td-retina-data', 'confidence': 0.7}, {'url': 'https://www.rushlane.com/wp-content/uploads/2019/04/unnamed-1.png', 'alt_text': 'rushlane logo', 'title': 'rushlane logo', 'class': 'tdb-logo-img td-retina-data', 'confidence': 0.7}], 'rank': 5}, {'url': 'https://www.acko.com/car-guide/upcoming-mahindra-cars-in-india/', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://www.cardekho.com/india-car-news/all-major-car-launches-of-2024-in-india-33657.htm', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://www.v3cars.com/news/mahindra-upcoming-cars-suvs-and-evs-in-2024', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null,
            "_meta": null
          }
        ]
      },
      "error": null,
      "cost": 0.0,
      "start_time": "2025-07-17T15:13:15.473969",
      "end_time": "2025-07-17T15:13:51.473534",
      "execution_time": 35.999565,
      "input_tokens": 0,
      "output_tokens": 0,
      "execution_result": null
    },
    {
      "id": "T002",
      "description": "Analyze the retrieved data and recommend a suitable Mahindra vehicle based on recent launches and overall features and customer reviews.",
      "agent": "ThinkerAgent",
      "agent_prompt": "Analyze the information from the retriever agent on recent mahindra car launches and then recommend one vehicle based on the features, customer reviews and overall market assessment. Pick the latest one with good reviews and features.",
      "reads": [
        "T001"
      ],
      "writes": [
        "T002"
      ],
      "status": "failed",
      "output": null,
      "error": "503 UNAVAILABLE. {'error': {'code': 503, 'message': 'The model is overloaded. Please try again later.', 'status': 'UNAVAILABLE'}}",
      "cost": 0.0,
      "start_time": "2025-07-17T15:13:51.486542",
      "end_time": "2025-07-17T15:13:56.844908",
      "execution_time": 5.358366
    },
    {
      "id": "T003",
      "description": "Gather detailed information on the features, specifications, pricing and customer reviews of the recommended Mahindra vehicle.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Find detailed information on the features, specifications, pricing and customer reviews of the Mahindra vehicle recommended in T002.",
      "reads": [
        "T002"
      ],
      "writes": [
        "T003"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    },
    {
      "id": "T004",
      "description": "Present the gathered information about the recommended Mahindra vehicle in a well-structured and easily readable format for the user.",
      "agent": "FormatterAgent",
      "agent_prompt": "Format the gathered information about the recommended Mahindra vehicle (from T003) into a user-friendly report. Include details about its features, specifications, pricing, and customer reviews. Create a concise and informative summary.",
      "reads": [
        "T003"
      ],
      "writes": [
        "T004"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    }
  ],
  "links": [
    {
      "source": "ROOT",
      "target": "T001"
    },
    {
      "source": "T001",
      "target": "T002"
    },
    {
      "source": "T002",
      "target": "T003"
    },
    {
      "source": "T003",
      "target": "T004"
    }
  ]
}