{
  "directed": true,
  "multigraph": false,
  "graph": {
    "session_id": "52764595",
    "original_query": "I want to buy a Mahindra Car, help me understand what are the recent launches, recommend a latest vehichle. I want to know the details on the features for your recommended vehicle.",
    "file_manifest": [],
    "created_at": "2025-07-17T15:03:15.103418",
    "status": "running",
    "output_chain": {
      "T001": {
        "mahindra_launches": [
          {
            "type": "text",
            "text": "[{'url': 'https://www.zigwheels.com/news-features/general-news/4-upcoming-mahindra-cars-worth-keeping-an-eye-on-in-2024/51747/?is_amp=1&onlyStory=6', 'content': \"Mahindra Upcoming Car Launches In 2024: Thar 5-Door, XUV300 Facelift, XUV.e8, XUV400 Facelift - ZigWheels News & Reviews New Cars New Bikes Scooters Auto Expo 2025 Electric Vehicles Used Cars Home News 4 Upcoming Mahindra Cars Worth Keeping An Eye On In 2024 Overview Price Variants Mileage Specs Colours Images Videos UserReviews ExpertReviews Q&A News FAQs SimilarCars 360View Thar5DoorCommunity Dealers Services Brochures Thar5DoorEMI Loans Thar5DoorInsurance 4 Upcoming Mahindra Cars Worth Keeping An Eye On In 2024 Dec 20, 2023 | Views: 6119 | 2 min read By Sumit Khanchandani 2024 will finally be the year when we witness the launch of the larger version of Mahindra's capable off-roader The upcoming year for Mahindra looks exciting, with the launch of the larger version of its capable off-roader and the introduction of the electric version of their popular mid-size SUV, along with the release of a couple of facelifts. These are the upcoming launches from Mahindra in 2024 that you should look out for Mahindra Thar 5-Door Mahindra is set to launch the highly anticipated 5-door version of the Thar next year. With a larger footprint than the 3-door model, it will boast additional features such as a bigger infotainment system and a sunroof. The Thar 5-door will be offered with both petrol and diesel engine options and is expected to be available in 4-wheel-drive (4WD) and rear-wheel-drive (RWD) configurations. Expected Price : Rs 15 lakh Expected Launch : March 2024 Mahindra XUV300 Facelift Mahindras sub-4m SUV, the XUV300 , is due for a significant refresh in 2024. It will feature exterior design changes, along with a redesigned cabin. Mahindra may also equip the facelifted XUV300 with ADAS, while offering it in both petrol and diesel engine options. Expected Price : Rs 9 lakh Expected Launch : March 2024 Mahindra XUV.e8 In 2024, we may also see the launch of the all-electric version of the XUV700 , the XUV.e8 . The electric SUV is expected to be offered with two battery pack options, ranging from 60 kWh to 80 kWh, along with the availability of a dual-motor all-wheel drivetrain . We expect the XUV.e8 to have a range of around 450 km. Expected Price : Rs 35 lakh Expected Launch : End of 2024 Mahindra XUV400 Facelift Recent spy images of the updated XUV400 suggest its potential launch in 2024. We expect the updated EV to showcase design updates reminiscent of the facelifted XUV300 with similar features. With the facelift, the XUV400 is expected to come with an improved range while retaining its existing 34.5 kWh and 39.4 kWh battery pack options that could offer better range. Expected Price : Rs 16 lakh Expected Launch : Second half of 2024 This wraps up the upcoming launches from Mahindra in 2024. Let us know in the comments which car you are most excited about. Mahindra Thar 5-Door Video Review Add Your Comment Mahindra Thar ROXX 4.4/5 39 reviews Rs. 12.99 Lakh View July Offers Latest News Range Rover Velar Autobiography Launched At Rs 89.9 Lakh, Heres Everything You Need To Know BMW 2 Series Gran Coupe Launched In India At Rs 46.9 Lakh 6 Airbags Now Offered As Standard With The Maruti Baleno And Ertiga! Prices Hiked By Heres How You Book A Tesla Model Y In India! View All Latest News Popular News Teslas Grand India Debut: Model Y Hits Roads At Rs 59.89 Lakh! Mahindra XUV 3XO Gets A New REVX Variant Lineup, Makes A Crowd-favourite Feature More Accessible! EXCLUSIVE: Kia Carens Clavis EV To Be A 7-Seater Only? Here's What We Know! Mahindra XEV 9e And BE 6 Now Get A Bigger Battery In Pack Two Variant! View All Similar Cars Review 2024 Hyundai Creta Facelift vs Rivals: Which Compact SUV Shines On The Road? Hyundai Creta 2024 Review: First Drive 2022 Mahindra Scorpio N First Drive: Perfect Middle Ground? Trending Mahindra Cars Mahindra Thar Rs. 11.50 Lakh Mahindra Scorpio N Rs. 13.99 Lakh Mahindra XUV700 Rs. 14.49 Lakh Mahindra Bolero Rs. 9.70 Lakh Mahindra Scorpio Rs. 13.77 Lakh All Mahindra Cars Trending SUV Cars Defender Rs. 1.05\", 'images': [{'url': 'https://media.zigcdn.com/media/content/2023/Dec/6581758c9390a.jpg?tr=w-420', 'alt_text': 'Upcoming Mahindra Cars In 2024', 'title': 'Upcoming Mahindra Cars In 2024', 'class': 'i-amphtml-fill-content i-amphtml-replaced-content', 'loading': 'lazy', 'confidence': 0.8999999999999999}], 'rank': 1}, {'url': 'https://www.acko.com/car-guide/upcoming-mahindra-cars-in-india/', 'content': \"Upcoming Mahindra Cars in India: Expected Launch Date and Price Products Products Insurance made easy: tailor your coverage to fit your needs GET COVERED FOR Health Health Insurance Family Health Insurance Plan 1 Crore Health Insurance Individual Health Insurance Senior Citizen Health Insurance Parents Health Insurance Arogya Sanjeevani Health Insurance Cashless Health Insurance Car Car insurance Comprehensive car insurance Third party car insurance Own damage car insurance Zero depreciation car insurance Electric car insurance Used car insurance Commercial car insurance Bike Bike insurance Scooter insurance Brand new bike insurance Comprehensive bike insurance Third party bike insurance Electric bike insurance Used bike insurance Life Life Insurance Term Insurance Acko Flexi Life Plan Critical Illness Insurance Life Insurance Accidental Death Benefit Rider Disability Income Rider Life Insurance Riders in India Travel Travel insurance International travel insurance Corporate coverage Group health insurance Corporate health insurance Enterprise Renewals Renewals Dont risk it, renew your insurance and stay protected RENEW INSURANCE Health EXISTING ACKO CUSTOMER Login and renew policy SWITCH TO ACKO Renew health insurance Car EXISTING ACKO CUSTOMER Login and renew policy SWITCH TO ACKO Renew car insurance Bike EXISTING ACKO CUSTOMER Login and renew policy SWITCH TO ACKO Renew bike insurance Life SWITCH TO ACKO Renew life insurance Claims Claims Your peace of mind is our top priority - file a claim today FILE OR TRACK CLAIM Health File a new claim Track existing claim How ACKO claim works NEED HELP? Contact us at 1800-266-2256 Car File a new claim Track existing claim How ACKO claim works NEED HELP? Contact us at 1800-266-2256 Bike File a new claim Track existing claim How ACKO claim works NEED HELP? Contact us at 1800-266-2256 Life How life insurance claim works NEED HELP? Contact us at 1800 210 1992 Resources Resources Explore the full ACKO experience and make the most of your plan EXPLORE Articles Guides Ebooks HELP CENTER FAQs FAQs All products Life insurance Support ALL PRODUCTS 1800 266 2256 [emailprotected] LIFE INSURANCE 1800 210 1992 [emailprotected] Enterprise Enterprise Covering Businesses, Employees, Gig Workers & FinTech Log in Sign Up Home / Car Insurance / Articles / Upcoming Mahindra Cars in India 2022-2025 Upcoming Mahindra Cars in India 2022-2025 Team Acko Jan 23, 2025 Share Post The eagerness of a car enthusiast waiting for the launch of an upcoming car is unparalleled. Well, we come bearing glad tidings for all you car fanatics. The upcoming car segment from Mahindra includes revamped versions of its previous SUV models. They promise a power-packed road performance and come with new and improved tech. Safety is the top-most priority at Mahindra, and the company outdoes it with its cars lined up for launch in the coming years. With futuristic tech, power-packed engines, and a sleek and elegant body, Mahindra promises its customers the four-wheel drive of their lives. Here's a list of upcoming Mahindra cars in India that will sweep you off your feet with their innovative specifications. Contents Top Upcoming Mahindra Cars in India 1. Mahindra Bolero Neo Plus (Expected launch date: December 2022) 2. Mahindra XUV400 EV (Expected launch date: January 2023) 3. Mahindra New XUV500 (Expected launch date: July 2024) 4. Mahindra eKUV100 (Expected launch date: January 2023) 5. Mahindra 5-door Thar (Expected launch date: June 2023) 6. Mahindra Bolero (Expected launch date: November 2024) 7. Mahindra XUV900 (Expected launch date: Early 2024) The Need for a Car Inurance Policy Things to remember Frequently Asked Questions Top Upcoming Mahindra Cars in India Model Launch Date Expected Price Mahindra Bolero Neo Plus December 2022 12.5 Lakhs Mahindra XUV400 January 2023 17 Lakhs Mahindra New XUV500 July 2024 12-17 Lakhs Mahindra eKUV100 March 2023 10 Lakhs Mahindra 5-door Thar January 2023 15 Lakhs Mahindra Bolero 2024 November\", 'images': [{'url': 'https://acko-cms.ackoassets.com/Article_Pages_Mobile_Image_f49b40c978.png', 'alt_text': 'Article Pages Mobile Image', 'class': 'sc-bnXvFD kFGmOS', 'confidence': 0.7}], 'rank': 2}, {'url': 'https://www.indiacarnews.com/news/upcoming-mahindra-cars-20433/', 'content': 'New Upcoming Mahindra Cars In India In 2023, 2024 & 2025 News Reviews Comparisons Two Wheelers Web Stories About Us Contact Us Search India Car News Know everything about new and upcoming cars and bikes in India Facebook Twitter Thursday, July 17, 2025 Facebook Twitter Youtube India Car News Know everything about new and upcoming cars and bikes in India News Reviews Comparisons Two Wheelers Web Stories About Us Contact Us Search April 18, 2023 Upcoming Mahindra Cars in India in the Next Two Years Facebook Twitter Pinterest WhatsApp Famous for its utility and sports utility vehicles, the homegrown auto major, Mahindra ruled the segment for long. However, it is facing tough competition from the likes of Maruti Suzuki, Hyundai and Tata Motors in the UV space. Determined to regain lost ground in the segment, Mahindra had introduced multiple new SUVs including the new Thar, XUV700 and the Scorpio-N. In order to further strengthen its position in the UV segment, Mahindra plans to launch a range of new SUVs in the next 2-3 years. Heres a look at all upcoming Mahindra cars in India in 2023, 2024 and 2025. ads Upcoming Mahindra Cars in 2023, 2024, 2025 1. Mahindra Bolero Neo Plus Mahindra is all set to introduce the extended version of the Bolero Neo in the country. Called the Bolero Neo Plus, the SUV is likely to be offered with two seating configurations 7 and 9-seats. It will also be offered with an ambulance variant with 4-seats layout and a patient bed. In terms of proportions, the SUV is 4400mm long, 1795mm wide and 1812mm tall, and has a wheelbase of 2680mm. The new model looks largely identical to the Bolero Neo; however, it received some changes to keep things fresh. Instead of a blacked-out C-pillar, it has body-coloured pillars. It gets new rear bumper and smaller reflector panels, a tailgate-mounted spare tyre with badging and extended rear door. The SUV will be powered by a 2.2L mHawk diesel engine with a 6-speed manual gearbox. This powertrain produces 130PS and 300Nm of torque. 2. 5-door Mahindra Thar The next model in our list of upcoming Mahindra cars is the 5-door or long wheelbase version of the Mahindra Thar. It is expected to be launched by the end of 2023 or early 2024. The 5-door Mahindra Thar will have 300mm longer wheelbase than its 3-door model. It is expected to be based on the new Scorpio-Ns ladder-frame chassis with increased width between the wheelbase for bettery wheelbase-to-track ratio. The SUV will have an extra door for the middle row passengers. The cabin layout will be similar to the existing model and will have a three seat bench layout in the middle row and provide bigger boot space. The SUV is expected to share its powertrains with the Scorpio N. It will be offered with a 200bhp, 2.0L turbo petrol and a 172bhp, 2.2L turbo diesel engine. It can be had with either a manual or an automatic gearbox. 3. New-gen Mahindra Bolero Mahindra will launch the next gen Bolero in our market in 2024. The SUV enjoys huge popularity among buyers in rural and semi-urban markets. It is reportedly to be based on the new ladder-frame chassis that underpins the Thar and the Scorpio-N. The new model is likely to retain the original look; however, it will come with several new design elements and body panels. The cabin will receive maximum changes with better fit & finish levels and material quality. It could also get some modern day features like a touchscreen infotainment system, a multi-functional steering wheel, height adjustable drivers seat and automatic AC. The SUV is likely to feature a 2.2L mHawk diesel and a 2.0L turbo petrol engine along with manual and automatic gearbox options. 4. New Mahindra XUV500 Mahindra had replaced the XUV500 SUV with an all-new XUV700 that is offered in 5-and 7-seat options. The homegrown UV maker has confirmed that the XUV500 nameplate will return and will come with significant changes. It will be significantly smaller than the previous model. If reports are to be believed, the new', 'images': [{'url': 'https://www.indiacarnews.com/wp-content/uploads/2023/02/Mahindra-BE.07.jpg', 'alt_text': 'Mahindra BE.07', 'title': 'Mahindra BE.07', 'width': '1068', 'height': '711', 'class': 'entry-thumb', 'confidence': 0.8999999999999999}, {'url': 'https://www.indiacarnews.com/wp-content/uploads/2023/02/mahindra-bolero-neo-plus-7-seater.jpg', 'alt_text': 'Mahindra bolero neo plus 7 seater', 'width': '1200', 'height': '800', 'class': 'wp-image-56702', 'confidence': 0.8999999999999999}, {'url': 'https://www.indiacarnews.com/wp-content/uploads/2022/12/5-Door-Mahindra-Thar-Launch.jpg', 'alt_text': '5-Door Mahindra Thar Launch', 'width': '1200', 'height': '800', 'class': 'wp-image-55097', 'confidence': 0.8999999999999999}, {'url': 'https://www.indiacarnews.com/wp-content/uploads/2023/03/Mahindra-Bolero-Diesel.jpg', 'alt_text': 'Mahindra Bolero Diesel', 'width': '1200', 'height': '675', 'class': 'wp-image-56877', 'confidence': 0.8999999999999999}, {'url': 'https://www.indiacarnews.com/wp-content/uploads/2021/05/Mahindra-Design-Sketch-1.jpg', 'alt_text': 'Mahindra Design Sketch (1)', 'width': '1201', 'height': '800', 'class': 'wp-image-46382', 'loading': 'lazy', 'confidence': 0.8999999999999999}], 'rank': 3}, {'url': 'https://www.spinny.com/blog/upcoming-mahindra-cars-in-india/', 'content': 'Upcoming Mahindra Cars in India 2023-2024 - Spinny Skip to content HOME NEWS RULES & REGULATIONS BEST CARS BUYING A CAR GUIDES CAR COMPARISONS CAR REVIEWS LOANS DOCUMENTS CAR OWNERSHIP CAR CARE INSURANCE SELL YOUR CAR BUY ASSURED CARS Used Cars in Delhi NCR Used Cars in Delhi Used Cars in Gurgaon Used Cars in Noida Used Cars in Bangalore Used Cars in Hyderabad Used Cars in Mumbai Used Cars in Pune Used Cars in Chennai Used Cars in Ahmedabad Used Cars in Kolkata Spinny Car Hubs Search NEWS BEST CARS BUYING A CAR CAR OWNERSHIP SELLING A CAR RULES & REGULATIONS NEWS BEST CARS BUYING A CAR CAR OWNERSHIP SELLING A CAR RULES & REGULATIONS Home NEWS 8 Upcoming Mahindra cars to keep on your radar Yaajyaansh Bhardwaj Last updated 5 months ago 2022 was an eventful year for Mahindra. Their highly anticipated XUV700 finally started hitting the streets, the Scorpio-N and the Scorpio Classic received favourable reviews from critics and die-hard enthusiasts, and the Bolero Neo had an impressive run in the market. To continue this momentum into the next year, the company recently revealed plans for their upcoming cars which include quite a few electric vehicles as well. Lets look at a few of the upcoming Mahindra cars ready for launch in 2023-24 which include an upcoming Mahindra SUV, and 4 upcoming Mahindra EVs. Also Read Upcoming Maruti Suzuki Cars Table of Contents Upcoming Mahindra Cars 2023 Upcoming Mahindra SUV: Mahindra Thar 5-door Upcoming Mahindra EV: Mahindra XUV400 Upcoming Mahindra electric compact SUV: Mahindra eKUV100 Upcoming Mahindra electric SUVs 2024 Mahindra XUVe8 Mahindra XUVe9 Mahindra BE electric SUVs Summary FAQs Upcoming Mahindra Cars 2023 Upcoming Mahindra SUV: Mahindra Thar 5-door A perfect choice for those who always wanted the current Thar but didnt buy it, as it doesnt quite come across as a family car to most. The 5-door Thar may become the most popular upcoming Mahindra SUV, and we might get to see a repeat of what happened when the new generation of the Thar was launched. While the name might be a placeholder, the 5-door version of the popular off-roader has surfaced quite a lot under camouflage in India. From the spy shots, it retains the frontal design aspects of the current Thar. It is expected that this car will be offered with the same engine options i.e., a 2L turbo-petrol engine and a 2.2L mHawk diesel engine capable of churning out 147 bhp and 300 Nm of torque, and 128 bhp and 300 Nm of torque respectively. It will also receive the current six-speed automatic and manual transmission modes. The expected cost is Rs 15 lakh to Rs 16 lakh meaning it still falls in almost the same price bracket. See Used Mahindra SUVs Also Read Upcoming Toyota Cars In India Upcoming Mahindra EV: Mahindra XUV400 This upcoming Mahindra EV is essentially the electric version of the XUV300 and is based on a tweaked platform of the XUV300. It has a 40kWh battery pack producing 147 bhp and 310 Nm of torque. It also gets 3 driving modes: Fun, Fast, and Fearless. Mahindra claims a 0-100km/h time of 8.3 seconds, which is quicker than the Nexon. Talking about range, it gets an ARAI-certified range of 456km which might translate to 350km in the real world. The charging time is 0-80% via a fast charger in just 50 minutes, or 6 hours 30 minutes for 0-100% depending on the type of fast charger, and 13 hours while using a regular charger. The interior will be almost identical to the XUV300 with the same dashboard layout including a 7-inch infotainment screen and an instrument cluster, along with an all-black interior. Talking about the changes, in place of the gear shifter there will be a gear selector that looks extremely futuristic. The XUV400 will compete against the B and C-segment SUVs which means its direct competitors are the Tata Nexon and the MG ZS EV. The expected cost is in the range of Rs 17 lakh to Rs 22 lakh, which is in the Nexon EV ballpark. Mahindra has confirmed that the XUV400 bookings start from January of 2023 Al', 'images': [{'url': 'https://www.spinny.com/blog/wp-content/uploads/2025/01/Tata-Harrier-EV-Stealth-edition-800x450.webp', 'alt_text': 'Tata Harrier EV Stealth edition', 'width': '800', 'height': '450', 'class': 'attachment-medium size-medium wp-image-520802 not-transparent', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://www.spinny.com/blog/wp-content/uploads/2025/01/Tata-Harrier-EV-Stealth-edition-800x450.webp', 'alt_text': 'Tata Harrier EV Stealth edition', 'width': '800', 'height': '450', 'class': 'attachment-medium size-medium wp-image-520802 not-transparent', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://www.spinny.com/blog/wp-content/uploads/2024/10/Spinny-2024-Hyundai-Creta-800x450.webp', 'alt_text': 'Hyundai Creta', 'width': '800', 'height': '450', 'class': 'attachment-medium size-medium wp-image-519796 not-transparent', 'loading': 'lazy', 'confidence': 0.8999999999999999}], 'rank': 4}, {'url': 'https://www.financialexpress.com/auto/car-news/top-5-upcoming-mahindra-vehicle-launches/2991432/', 'content': 'Top 5 upcoming Mahindra vehicle launches - Car News | The Financial Express FE AUTO NEWS CAR NEWS BIKE NEWS New Cars New Cars Best Cars REVIEWS PHOTOS VIDEOS WEB STORIES EV FE AUTO NEWS CAR NEWS BIKE NEWS New Cars New Cars Best Cars REVIEWS PHOTOS VIDEOS WEB STORIES EV Auto Car News Top 5 upcoming Mahindra vehicle launches Top 5 upcoming Mahindra vehicle launches Upcoming Mahindra launches in 2023 and 2024. Here are the top five Mahindra SUV and electric vehicle launches expected in India. Written by Rajkamal Narayanan February 24, 2023 11:55 IST Follow Us Mahindra has been on a spree of launching new vehicles such as the XUV700 , the new Scorpio -N, the all-electric XUV400, and the rear-wheel-drive Thar. The carmakers not done just yet, as there are more launches to expect from Mahindra. The company has plans to launch SUVs, cars, and electric vehicles in India. Here are the top 5 upcoming Mahindra vehicles, including new SUVs, electric vehicles, and cars. Mahindra Thar 5-door The Mahindra Thar has seen a fair bit of success in India since its launch as its a huge leap over the older-gen vehicle. To make the Thar lineup more practical, the carmaker has plans to launch a long-wheelbase version of the SUV, which will have five doors. The Mahindra Thar 5-door version has been spied numerous times while testing and is expected to launch this year. The 5-door Thar could carry over the same 2.2-litre diesel and 2.0-litre petrol engines, along with manual and automatic gearbox options. Similar to the current-gen Thar, the 5-door version could be offered in 4X2 and 4X4 trims. Mahindra Bolero Neo Plus Image credit: Rushlane Next on the cards is again a long-wheelbase version of an SUV currently on sale the Mahindra Bolero Neo. To be called the Bolero Neo Plus, the SUV is based on the Mahindra TUV300 Plus that was discontinued in India. The Mahindra Bolero Neo Plus has been spotted testing in India, and when launched later this year, it will be offered with different seating configurations and could be powered by a 2.2-litre diesel engine making 120bhp. Mahindra e20 NXT Mahindras first-ever electric car, the e20 is due for an update as the EV market is picking up pace. The e20 was showcased earlier with new updates, however, there has been no word from Mahindra about its launch, and looking at Tatas Tiago EV racking up numbers, Mahindra could think of a similar strategy. Also Read Tata Tiago EV launched in India at Rs 8.49 lakh Mahindra eKUV100 The KUV100 is a strong contender to be electrified, as this makes a practical vehicle for city use. Mahindra could rename the vehicle altogether, however, it will borrow most of its design elements from the KUV100. If Mahindra manages to price it right, the eKUV100 could be a strong competitor to the Tata Tiago EV. Also Read Four upcoming Maruti Suzuki cars and SUVs in 2023 Mahindra XUV500 This may get fans excited, as Mahindra confirmed that the XUV500 will be making a comeback, either late this year or early next year. The Mahindra XUV500 will see significant design updates compared to its older-gen model, while it will sit between the XUV300 and the XUV700 in Mahindras lineup. The new Mahindra XUV500 is expected to carry forward the same engine from the XUV700, but in a detuned state to make less power. Also, when launched, the XUV500 is expected to feature ADAS tech along with a host of other interior upgrades. Discover the latest in the auto world with new cars and new bikes , explore upcoming cars in India, and find your perfect match with cars under 5 lakh , 10 lakh or 15 lakh. Stay updated with the latest auto news and the rise of electric vehicles. This article was first uploaded on February twenty-four, twenty twenty-three, at fifty-five minutes past eleven in the morning. Latest Auto News Drive Safer, Drive Smarter: The updated Toyota Glanza raises the bar India-bound Renault Boreal unveiled: All you need to know Hero Vida VX2 first ride review The versatile family scooter Mahindra', 'images': [{'url': 'https://www.financialexpress.com/wp-content/themes/ie-network-theme/assets/src/img/default-ie.jpg', 'alt_text': 'Toyota Glanza 2025, Glanza Prestige Edition, Toyota Glanza six airbags, Toyota Glanza safety features, Glanza new variant 2025, Glanza vs Baleno, Glanza fuel efficiency, Toyota Glanza engine specs, Toyota Glanza price in India, Toyota Glanza mileage, Glanza CNG variant, Toyota Glanza features, Toyota Glanza HUD, Toyota Glanza connected features, Toyota Glanza updates, Toyota hatchback India, Glanza vs i20 vs Altroz, Premium hatchback India 2025, Glanza accessories Prestige Edition, Toyota Glanza maintenance warranty', 'width': '310', 'height': '174', 'class': 'attachment-newspack-article-block-landscape-medium size-newspack-article-block-landscape-medium wp-post-image lazyloading', 'loading': 'lazy', 'confidence': 1.0}, {'url': 'https://www.financialexpress.com/wp-content/themes/ie-network-theme/assets/src/img/default-ie.jpg', 'alt_text': 'Renault Boreal India, 7-seater SUV 2026, Renault Boreal specifications, Renault Boreal design, Renault Boreal safety features, Renault Boreal engine, Renault Boreal launch date, Renault Duster 7-seater, Renault Boreal price India, Renault Boreal ADAS', 'width': '310', 'height': '174', 'class': 'attachment-newspack-article-block-landscape-medium size-newspack-article-block-landscape-medium wp-post-image lazyloading', 'loading': 'lazy', 'confidence': 1.0}, {'url': 'https://www.financialexpress.com/wp-content/themes/ie-network-theme/assets/src/img/default-ie.jpg', 'alt_text': 'Mahindra XUV 3XO, RevX lineup, sub-4-metre SUV, price, features, petrol engine, panoramic sunroof, ADAS, Maruti Suzuki Brezza, Tata Nexon', 'width': '310', 'height': '174', 'class': 'attachment-newspack-article-block-landscape-medium size-newspack-article-block-landscape-medium wp-post-image lazyloading', 'loading': 'lazy', 'confidence': 1.0}, {'url': 'https://www.financialexpress.com/wp-content/themes/ie-network-theme/assets/src/img/default-ie.jpg', 'alt_text': 'Road trip: Chennai to Mahabalipuram; Where timeless history meets the endless sea', 'width': '310', 'height': '174', 'class': 'attachment-newspack-article-block-landscape-medium size-newspack-article-block-landscape-medium wp-post-image lazyloading', 'loading': 'lazy', 'confidence': 1.0}, {'url': 'https://www.financialexpress.com/wp-content/themes/ie-network-theme/assets/src/img/default-ie.jpg', 'alt_text': 'Luxury car sales in the slow lane in H1', 'width': '310', 'height': '174', 'class': 'attachment-newspack-article-block-landscape-medium size-newspack-article-block-landscape-medium wp-post-image lazyloading', 'loading': 'lazy', 'confidence': 1.0}], 'rank': 5}, {'url': 'https://motoroctane.com/news/230167-upcoming-mahindra-cars-for-2023-24', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://www.v3cars.com/news/mahindra-upcoming-cars-suvs-and-evs-in-2024', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://teamcardelight.com/mahindras-4-new-launches-in-2024-all-the-details/', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null,
            "_meta": null
          }
        ]
      },
      "T002": {
        "output": {
          "initial_thoughts": {
            "entity_1": "Let me think through this: Several Mahindra models are slated for launch or facelift in 2024, including the Thar 5-Door, XUV300 Facelift, XUV.e8 (electric XUV700), and XUV400 Facelift. I need to consider the user's needs regarding fuel efficiency, safety, technology, and value to determine the best recommendation.",
            "entity_2": "Let me think through this: The Mahindra Thar 5-Door offers a more practical version of the popular off-roader, appealing to those seeking adventure with added family-friendliness. The XUV300 Facelift focuses on design updates and potential ADAS features, enhancing safety and aesthetics. The XUV.e8 represents Mahindra's electric SUV ambition, offering a substantial range and all-wheel-drive capability. The XUV400 Facelift aims to improve range and design based on the XUV300.",
            "overall_observations": "Let me think through this: Given the variety of options, a specific recommendation depends on the user's priorities. If practicality and off-road capability are paramount, the Thar 5-Door is a good choice. For safety and updated design in a compact SUV, the XUV300 Facelift is suitable. The XUV.e8 caters to those seeking an electric SUV with extended range, while the XUV400 Facelift provides an updated EV option."
          },
          "review_checklist": {
            "alignment_with_goal": "Let me think through this: I have addressed the user's request to identify recent Mahindra launches and recommend a suitable vehicle. However, a more specific recommendation requires understanding the user's particular needs and preferences, beyond the general factors mentioned.",
            "what_was_missed": "Let me think through this: I haven't considered the user's budget, intended use (city driving vs. highway, family car vs. individual use), and preference for petrol, diesel, or electric vehicles. These factors are crucial for a tailored recommendation.",
            "risk_of_misleading": "Let me think through this: Recommending a vehicle without considering the user's budget and specific needs could lead to dissatisfaction. For instance, the XUV.e8 might be an excellent electric SUV, but its expected price may be out of reach for some users.",
            "improvement_opportunities": "Let me think through this: The recommendation can be improved by explicitly stating the assumptions made and suggesting further questions to narrow down the user's requirements. I can also provide a comparative table of the key features and specifications of each model to aid the user's decision-making process."
          },
          "final_report": {
            "summary": "Based on recent Mahindra launches, the Thar 5-Door, XUV300 Facelift, XUV.e8, and XUV400 Facelift are potential options. The best choice depends on individual priorities, such as off-road capability, safety, electric range, and budget. More information is needed to make a specific recommendation.",
            "detailed": "Let me think through this:\n\n**Introduction**\n\nThis report analyzes recent and upcoming Mahindra car launches in 2024 to provide a recommendation for a user seeking to purchase a new car. The analysis considers factors such as fuel efficiency, safety features, technology, and overall value. However, given the broad nature of the request, the recommendation is contingent on further information regarding the user's specific needs, budget, and preferences.\n\n**Overview of Mahindra Launches in 2024**\n\nBased on available information, Mahindra is expected to launch or facelift several models in 2024:\n\n*   **Mahindra Thar 5-Door:** A more practical version of the popular off-road vehicle with a larger footprint, additional features, and both petrol and diesel engine options.\n*   **Mahindra XUV300 Facelift:** A refreshed version of the sub-4m SUV with exterior design changes, a redesigned cabin, and potential ADAS features.\n*   **Mahindra XUV.e8:** An all-electric version of the XUV700, offered with two battery pack options and a dual-motor all-wheel drivetrain.\n*   **Mahindra XUV400 Facelift:** An updated EV showcasing design updates reminiscent of the facelifted XUV300, with an improved range.\n\n**Comparative Analysis**\n\nTo facilitate a better understanding of the options, the following table provides a comparative overview of the key features and specifications of each model:\n\n| Feature                  | Mahindra Thar 5-Door              | Mahindra XUV300 Facelift           | Mahindra XUV.e8                    | Mahindra XUV400 Facelift            |\n| ------------------------ | ----------------------------------- | --------------------------------- | ---------------------------------- | ---------------------------------- |\n| Engine Options           | Petrol and Diesel                   | Petrol and Diesel                   | Electric                             | Electric                             |\n| Expected Price (Rs Lakh) | 15                                  | 9                                 | 35                                 | 16                                 |\n| Expected Launch          | March 2024                          | March 2024                          | End of 2024                        | Second half of 2024               |\n| Key Features             | Larger size, bigger infotainment, sunroof, 4WD/RWD configurations | Redesigned cabin, potential ADAS      | Dual-motor AWD, long range           | Improved range, design updates       |\n| Target Audience          | Off-road enthusiasts, families        | Compact SUV buyers, safety conscious | EV enthusiasts, long-range drivers | EV buyers, city drivers             |\n\n**Recommendation Justification**\n\nThe most suitable recommendation depends heavily on the user's specific requirements. Here's a breakdown of potential recommendations based on different priorities:\n\n*   **For off-road enthusiasts and those seeking adventure:** The Mahindra Thar 5-Door is an excellent choice. It offers the ruggedness and off-road capability of the Thar with added practicality and space. The availability of both petrol and diesel engines provides flexibility in terms of fuel preference.\n\n*   **For buyers seeking a safe and stylish compact SUV:** The Mahindra XUV300 Facelift is a compelling option. The refreshed design and potential ADAS features enhance both aesthetics and safety. The compact size makes it suitable for city driving.\n\n*   **For those prioritizing electric mobility and long-range driving:** The Mahindra XUV.e8 is a promising contender. With its extended range and all-wheel-drive capability, it offers a premium electric SUV experience.\n\n*   **For buyers looking for an updated and affordable EV:** The Mahindra XUV400 Facelift is a viable option. The design updates and improved range make it a more attractive EV choice.\n\n**Factors Not Considered**\n\nThe above recommendations are based on the limited information available. To provide a more tailored recommendation, it's crucial to consider the following factors:\n\n*   **Budget:** The user's budget will significantly narrow down the options. The XUV.e8, with its higher expected price, may not be suitable for all buyers.\n\n*   **Intended Use:** The intended use of the car (city driving vs. highway, family car vs. individual use) will influence the choice. For example, a family with young children might prioritize safety and space, while an individual might prioritize fuel efficiency and maneuverability.\n\n*   **Fuel Preference:** The user's preference for petrol, diesel, or electric vehicles will further refine the selection.\n\n**Further Questions for the User**\n\nTo provide a more specific and accurate recommendation, the following questions should be asked:\n\n1.  What is your budget for the new car?\n2.  What will be the primary use of the car (city driving, highway, off-roading, family trips)?\n3.  Do you have a preference for petrol, diesel, or electric vehicles?\n4.  What are your top priorities in a car (safety, fuel efficiency, performance, technology, comfort)?\n5.  How many passengers will the car typically need to accommodate?\n\n**Conclusion**\n\nMahindra's upcoming launches in 2024 offer a diverse range of options to suit different needs and preferences. By considering the factors mentioned above and gathering more information from the user, a more tailored and effective recommendation can be provided. Further research into real world reviews and comparisons once the vehicles are launched will also aid in the decision making process.",
            "tables": [],
            "recommendations": [
              "Gather more information from the user regarding their budget, intended use, fuel preference, and top priorities.",
              "Conduct further research into real-world reviews and comparisons once the vehicles are launched.",
              "Provide a more tailored recommendation based on the user's specific needs and preferences."
            ],
            "risks_or_warnings": [
              "Recommending a vehicle without considering the user's budget and specific needs could lead to dissatisfaction.",
              "The information provided is based on preliminary data and expected specifications. Actual features and performance may vary upon launch."
            ],
            "key_factors_considered": [
              "Fuel efficiency",
              "Safety features",
              "Technology",
              "Overall value",
              "Expected price",
              "Intended use"
            ],
            "task_completion_score": 0.85
          }
        },
        "call_self": false,
        "cost": 0.0022275,
        "input_tokens": 7218.0,
        "output_tokens": 1908.0,
        "total_tokens": 9126.0
      },
      "T003": {
        "Thar_5Door": [
          {
            "type": "text",
            "text": "[{'url': 'https://www.zigwheels.com/mahindra-cars/thar/specifications', 'content': 'Mahindra Thar Specifications - Features, Dimensions, Configurations 0 NEWS & REVIEWS NEW CARS NEW BIKES SCOOTERS MORE Used Cars Forum Home New Cars Mahindra Cars Thar Specifications Overview Price Variants Mileage Specs Colours Images Videos More Mahindra Thar Specifications Mahindra Thar is currently available in Petrol and Diesel engines. The 1997 cc Petrol engine generates a power of 150.19bhp@5000rpm and a torque of 300Nm@1250-3000rpm. The 2184 cc Diesel engine generates a power of 130.07bhp@3750rpm and a torque of 300Nm@1600-2800rpm. Mahindra Thar is available in both Manual & Automatic transmission. The claimed mileage of Thar is 11 kmpl. In configurations, Mahindra Thar has a dimensions of 3985 mm in length, 1820 mm in width and 1855 mm in height. Key Specs of Thar Emission Norm Compliance BS VI 2.0 Fuel Type Diesel Transmission Automatic Max Power 130.07bhp@3750rpm Max Torque 300Nm@1600-2800rpm Mileage 9 kmpl Engine Displ. 2184 cc Audio Control Yes Cruise Control Yes Global NCAP Safety Rating 4 Star Mahindra Thar Rs. 11.50 - 17.62 Lakh Check On Road Price 4.2/5 289 reviews Write a Review View July Offers Download Brochure All Specs & Features of Thar Petrol - 1997 cc Petrol AT - 1997 cc Diesel - 2184 cc Diesel AT - 2184 cc Diesel - 1497 cc Engine and Transmission Engine Type mStallion 150 TGDi Engine Displacement 1997 cc Max Power 150.19bhp@5000rpm Emission Norm Compliance BS VI 2.0 Max Torque 300Nm@1250-3000rpm No Of Cylinders 4 Transmission Manual Gearbox 6-Speed Valves Per Cylinder 4 Drive Type 4WD Turbo Charger Yes Performance and Fuel Economy Fuel Type Petrol Fuel Capacity 57 Liters Mileage (City) 8 kmpl Mileage (Highway) 10 kmpl Brakes, Steering, Suspension and Tyres Suspension Front 2 Suspension Rear 3 Brakes Front Disc Brakes Rear Drum Steering Type Hydraulic Tyre Size 255/65 R18 Tyre Type Tubeless All-Terrai Interior Dimensions Seating Capacity 4 Doors 3 Exterior Dimensions Length*Width*Height 3985*1820*1855 mm 3 Wheelbase 2450 mm Ground Clearance (Unladen) 226 mm Interior Additional Interior Features Dashboard Grab Handle For Front passenger,MID Display in Instrument Cluster (Coloured),Adventure Statistics,Decorative Vin Plate (Individual to Thar Earth Edition),Headrest (Embossed Dune Design),Stiching ( Beige Stitching elements & Earth branding),Thar branding on door pads (Desert Fury Coloured),Twin Peak logo on Steering ( Dark Chrome),Steering Wheel elements (Desert Fury Coloured),AC Vents (Dual Tone),HVAC housing (Piano black),Center gear Console & Cup Holder accents (Dark Chrome) Digital Cluster Yes Air Conditioner Yes Exterior Alloy Wheels Yes Additional Exterior Features Hard Top,All-Black Bumpers,Bonnet Latches,Wheel Arch Cladding,Side Foot Steps (Moulded),Fender-mounted Radio Antenna,Tailgate mounted Spare Wheel,Illuminated Key Ring,Body Colour (Satin Matte Desert Fury Colour),ORVMs Inserts (Desert Fury Coloured),Vertical slats on the Front grille (Desert Fury Coloured),Mahindra Wordmark (Matte Black),Thar branding (Matte Black),4x4 badging (Matte black With red accents),Automatic badging (Matte black With red accents),Gear Knob accents (Dark Chrome) Comfort and Convenience Connectivity Android Auto, Apple CarPlay No of Speakers 4 USB Charger Front Addtional Comfort Features Tip & Slide Mechanism in Co-Driver Seat,Reclining Mechanism,Lockable Glovebox,Electrically Operated HVAC Controls,SMS Read Out Lane Change Indicator Yes AC Yes Heater Yes Power Steering Yes Steering Column Tilt Steering Mounted Audio Control Yes Cruise Control Yes Adjustable Driver Seat Yes Height Adjustable Driver Seat Yes Folding Rear Seat 50:50 Split Multifunction Steering Wheel Yes Tachometer Yes Adjustable Headrest Yes Seat Belt Warning Yes AM/FM Radio Yes Touch-screen Display Yes Speakers Front Yes Speakers Rear Yes Follow me home headlamps Yes Adjustable Headlamps Yes Parking Sensors Rear Front Cupholders Yes Door Pockets Front Door 12V Power Outlets Yes Bottle Holder Front Door Heated Seats Rear Not Available in Thar', 'images': [{'url': 'https://media.zigcdn.com/media/model/2020/Aug/thar-3_195x130.jpg', 'alt_text': 'Photo of Mahindra Thar', 'title': 'Mahindra Thar Images', 'width': '195', 'height': '130', 'class': 'txt-c img-responsive c-p', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://images.zigcdn.com/images/spacer.png', 'alt_text': 'Hyundai Creta', 'title': 'Hyundai Creta', 'class': 'sl-img clr', 'confidence': 0.7}, {'url': 'https://images.zigcdn.com/images/spacer.png', 'alt_text': 'Mahindra Scorpio N', 'title': 'Mahindra Scorpio N', 'class': 'sl-img clr', 'confidence': 0.7}, {'url': 'https://images.zigcdn.com/images/spacer.png', 'alt_text': 'Mahindra XUV700', 'title': 'Mahindra XUV700', 'class': 'sl-img clr', 'confidence': 0.7}, {'url': 'https://images.zigcdn.com/images/spacer.png', 'alt_text': 'Mahindra Bolero', 'title': 'Mahindra Bolero', 'class': 'sl-img clr', 'confidence': 0.7}], 'rank': 1}, {'url': 'https://www.cars24.com/new-cars/mahindra/thar/specifications/', 'content': 'Mahindra Thar 2025 specifications, features and configurations New Cars Explore new cars Compare News All cars Upcoming cars Nissan brand store Popular brands Maruti Suzuki Hyundai Tata Mahindra Toyota Kia Honda Popular cars Hyundai Creta Mahindra Thar Tata Nexon Tata Punch Maruti Swift Kia Syros Skoda Kylaq Cars by body type Sedan SUV Hatchback MUV Cars by price range Under 5 Lakh Under 10 Lakh Under 15 Lakh Under 20 Lakh Explore new cars Compare News All cars Upcoming cars Nissan brand store Popular brands Maruti Suzuki Hyundai Tata Mahindra Toyota Kia Honda Popular cars Hyundai Creta Mahindra Thar Tata Nexon Tata Punch Maruti Swift Kia Syros Skoda Kylaq Cars by body type Sedan SUV Hatchback MUV Cars by price range Under 5 Lakh Under 10 Lakh Under 15 Lakh Under 20 Lakh Autoverse News Auto insider Reviews Auto discussions Car advice Articles News Auto insider Reviews Auto discussions Car advice Articles Buy used car Used cars in Delhi NCR Used cars in New Delhi Used cars in Mumbai Used cars in Bangalore Used cars in Hyderabad Used cars in Ahmedabad Used cars in Gurgaon Used cars in Chennai Used cars in Pune Used cars in Noida Used cars in Ghaziabad Used cars in Lucknow Used cars in Jaipur Used cars in Kolkata Used cars in Kochi Used cars in Indore Used cars in India Used cars in Delhi NCR Used cars in New Delhi Used cars in Mumbai Used cars in Bangalore Used cars in Hyderabad Used cars in Ahmedabad Used cars in Gurgaon Used cars in Chennai Used cars in Pune Used cars in Noida Used cars in Ghaziabad Used cars in Lucknow Used cars in Jaipur Used cars in Kolkata Used cars in Kochi Used cars in Indore Used cars in India Sell car Used Car Valuation Sell car In Delhi Sell car In Mumbai Sell car In Bangalore Sell car In Hyderabad Sell car In Ahmedabad Sell car In Gurgaon Sell car In Chennai Sell car In Pune Sell car In Noida Sell car In Ghaziabad Sell car In Lucknow Sell car In Jaipur Sell car In Kolkata Sell car In Kochi Sell car In Indore Sell car online Used Car Valuation Sell car In Delhi Sell car In Mumbai Sell car In Bangalore Sell car In Hyderabad Sell car In Ahmedabad Sell car In Gurgaon Sell car In Chennai Sell car In Pune Sell car In Noida Sell car In Ghaziabad Sell car In Lucknow Sell car In Jaipur Sell car In Kolkata Sell car In Kochi Sell car In Indore Sell car online Car finance Used car loan Used car loan eligibility Used car loan interest rates Used car EMI calculator Used car loan Used car loan eligibility Used car loan interest rates Used car EMI calculator Car services View & pay challan Car service history Car scrap Check vehicle details Pre delivery inspection Driving School View & pay challan Car service history Car scrap Check vehicle details Pre delivery inspection Driving School Login Login Auto News Personal loan Auto News Personal loan Mahindra Thar Price Specs Safety Rating Variants Colours Mileage User Review Gallery Compare Model Mahindra Thar Specifications Engine 1497 cc Mileage 15.0-15.2 km/l Safety 4 Ad Ad Key specifications Fuel Type Diesel, Petrol Transmission Manual, Automatic Seater 4 Change variant Thar AX Opt 4-Str Hard Top Diesel RWD 11.5 Lakh * Price 0 Fuel Type 0 Transmission 0 Engine Capacity 0 Tags 0 > Clear All Base Variant Thar AX Opt 4-Str Hard Top Diesel RWD 1497 cc Diesel 15.2 km/l Manual 11.5 Lakh* Thar LX 4-Str Hard Top Diesel RWD 1497 cc Diesel 15.2 km/l Manual 13.0 Lakh* Thar LX 4-Str Hard Top AT RWD 1497 cc Petrol 15.0 km/l Automatic 14.3 Lakh* Thar AX Opt 4-Str Convert Top 1997 cc Petrol 15.2 km/l Manual 14.5 Lakh* Thar AX Opt 4-Str Convert Top Diesel 2184 cc Diesel 15.2 km/l Manual 15.0 Lakh* Thar AX Opt 4-Str Hard Top Diesel 2184 cc Diesel 15.2 km/l Manual 15.2 Lakh* Thar LX 4-Str Hard Top 1997 cc Petrol 15.2 km/l Manual 15.2 Lakh* Thar Earth Edition 1997 cc Petrol 15.2 km/l Manual 15.4 Lakh* Thar LX 4-Str Convert Top Diesel 2184 cc Diesel 15.2 km/l Manual 15.9 Lakh* Thar LX 4-Str Hard Top Diesel 2184 cc Diesel 15.2 km/l Manual 15.9 Lakh* Thar E', 'images': [{'url': 'https://cdn.cars24.com/prod/new-car-cms/Mahindra/XUV-3XO/2024/04/30/a58a8d5b-e675-43c6-ba5d-e5a8dfa09dfd-3XO__1_.png', 'alt_text': 'XUV 3XO image', 'width': '329', 'height': '170', 'class': 'w-full h-full object-contain', 'loading': 'lazy', 'confidence': 0.9999999999999999}, {'url': 'https://cdn.cars24.com/prod/new-car-cms/Thar_Car_Image_f844855dfa.png', 'alt_text': 'Mahindra Thar Specifications', 'width': '405', 'height': '224', 'confidence': 0.8999999999999999}, {'url': 'https://cdn.cars24.com/prod/new-car-cms/Thar_Car_Image_f844855dfa.png', 'alt_text': 'Mahindra Thar Specifications', 'width': '650', 'height': '650', 'confidence': 0.8999999999999999}, {'url': 'https://i.ytimg.com/vi_webp/W_8BSSsbfj4/hqdefault.webp', 'alt_text': '2023 Mahindra Thar RWD 4X2 Walkaround And First Drive ImpressionsFrom Rs.9.99 Lakh..', 'width': '340', 'height': '200', 'class': 'w-full h-full object-cover', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://i.ytimg.com/vi_webp/pMT1vhTts_0/hqdefault.webp', 'alt_text': 'New Mahindra Thar - Forget Brezza, Venue, Nexon! Rs 9.99 lakhs onwards', 'width': '340', 'height': '200', 'class': 'w-full h-full object-cover', 'loading': 'lazy', 'confidence': 0.8999999999999999}], 'rank': 2}, {'url': 'https://auto.mahindra.com/suv/thar-roxx/TH5D.html', 'content': \"New Mahindra Thar ROXX SUV - Price, Specs & Colours | 5 door Skip to main content Skip to footer content SUVs THAR ROXX 12.99L - 23.39L Book Now Book Now Explore Explore XUV 3XO 7.99L - 15.79L Book Now Book Now Explore Explore SCORPIO-N 13.99L - 25.62L Book Now Book Now Explore Explore XUV700 14.49L - 25.14L Book Now Book Now Explore Explore THAR 11.50L - 17.62L Book Now Book Now Explore Explore SCORPIO CLASSIC 13.77L - 17.72L Book Now Book Now Explore Explore BOLERO NEO 9.97L - 12.18L Book Now Book Now Explore Explore BOLERO NEO PLUS 11.41L - 14.06L Explore Explore BOLERO 9.81L - 10.93L Book Now Book Now Explore Explore XUV400 17.49L Book Now Book Now Explore Explore MARAZZO 14.59L - 17.00L Book Now Book Now Explore Explore Explore All SUVs Explore All SUVs News Contact Us Menu Build your car Test Drive Buy Buy Book Now Exchange Finance Subscribe a Vehicle Owner's Zone Owner's Zone Owner's Action Owner's Action My Dashboard Service Cost Calculator Locate Service Center Renewals Renewals Roadside Assistance Owner's Manual Care & Maintenance Important Notifications Important Notifications Service Action Adventure Adventure Club Events Expeditions Off-Road Academy Gallery Locate a Dealer Global Markets Language News Contact us Switch theme Dark Light Home THAR ROXX Show more Show less Show more Show less Show more Show less Explore in 3D Explore in 3D Show more Show less Register for the latest news and exclusive updates. Stay informed Stay informed For any assistance call us on 1800 209 6006 1800 209 6006 Social links SUVs SUVs Explore All SUVs Thar Roxx Scorpio-N XUV700 XUV 3XO Thar XUV 400 Scorpio Classic Bolero Neo Bolero Bolero Neo Plus Marazzo PIK-UPs PIK-UPs Veero Maxx City Maxx HD Bolero Pik-up Bolero Camper ABOUT ABOUT About us Press Releases Stories Media kit Careers QMS Certificate OWNER OWNER Service Adventure Merchandise & Gear - Eshop Parts and accessories- Eshop Care & Maintenance Owners manual QMS Certificate customer service customer service Contact us FAQs Talk to an expert Dealer Locator Corporate Sales Enquiry Sitemap Sitemap QMS Certificate quick links quick links Vehicle configurator Test Drive Book Online Calculators Exchange Finance Scrappage Subscribe a vehicle Become a Dealer Download the M4U app now! Lets connect on Whatsapp Chat now Chat now Mahindra Corporate Terms & Conditions Our Privacy Policy Copyright 2025 Mahindra & Mahindra Ltd\", 'images': [{'url': 'https://auto.mahindra.com/dw/image/v2/BKRC_PRD/on/demandware.static/-/Sites-mahindra-product-catalog/default/dw95797f68/images/SCRC/large/ScorpioClassic_602x339.png?sw=360&sh=202', 'alt_text': 'SCORPIO CLASSIC', 'class': 'd-block img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://auto.mahindra.com/dw/image/v2/BKRC_PRD/on/demandware.static/-/Sites-mahindra-product-catalog/default/dwc6625064/images/NEOP/large/BoleroNeoPlus_602x339.png?sw=360&sh=202', 'alt_text': 'BOLERO NEO PLUS', 'class': 'd-block img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://auto.mahindra.com/on/demandware.static/Sites-amc-Site/-/default/dwbe1329bd/images/placeholder-image.png', 'alt_text': 'Thar ROXX Earn 5-Star Bharat-NCAP Rating', 'width': '1400px', 'height': '700px', 'class': 'ITC-image image-fluid common-image-component flexi-height', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://auto.mahindra.com/on/demandware.static/Sites-amc-Site/-/default/dwbe1329bd/images/placeholder-image.png', 'alt_text': 'Mahindra Thar Roxx', 'width': '1400px', 'height': '700px', 'class': 'ITC-image image-fluid common-image-component flexi-height', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://auto.mahindra.com/on/demandware.static/Sites-amc-Site/-/default/dwbe1329bd/images/placeholder-image.png', 'alt_text': \"Mahindra Thar Roxx 'THE SUV\", 'width': '1400px', 'height': '700px', 'class': 'ITC-image image-fluid common-image-component flexi-height', 'loading': 'eager', 'confidence': 0.7}], 'rank': 3}, {'url': 'https://carsinfo.in/7-seater-mahindra-thar/', 'content': 'Mahindra 5 Door Thar Price in India and Specifications CarsInfo Skip to content CarsInfo Menu Menu About Us Contact Us Disclaimer Privacy Policy Terms and Conditions Mahindra 5 Door Thar Price in India and Specifications 2024-11-04 2024-11-04 by carsinfo.in Mahindra is a well-known car manufacturer in the Indian automotive market. The Thar is a well-regarded off-roading car launched by Mahindra. Now, Mahindra & Mahindra recently launched the 5-door Thar in the Indian market with additional features and specifications. Table Of Contents 5 Door Thar Specifications 5 Door Thar Features 5 Door Thar Interior 5 Door Thar Exterior 5 Door Thar Performance 5 Door Thar Safety Features 5 Door Thar Price 5 Door Thar Specifications Power: 130 HP @ 3750 rpm Torque: 300 Nm @ 1500-2800 rpm Transmission: 6-speed manual or 6-speed automatic Fuel Tank Capacity: 57 liters Ground Clearance: 222 mm Wheelbase: 2695 mm Length: 4420 mm Width: 1820 mm Height: 1945 mm Kerb Weight: 1845-2020 kg 5 Door Thar Features Bold, rugged design LED headlights and taillights Front grille with signature slats Roof-mounted spare wheel Multiple exterior color options Spacious 5-seater cabin 10.25-inch touchscreen infotainment system Android Auto and Apple CarPlay Automatic climate control Cruise control Sunroof Premium sound system Leather upholstery (higher variants) 5 Door Thar Interior The 5-door Mahindra Thar offers very spacious and rugged cabin. It offers ample legroom and headroom for better comfort during off roading and also for long drive. Thar 5 door offers 10.25 touchscreen infotainment display to access some features and connected car features like android auto and apple car play. In 5 door Thar, the digital instrument cluster is very clear and easy to read in any environment, and it also comes with automatic climate control for a comfortable cabin experience. 5 Door Thar Exterior In term of exterior, The 5-door Thar resembles the Thar 3-door version. The model is longer, featuring a larger grille for a more distinct presence. Mahindra has also upgraded to LED lights with LED DRL and LED taillights. The 5-door Thar comes with 18-inch alloy wheels that complement its bold design. 5 Door Thar Performance Mahindra Thar 5 door version has two engine option: petrol and diesel. With 2.0-liter mStallion Turbo Petrol engine, it generates 170 bhp power and 320 Nm torque and comes with both 6 speed manual and 6 speed automatic gearbox. With 2.2-liter mHawk Diesel engine, it generates 150 bhp power and 300 Nm torque and comes with both 6 speed manual and 6 speed automatic gearbox. The 5-door Thar provides an estimated fuel efficiency between 12kmpl to 15kmpl. 5 Door Thar Safety Features Dual front airbags Dual front airbags ABS with EBD Electronic Stability Program (ESP) Traction Control System (TCS) Hill Hold Control Rear parking sensors with camera ISOFIX child seat mounts 5 Door Thar Price 5 Door Thar price depends on variants and engine options. 5 Door Thar price starts from 12.99 Lakh to 22.49 Lakh (Ex-Showroom Delhi) . Read More: Toyota Fortuner 2024 Price, Features and Specifications Categories Cars , News Tags 5 door thar , Mahindra Thar 5 door , mahindra thar 5 door price in india , thar 5 door , thar 5 door images , thar 5 door interior , thar 5 door mileage , thar 5 door price , thar 5 door price in india Toyota Fortuner 2024 Price, Features and Specifications Mahindra Bolero Neo Plus Price, Features and Specifications Leave a Comment Cancel reply Comment Name Email Website Save my name, email, and website in this browser for the next time I comment. 2025 CarsInfo Built with GeneratePress', 'images': [{'url': 'https://carsinfo.in/wp-content/uploads/2023/12/Mahindra-Thar-5-Door-1024x576.webp', 'alt_text': 'Mahindra Thar 5 Door', 'title': 'Mahindra Thar 5 Door', 'width': '1024', 'height': '576', 'class': 'uag-image-1411', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://carsinfo.in/wp-content/uploads/2023/12/Mahindra-Thar-5-Door-1-1024x576.webp', 'alt_text': 'Mahindra Thar 5 Door', 'title': 'Mahindra Thar 5 Door-1', 'width': '1024', 'height': '576', 'class': 'uag-image-1410', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://carsinfo.in/wp-content/uploads/2023/12/Mahindra-Thar-5-Door-3-1024x576.webp', 'alt_text': 'Mahindra Thar 5 Door', 'title': 'Mahindra Thar 5 Door-3', 'width': '1024', 'height': '576', 'class': 'uag-image-1408', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://carsinfo.in/wp-content/uploads/2023/12/Mahindra-Thar-5-Door-2-1024x576.webp', 'alt_text': 'Mahindra Thar 5 Door', 'title': 'Mahindra Thar 5 Door-2', 'width': '1024', 'height': '576', 'class': 'uag-image-1409', 'loading': 'lazy', 'confidence': 0.8999999999999999}], 'rank': 4}, {'url': 'https://www.mmmotorsmahindra.co.in/new-cars/mahindra-thar/specification.html', 'content': 'Mahindra Thar Specifications & Features | MM Motors Mahindra true MM Motors Mahindra Sales 9884999993 Home SUV Thar ROXX XUV 3XO Scorpio N XUV700 View All BEVs BE 6 XEV 9e View All CV Small Commercial Vehicle Last Mile Mobility Pick-Ups Service Service Home Buy RSA Buy Shield Outlets More About Us Commercial Vehicle Used Cars Career Testimonials Get in Touch Sales: 9884999993 Home New Cars Mahindra Thar Specification Overview Price Pictures Colors Specifications Mahindra Thar Specifications Features AX Opt Hard Top Diesel RWD LX Hard Top Diesel RWD AX Opt Convert Top Diesel AX Opt Hard Top Diesel LX Hard Top MLD Diesel LX Convert Top Diesel LX Hard Top Diesel Earth Edition Diesel LX Hard Top MLD Diesel AT LX Convert Top Diesel AT Earth Edition Diesel AT LX Hard Top Diesel AT LX Hard Top AT RWD AX Opt Convert Top LX Hard Top Earth Edition LX Convert Top AT LX Hard Top AT Earth Edition AT Engine & Transmission Fuel Type Diesel Displacement 1497 Maximum Power With Unit 116.93 kW @3500rpm Maximum Torque 300Nm@1750-2500rpm Gear Box 6-Speed Capacity Seating Capacity 4 Cargo Volumn - Fuel Tank Capacity 45.0 Brakes Front Brake Type Disc Rear Brake Type Drum Suspension, Tyres & Turning Circle Front Suspension Double wishbone suspension Rear Suspension Multi-link, Solid Axle Tyre_Size 245/75 R16 Turning Radius - Vehicle Dimensions Length 3985 mm Width 1820 mm Height 1850 mm Front Tread - Rear Tread 1520 mm Wheel Base 2450 mm Engine & Transmission Fuel Type Diesel Displacement 1497 Maximum Power With Unit 116.93 kW @3500rpm Maximum Torque 300Nm@1750-2500rpm Gear Box 6-Speed Capacity Seating Capacity 4 Cargo Volumn - Fuel Tank Capacity 45.0 Brakes Front Brake Type Disc Rear Brake Type Drum Suspension, Tyres & Turning Circle Front Suspension Double wishbone suspension Rear Suspension Multi-link, Solid Axle Tyre_Size 255/65 R18 Turning Radius - Vehicle Dimensions Length 3985 mm Width 1820 mm Height 1855 mm Front Tread - Rear Tread 1520 mm Wheel Base 2450 mm Engine & Transmission Fuel Type Diesel Displacement 2184 Maximum Power With Unit 130.07 kW @3750rpm Maximum Torque 300Nm@1600-2800rpm Gear Box 6-Speed Capacity Seating Capacity 4 Cargo Volumn - Fuel Tank Capacity 57.0 Brakes Front Brake Type Disc Rear Brake Type Drum Suspension, Tyres & Turning Circle Front Suspension Double wishbone suspension Rear Suspension Multi-link, Solid Axle Tyre_Size 245/75 R16 Turning Radius - Vehicle Dimensions Length 3985 mm Width 1820 mm Height 1844 mm Front Tread - Rear Tread 1520 mm Wheel Base 2450 mm Engine & Transmission Fuel Type Diesel Displacement 2184 Maximum Power With Unit 130.07 kW @3750rpm Maximum Torque 300Nm@1600-2800rpm Gear Box 6-Speed Capacity Seating Capacity 4 Cargo Volumn - Fuel Tank Capacity 57.0 Brakes Front Brake Type Disc Rear Brake Type Drum Suspension, Tyres & Turning Circle Front Suspension Double wishbone suspension Rear Suspension Multi-link, Solid Axle Tyre_Size 245/75 R16 Turning Radius - Vehicle Dimensions Length 3985 mm Width 1820 mm Height 1844 mm Front Tread - Rear Tread 1520 mm Wheel Base 2450 mm Engine & Transmission Fuel Type Diesel Displacement 2184 Maximum Power With Unit 130.07 kW @3750rpm Maximum Torque 300Nm@1600-2800rpm Gear Box 6-Speed Capacity Seating Capacity 4 Cargo Volumn - Fuel Tank Capacity 57.0 Brakes Front Brake Type Disc Rear Brake Type Drum Suspension, Tyres & Turning Circle Front Suspension Double wishbone suspension Rear Suspension Multi-link, Solid Axle Tyre_Size 255/65 R18 Turning Radius - Vehicle Dimensions Length 3985 mm Width 1820 mm Height 1844 mm Front Tread - Rear Tread 1520 mm Wheel Base 2450 mm Engine & Transmission Fuel Type Diesel Displacement 2184 Maximum Power With Unit 130.07 kW @3750rpm Maximum Torque 300Nm@1600-2800rpm Gear Box 6-Speed Capacity Seating Capacity 4 Cargo Volumn - Fuel Tank Capacity 57.0 Brakes Front Brake Type Disc Rear Brake Type Drum Suspension, Tyres & Turning Circle Front Suspension Double wishbone suspension Rear Suspension Multi-link, Solid Axle Tyre_Size 255/65 R', 'images': [{'url': 'https://stimg.cardekho.com/images/carexteriorimages/320x224/Mahindra/XUV-3XO/10184/1751288551835/front-left-side-47.jpg', 'alt_text': 'Mahindra XUV 3XO', 'confidence': 0.7999999999999999}, {'url': 'https://stimg.cardekho.com/images/carexteriorimages/320x224/Mahindra/Thar-ROXX/8438/1751288658241/front-left-side-47.jpg', 'alt_text': 'Mahindra Thar ROXX', 'confidence': 0.7}, {'url': 'https://stimg.cardekho.com/images/carexteriorimages/320x224/Mahindra/Scorpio-N/10818/1749626691069/front-left-side-47.jpg', 'alt_text': 'Mahindra Scorpio N', 'confidence': 0.7}, {'url': 'https://stimg.cardekho.com/images/carexteriorimages/320x224/Mahindra/XUV700/11736/1749631327264/front-left-side-47.jpg', 'alt_text': 'Mahindra XUV700', 'confidence': 0.7}, {'url': 'https://stimg.cardekho.com/images/carexteriorimages/320x224/Mahindra/BE-6/9263/1739189295831/front-left-side-47.jpg', 'alt_text': 'Mahindra BE 6', 'confidence': 0.7}], 'rank': 5}, {'url': 'https://ackodrive.com/cars/mahindra-thar/', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://suvtale.com/mahindra-thar-5-door-a-comprehensive-review/', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://99caars.com/car-details/mahindra-thar-5-door', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null,
            "_meta": null
          }
        ]
      }
    },
    "validation_results": {
      "is_valid": true,
      "is_dag": true,
      "cycles": [],
      "disconnected_components": [],
      "orphaned_nodes": [],
      "root_nodes": [],
      "leaf_nodes": [
        "T004"
      ],
      "warnings": [],
      "errors": []
    }
  },
  "nodes": [
    {
      "description": "Initial Query",
      "agent": "System",
      "status": "completed",
      "id": "ROOT"
    },
    {
      "id": "T001",
      "description": "Retrieve information on recent Mahindra car launches.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Retrieve information on recent Mahindra car launches, focusing on models released within the last 3 years. Ensure to include model name, launch date, and a brief overview.",
      "reads": [],
      "writes": [
        "T001"
      ],
      "status": "completed",
      "output": {
        "mahindra_launches": [
          {
            "type": "text",
            "text": "[{'url': 'https://www.zigwheels.com/news-features/general-news/4-upcoming-mahindra-cars-worth-keeping-an-eye-on-in-2024/51747/?is_amp=1&onlyStory=6', 'content': \"Mahindra Upcoming Car Launches In 2024: Thar 5-Door, XUV300 Facelift, XUV.e8, XUV400 Facelift - ZigWheels News & Reviews New Cars New Bikes Scooters Auto Expo 2025 Electric Vehicles Used Cars Home News 4 Upcoming Mahindra Cars Worth Keeping An Eye On In 2024 Overview Price Variants Mileage Specs Colours Images Videos UserReviews ExpertReviews Q&A News FAQs SimilarCars 360View Thar5DoorCommunity Dealers Services Brochures Thar5DoorEMI Loans Thar5DoorInsurance 4 Upcoming Mahindra Cars Worth Keeping An Eye On In 2024 Dec 20, 2023 | Views: 6119 | 2 min read By Sumit Khanchandani 2024 will finally be the year when we witness the launch of the larger version of Mahindra's capable off-roader The upcoming year for Mahindra looks exciting, with the launch of the larger version of its capable off-roader and the introduction of the electric version of their popular mid-size SUV, along with the release of a couple of facelifts. These are the upcoming launches from Mahindra in 2024 that you should look out for Mahindra Thar 5-Door Mahindra is set to launch the highly anticipated 5-door version of the Thar next year. With a larger footprint than the 3-door model, it will boast additional features such as a bigger infotainment system and a sunroof. The Thar 5-door will be offered with both petrol and diesel engine options and is expected to be available in 4-wheel-drive (4WD) and rear-wheel-drive (RWD) configurations. Expected Price : Rs 15 lakh Expected Launch : March 2024 Mahindra XUV300 Facelift Mahindras sub-4m SUV, the XUV300 , is due for a significant refresh in 2024. It will feature exterior design changes, along with a redesigned cabin. Mahindra may also equip the facelifted XUV300 with ADAS, while offering it in both petrol and diesel engine options. Expected Price : Rs 9 lakh Expected Launch : March 2024 Mahindra XUV.e8 In 2024, we may also see the launch of the all-electric version of the XUV700 , the XUV.e8 . The electric SUV is expected to be offered with two battery pack options, ranging from 60 kWh to 80 kWh, along with the availability of a dual-motor all-wheel drivetrain . We expect the XUV.e8 to have a range of around 450 km. Expected Price : Rs 35 lakh Expected Launch : End of 2024 Mahindra XUV400 Facelift Recent spy images of the updated XUV400 suggest its potential launch in 2024. We expect the updated EV to showcase design updates reminiscent of the facelifted XUV300 with similar features. With the facelift, the XUV400 is expected to come with an improved range while retaining its existing 34.5 kWh and 39.4 kWh battery pack options that could offer better range. Expected Price : Rs 16 lakh Expected Launch : Second half of 2024 This wraps up the upcoming launches from Mahindra in 2024. Let us know in the comments which car you are most excited about. Mahindra Thar 5-Door Video Review Add Your Comment Mahindra Thar ROXX 4.4/5 39 reviews Rs. 12.99 Lakh View July Offers Latest News Range Rover Velar Autobiography Launched At Rs 89.9 Lakh, Heres Everything You Need To Know BMW 2 Series Gran Coupe Launched In India At Rs 46.9 Lakh 6 Airbags Now Offered As Standard With The Maruti Baleno And Ertiga! Prices Hiked By Heres How You Book A Tesla Model Y In India! View All Latest News Popular News Teslas Grand India Debut: Model Y Hits Roads At Rs 59.89 Lakh! Mahindra XUV 3XO Gets A New REVX Variant Lineup, Makes A Crowd-favourite Feature More Accessible! EXCLUSIVE: Kia Carens Clavis EV To Be A 7-Seater Only? Here's What We Know! Mahindra XEV 9e And BE 6 Now Get A Bigger Battery In Pack Two Variant! View All Similar Cars Review 2024 Hyundai Creta Facelift vs Rivals: Which Compact SUV Shines On The Road? Hyundai Creta 2024 Review: First Drive 2022 Mahindra Scorpio N First Drive: Perfect Middle Ground? Trending Mahindra Cars Mahindra Thar Rs. 11.50 Lakh Mahindra Scorpio N Rs. 13.99 Lakh Mahindra XUV700 Rs. 14.49 Lakh Mahindra Bolero Rs. 9.70 Lakh Mahindra Scorpio Rs. 13.77 Lakh All Mahindra Cars Trending SUV Cars Defender Rs. 1.05\", 'images': [{'url': 'https://media.zigcdn.com/media/content/2023/Dec/6581758c9390a.jpg?tr=w-420', 'alt_text': 'Upcoming Mahindra Cars In 2024', 'title': 'Upcoming Mahindra Cars In 2024', 'class': 'i-amphtml-fill-content i-amphtml-replaced-content', 'loading': 'lazy', 'confidence': 0.8999999999999999}], 'rank': 1}, {'url': 'https://www.acko.com/car-guide/upcoming-mahindra-cars-in-india/', 'content': \"Upcoming Mahindra Cars in India: Expected Launch Date and Price Products Products Insurance made easy: tailor your coverage to fit your needs GET COVERED FOR Health Health Insurance Family Health Insurance Plan 1 Crore Health Insurance Individual Health Insurance Senior Citizen Health Insurance Parents Health Insurance Arogya Sanjeevani Health Insurance Cashless Health Insurance Car Car insurance Comprehensive car insurance Third party car insurance Own damage car insurance Zero depreciation car insurance Electric car insurance Used car insurance Commercial car insurance Bike Bike insurance Scooter insurance Brand new bike insurance Comprehensive bike insurance Third party bike insurance Electric bike insurance Used bike insurance Life Life Insurance Term Insurance Acko Flexi Life Plan Critical Illness Insurance Life Insurance Accidental Death Benefit Rider Disability Income Rider Life Insurance Riders in India Travel Travel insurance International travel insurance Corporate coverage Group health insurance Corporate health insurance Enterprise Renewals Renewals Dont risk it, renew your insurance and stay protected RENEW INSURANCE Health EXISTING ACKO CUSTOMER Login and renew policy SWITCH TO ACKO Renew health insurance Car EXISTING ACKO CUSTOMER Login and renew policy SWITCH TO ACKO Renew car insurance Bike EXISTING ACKO CUSTOMER Login and renew policy SWITCH TO ACKO Renew bike insurance Life SWITCH TO ACKO Renew life insurance Claims Claims Your peace of mind is our top priority - file a claim today FILE OR TRACK CLAIM Health File a new claim Track existing claim How ACKO claim works NEED HELP? Contact us at 1800-266-2256 Car File a new claim Track existing claim How ACKO claim works NEED HELP? Contact us at 1800-266-2256 Bike File a new claim Track existing claim How ACKO claim works NEED HELP? Contact us at 1800-266-2256 Life How life insurance claim works NEED HELP? Contact us at 1800 210 1992 Resources Resources Explore the full ACKO experience and make the most of your plan EXPLORE Articles Guides Ebooks HELP CENTER FAQs FAQs All products Life insurance Support ALL PRODUCTS 1800 266 2256 [emailprotected] LIFE INSURANCE 1800 210 1992 [emailprotected] Enterprise Enterprise Covering Businesses, Employees, Gig Workers & FinTech Log in Sign Up Home / Car Insurance / Articles / Upcoming Mahindra Cars in India 2022-2025 Upcoming Mahindra Cars in India 2022-2025 Team Acko Jan 23, 2025 Share Post The eagerness of a car enthusiast waiting for the launch of an upcoming car is unparalleled. Well, we come bearing glad tidings for all you car fanatics. The upcoming car segment from Mahindra includes revamped versions of its previous SUV models. They promise a power-packed road performance and come with new and improved tech. Safety is the top-most priority at Mahindra, and the company outdoes it with its cars lined up for launch in the coming years. With futuristic tech, power-packed engines, and a sleek and elegant body, Mahindra promises its customers the four-wheel drive of their lives. Here's a list of upcoming Mahindra cars in India that will sweep you off your feet with their innovative specifications. Contents Top Upcoming Mahindra Cars in India 1. Mahindra Bolero Neo Plus (Expected launch date: December 2022) 2. Mahindra XUV400 EV (Expected launch date: January 2023) 3. Mahindra New XUV500 (Expected launch date: July 2024) 4. Mahindra eKUV100 (Expected launch date: January 2023) 5. Mahindra 5-door Thar (Expected launch date: June 2023) 6. Mahindra Bolero (Expected launch date: November 2024) 7. Mahindra XUV900 (Expected launch date: Early 2024) The Need for a Car Inurance Policy Things to remember Frequently Asked Questions Top Upcoming Mahindra Cars in India Model Launch Date Expected Price Mahindra Bolero Neo Plus December 2022 12.5 Lakhs Mahindra XUV400 January 2023 17 Lakhs Mahindra New XUV500 July 2024 12-17 Lakhs Mahindra eKUV100 March 2023 10 Lakhs Mahindra 5-door Thar January 2023 15 Lakhs Mahindra Bolero 2024 November\", 'images': [{'url': 'https://acko-cms.ackoassets.com/Article_Pages_Mobile_Image_f49b40c978.png', 'alt_text': 'Article Pages Mobile Image', 'class': 'sc-bnXvFD kFGmOS', 'confidence': 0.7}], 'rank': 2}, {'url': 'https://www.indiacarnews.com/news/upcoming-mahindra-cars-20433/', 'content': 'New Upcoming Mahindra Cars In India In 2023, 2024 & 2025 News Reviews Comparisons Two Wheelers Web Stories About Us Contact Us Search India Car News Know everything about new and upcoming cars and bikes in India Facebook Twitter Thursday, July 17, 2025 Facebook Twitter Youtube India Car News Know everything about new and upcoming cars and bikes in India News Reviews Comparisons Two Wheelers Web Stories About Us Contact Us Search April 18, 2023 Upcoming Mahindra Cars in India in the Next Two Years Facebook Twitter Pinterest WhatsApp Famous for its utility and sports utility vehicles, the homegrown auto major, Mahindra ruled the segment for long. However, it is facing tough competition from the likes of Maruti Suzuki, Hyundai and Tata Motors in the UV space. Determined to regain lost ground in the segment, Mahindra had introduced multiple new SUVs including the new Thar, XUV700 and the Scorpio-N. In order to further strengthen its position in the UV segment, Mahindra plans to launch a range of new SUVs in the next 2-3 years. Heres a look at all upcoming Mahindra cars in India in 2023, 2024 and 2025. ads Upcoming Mahindra Cars in 2023, 2024, 2025 1. Mahindra Bolero Neo Plus Mahindra is all set to introduce the extended version of the Bolero Neo in the country. Called the Bolero Neo Plus, the SUV is likely to be offered with two seating configurations 7 and 9-seats. It will also be offered with an ambulance variant with 4-seats layout and a patient bed. In terms of proportions, the SUV is 4400mm long, 1795mm wide and 1812mm tall, and has a wheelbase of 2680mm. The new model looks largely identical to the Bolero Neo; however, it received some changes to keep things fresh. Instead of a blacked-out C-pillar, it has body-coloured pillars. It gets new rear bumper and smaller reflector panels, a tailgate-mounted spare tyre with badging and extended rear door. The SUV will be powered by a 2.2L mHawk diesel engine with a 6-speed manual gearbox. This powertrain produces 130PS and 300Nm of torque. 2. 5-door Mahindra Thar The next model in our list of upcoming Mahindra cars is the 5-door or long wheelbase version of the Mahindra Thar. It is expected to be launched by the end of 2023 or early 2024. The 5-door Mahindra Thar will have 300mm longer wheelbase than its 3-door model. It is expected to be based on the new Scorpio-Ns ladder-frame chassis with increased width between the wheelbase for bettery wheelbase-to-track ratio. The SUV will have an extra door for the middle row passengers. The cabin layout will be similar to the existing model and will have a three seat bench layout in the middle row and provide bigger boot space. The SUV is expected to share its powertrains with the Scorpio N. It will be offered with a 200bhp, 2.0L turbo petrol and a 172bhp, 2.2L turbo diesel engine. It can be had with either a manual or an automatic gearbox. 3. New-gen Mahindra Bolero Mahindra will launch the next gen Bolero in our market in 2024. The SUV enjoys huge popularity among buyers in rural and semi-urban markets. It is reportedly to be based on the new ladder-frame chassis that underpins the Thar and the Scorpio-N. The new model is likely to retain the original look; however, it will come with several new design elements and body panels. The cabin will receive maximum changes with better fit & finish levels and material quality. It could also get some modern day features like a touchscreen infotainment system, a multi-functional steering wheel, height adjustable drivers seat and automatic AC. The SUV is likely to feature a 2.2L mHawk diesel and a 2.0L turbo petrol engine along with manual and automatic gearbox options. 4. New Mahindra XUV500 Mahindra had replaced the XUV500 SUV with an all-new XUV700 that is offered in 5-and 7-seat options. The homegrown UV maker has confirmed that the XUV500 nameplate will return and will come with significant changes. It will be significantly smaller than the previous model. If reports are to be believed, the new', 'images': [{'url': 'https://www.indiacarnews.com/wp-content/uploads/2023/02/Mahindra-BE.07.jpg', 'alt_text': 'Mahindra BE.07', 'title': 'Mahindra BE.07', 'width': '1068', 'height': '711', 'class': 'entry-thumb', 'confidence': 0.8999999999999999}, {'url': 'https://www.indiacarnews.com/wp-content/uploads/2023/02/mahindra-bolero-neo-plus-7-seater.jpg', 'alt_text': 'Mahindra bolero neo plus 7 seater', 'width': '1200', 'height': '800', 'class': 'wp-image-56702', 'confidence': 0.8999999999999999}, {'url': 'https://www.indiacarnews.com/wp-content/uploads/2022/12/5-Door-Mahindra-Thar-Launch.jpg', 'alt_text': '5-Door Mahindra Thar Launch', 'width': '1200', 'height': '800', 'class': 'wp-image-55097', 'confidence': 0.8999999999999999}, {'url': 'https://www.indiacarnews.com/wp-content/uploads/2023/03/Mahindra-Bolero-Diesel.jpg', 'alt_text': 'Mahindra Bolero Diesel', 'width': '1200', 'height': '675', 'class': 'wp-image-56877', 'confidence': 0.8999999999999999}, {'url': 'https://www.indiacarnews.com/wp-content/uploads/2021/05/Mahindra-Design-Sketch-1.jpg', 'alt_text': 'Mahindra Design Sketch (1)', 'width': '1201', 'height': '800', 'class': 'wp-image-46382', 'loading': 'lazy', 'confidence': 0.8999999999999999}], 'rank': 3}, {'url': 'https://www.spinny.com/blog/upcoming-mahindra-cars-in-india/', 'content': 'Upcoming Mahindra Cars in India 2023-2024 - Spinny Skip to content HOME NEWS RULES & REGULATIONS BEST CARS BUYING A CAR GUIDES CAR COMPARISONS CAR REVIEWS LOANS DOCUMENTS CAR OWNERSHIP CAR CARE INSURANCE SELL YOUR CAR BUY ASSURED CARS Used Cars in Delhi NCR Used Cars in Delhi Used Cars in Gurgaon Used Cars in Noida Used Cars in Bangalore Used Cars in Hyderabad Used Cars in Mumbai Used Cars in Pune Used Cars in Chennai Used Cars in Ahmedabad Used Cars in Kolkata Spinny Car Hubs Search NEWS BEST CARS BUYING A CAR CAR OWNERSHIP SELLING A CAR RULES & REGULATIONS NEWS BEST CARS BUYING A CAR CAR OWNERSHIP SELLING A CAR RULES & REGULATIONS Home NEWS 8 Upcoming Mahindra cars to keep on your radar Yaajyaansh Bhardwaj Last updated 5 months ago 2022 was an eventful year for Mahindra. Their highly anticipated XUV700 finally started hitting the streets, the Scorpio-N and the Scorpio Classic received favourable reviews from critics and die-hard enthusiasts, and the Bolero Neo had an impressive run in the market. To continue this momentum into the next year, the company recently revealed plans for their upcoming cars which include quite a few electric vehicles as well. Lets look at a few of the upcoming Mahindra cars ready for launch in 2023-24 which include an upcoming Mahindra SUV, and 4 upcoming Mahindra EVs. Also Read Upcoming Maruti Suzuki Cars Table of Contents Upcoming Mahindra Cars 2023 Upcoming Mahindra SUV: Mahindra Thar 5-door Upcoming Mahindra EV: Mahindra XUV400 Upcoming Mahindra electric compact SUV: Mahindra eKUV100 Upcoming Mahindra electric SUVs 2024 Mahindra XUVe8 Mahindra XUVe9 Mahindra BE electric SUVs Summary FAQs Upcoming Mahindra Cars 2023 Upcoming Mahindra SUV: Mahindra Thar 5-door A perfect choice for those who always wanted the current Thar but didnt buy it, as it doesnt quite come across as a family car to most. The 5-door Thar may become the most popular upcoming Mahindra SUV, and we might get to see a repeat of what happened when the new generation of the Thar was launched. While the name might be a placeholder, the 5-door version of the popular off-roader has surfaced quite a lot under camouflage in India. From the spy shots, it retains the frontal design aspects of the current Thar. It is expected that this car will be offered with the same engine options i.e., a 2L turbo-petrol engine and a 2.2L mHawk diesel engine capable of churning out 147 bhp and 300 Nm of torque, and 128 bhp and 300 Nm of torque respectively. It will also receive the current six-speed automatic and manual transmission modes. The expected cost is Rs 15 lakh to Rs 16 lakh meaning it still falls in almost the same price bracket. See Used Mahindra SUVs Also Read Upcoming Toyota Cars In India Upcoming Mahindra EV: Mahindra XUV400 This upcoming Mahindra EV is essentially the electric version of the XUV300 and is based on a tweaked platform of the XUV300. It has a 40kWh battery pack producing 147 bhp and 310 Nm of torque. It also gets 3 driving modes: Fun, Fast, and Fearless. Mahindra claims a 0-100km/h time of 8.3 seconds, which is quicker than the Nexon. Talking about range, it gets an ARAI-certified range of 456km which might translate to 350km in the real world. The charging time is 0-80% via a fast charger in just 50 minutes, or 6 hours 30 minutes for 0-100% depending on the type of fast charger, and 13 hours while using a regular charger. The interior will be almost identical to the XUV300 with the same dashboard layout including a 7-inch infotainment screen and an instrument cluster, along with an all-black interior. Talking about the changes, in place of the gear shifter there will be a gear selector that looks extremely futuristic. The XUV400 will compete against the B and C-segment SUVs which means its direct competitors are the Tata Nexon and the MG ZS EV. The expected cost is in the range of Rs 17 lakh to Rs 22 lakh, which is in the Nexon EV ballpark. Mahindra has confirmed that the XUV400 bookings start from January of 2023 Al', 'images': [{'url': 'https://www.spinny.com/blog/wp-content/uploads/2025/01/Tata-Harrier-EV-Stealth-edition-800x450.webp', 'alt_text': 'Tata Harrier EV Stealth edition', 'width': '800', 'height': '450', 'class': 'attachment-medium size-medium wp-image-520802 not-transparent', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://www.spinny.com/blog/wp-content/uploads/2025/01/Tata-Harrier-EV-Stealth-edition-800x450.webp', 'alt_text': 'Tata Harrier EV Stealth edition', 'width': '800', 'height': '450', 'class': 'attachment-medium size-medium wp-image-520802 not-transparent', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://www.spinny.com/blog/wp-content/uploads/2024/10/Spinny-2024-Hyundai-Creta-800x450.webp', 'alt_text': 'Hyundai Creta', 'width': '800', 'height': '450', 'class': 'attachment-medium size-medium wp-image-519796 not-transparent', 'loading': 'lazy', 'confidence': 0.8999999999999999}], 'rank': 4}, {'url': 'https://www.financialexpress.com/auto/car-news/top-5-upcoming-mahindra-vehicle-launches/2991432/', 'content': 'Top 5 upcoming Mahindra vehicle launches - Car News | The Financial Express FE AUTO NEWS CAR NEWS BIKE NEWS New Cars New Cars Best Cars REVIEWS PHOTOS VIDEOS WEB STORIES EV FE AUTO NEWS CAR NEWS BIKE NEWS New Cars New Cars Best Cars REVIEWS PHOTOS VIDEOS WEB STORIES EV Auto Car News Top 5 upcoming Mahindra vehicle launches Top 5 upcoming Mahindra vehicle launches Upcoming Mahindra launches in 2023 and 2024. Here are the top five Mahindra SUV and electric vehicle launches expected in India. Written by Rajkamal Narayanan February 24, 2023 11:55 IST Follow Us Mahindra has been on a spree of launching new vehicles such as the XUV700 , the new Scorpio -N, the all-electric XUV400, and the rear-wheel-drive Thar. The carmakers not done just yet, as there are more launches to expect from Mahindra. The company has plans to launch SUVs, cars, and electric vehicles in India. Here are the top 5 upcoming Mahindra vehicles, including new SUVs, electric vehicles, and cars. Mahindra Thar 5-door The Mahindra Thar has seen a fair bit of success in India since its launch as its a huge leap over the older-gen vehicle. To make the Thar lineup more practical, the carmaker has plans to launch a long-wheelbase version of the SUV, which will have five doors. The Mahindra Thar 5-door version has been spied numerous times while testing and is expected to launch this year. The 5-door Thar could carry over the same 2.2-litre diesel and 2.0-litre petrol engines, along with manual and automatic gearbox options. Similar to the current-gen Thar, the 5-door version could be offered in 4X2 and 4X4 trims. Mahindra Bolero Neo Plus Image credit: Rushlane Next on the cards is again a long-wheelbase version of an SUV currently on sale the Mahindra Bolero Neo. To be called the Bolero Neo Plus, the SUV is based on the Mahindra TUV300 Plus that was discontinued in India. The Mahindra Bolero Neo Plus has been spotted testing in India, and when launched later this year, it will be offered with different seating configurations and could be powered by a 2.2-litre diesel engine making 120bhp. Mahindra e20 NXT Mahindras first-ever electric car, the e20 is due for an update as the EV market is picking up pace. The e20 was showcased earlier with new updates, however, there has been no word from Mahindra about its launch, and looking at Tatas Tiago EV racking up numbers, Mahindra could think of a similar strategy. Also Read Tata Tiago EV launched in India at Rs 8.49 lakh Mahindra eKUV100 The KUV100 is a strong contender to be electrified, as this makes a practical vehicle for city use. Mahindra could rename the vehicle altogether, however, it will borrow most of its design elements from the KUV100. If Mahindra manages to price it right, the eKUV100 could be a strong competitor to the Tata Tiago EV. Also Read Four upcoming Maruti Suzuki cars and SUVs in 2023 Mahindra XUV500 This may get fans excited, as Mahindra confirmed that the XUV500 will be making a comeback, either late this year or early next year. The Mahindra XUV500 will see significant design updates compared to its older-gen model, while it will sit between the XUV300 and the XUV700 in Mahindras lineup. The new Mahindra XUV500 is expected to carry forward the same engine from the XUV700, but in a detuned state to make less power. Also, when launched, the XUV500 is expected to feature ADAS tech along with a host of other interior upgrades. Discover the latest in the auto world with new cars and new bikes , explore upcoming cars in India, and find your perfect match with cars under 5 lakh , 10 lakh or 15 lakh. Stay updated with the latest auto news and the rise of electric vehicles. This article was first uploaded on February twenty-four, twenty twenty-three, at fifty-five minutes past eleven in the morning. Latest Auto News Drive Safer, Drive Smarter: The updated Toyota Glanza raises the bar India-bound Renault Boreal unveiled: All you need to know Hero Vida VX2 first ride review The versatile family scooter Mahindra', 'images': [{'url': 'https://www.financialexpress.com/wp-content/themes/ie-network-theme/assets/src/img/default-ie.jpg', 'alt_text': 'Toyota Glanza 2025, Glanza Prestige Edition, Toyota Glanza six airbags, Toyota Glanza safety features, Glanza new variant 2025, Glanza vs Baleno, Glanza fuel efficiency, Toyota Glanza engine specs, Toyota Glanza price in India, Toyota Glanza mileage, Glanza CNG variant, Toyota Glanza features, Toyota Glanza HUD, Toyota Glanza connected features, Toyota Glanza updates, Toyota hatchback India, Glanza vs i20 vs Altroz, Premium hatchback India 2025, Glanza accessories Prestige Edition, Toyota Glanza maintenance warranty', 'width': '310', 'height': '174', 'class': 'attachment-newspack-article-block-landscape-medium size-newspack-article-block-landscape-medium wp-post-image lazyloading', 'loading': 'lazy', 'confidence': 1.0}, {'url': 'https://www.financialexpress.com/wp-content/themes/ie-network-theme/assets/src/img/default-ie.jpg', 'alt_text': 'Renault Boreal India, 7-seater SUV 2026, Renault Boreal specifications, Renault Boreal design, Renault Boreal safety features, Renault Boreal engine, Renault Boreal launch date, Renault Duster 7-seater, Renault Boreal price India, Renault Boreal ADAS', 'width': '310', 'height': '174', 'class': 'attachment-newspack-article-block-landscape-medium size-newspack-article-block-landscape-medium wp-post-image lazyloading', 'loading': 'lazy', 'confidence': 1.0}, {'url': 'https://www.financialexpress.com/wp-content/themes/ie-network-theme/assets/src/img/default-ie.jpg', 'alt_text': 'Mahindra XUV 3XO, RevX lineup, sub-4-metre SUV, price, features, petrol engine, panoramic sunroof, ADAS, Maruti Suzuki Brezza, Tata Nexon', 'width': '310', 'height': '174', 'class': 'attachment-newspack-article-block-landscape-medium size-newspack-article-block-landscape-medium wp-post-image lazyloading', 'loading': 'lazy', 'confidence': 1.0}, {'url': 'https://www.financialexpress.com/wp-content/themes/ie-network-theme/assets/src/img/default-ie.jpg', 'alt_text': 'Road trip: Chennai to Mahabalipuram; Where timeless history meets the endless sea', 'width': '310', 'height': '174', 'class': 'attachment-newspack-article-block-landscape-medium size-newspack-article-block-landscape-medium wp-post-image lazyloading', 'loading': 'lazy', 'confidence': 1.0}, {'url': 'https://www.financialexpress.com/wp-content/themes/ie-network-theme/assets/src/img/default-ie.jpg', 'alt_text': 'Luxury car sales in the slow lane in H1', 'width': '310', 'height': '174', 'class': 'attachment-newspack-article-block-landscape-medium size-newspack-article-block-landscape-medium wp-post-image lazyloading', 'loading': 'lazy', 'confidence': 1.0}], 'rank': 5}, {'url': 'https://motoroctane.com/news/230167-upcoming-mahindra-cars-for-2023-24', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://www.v3cars.com/news/mahindra-upcoming-cars-suvs-and-evs-in-2024', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://teamcardelight.com/mahindras-4-new-launches-in-2024-all-the-details/', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null,
            "_meta": null
          }
        ]
      },
      "error": null,
      "cost": 0.0,
      "start_time": "2025-07-17T15:03:15.114418",
      "end_time": "2025-07-17T15:03:44.413486",
      "execution_time": 29.299068,
      "input_tokens": 0,
      "output_tokens": 0,
      "execution_result": null
    },
    {
      "id": "T002",
      "description": "Analyze the retrieved Mahindra car launches to identify the most suitable recommendation based on general user preferences (e.g., fuel efficiency, safety features, technology).",
      "agent": "ThinkerAgent",
      "agent_prompt": "Analyze the list of recent Mahindra car launches (from T001) and identify the most suitable recommendation for a user looking to purchase a new car. Consider factors such as fuel efficiency, safety features, technology, and overall value.  Provide a clear justification for the recommendation.",
      "reads": [
        "T001"
      ],
      "writes": [
        "T002"
      ],
      "status": "completed",
      "output": {
        "output": {
          "initial_thoughts": {
            "entity_1": "Let me think through this: Several Mahindra models are slated for launch or facelift in 2024, including the Thar 5-Door, XUV300 Facelift, XUV.e8 (electric XUV700), and XUV400 Facelift. I need to consider the user's needs regarding fuel efficiency, safety, technology, and value to determine the best recommendation.",
            "entity_2": "Let me think through this: The Mahindra Thar 5-Door offers a more practical version of the popular off-roader, appealing to those seeking adventure with added family-friendliness. The XUV300 Facelift focuses on design updates and potential ADAS features, enhancing safety and aesthetics. The XUV.e8 represents Mahindra's electric SUV ambition, offering a substantial range and all-wheel-drive capability. The XUV400 Facelift aims to improve range and design based on the XUV300.",
            "overall_observations": "Let me think through this: Given the variety of options, a specific recommendation depends on the user's priorities. If practicality and off-road capability are paramount, the Thar 5-Door is a good choice. For safety and updated design in a compact SUV, the XUV300 Facelift is suitable. The XUV.e8 caters to those seeking an electric SUV with extended range, while the XUV400 Facelift provides an updated EV option."
          },
          "review_checklist": {
            "alignment_with_goal": "Let me think through this: I have addressed the user's request to identify recent Mahindra launches and recommend a suitable vehicle. However, a more specific recommendation requires understanding the user's particular needs and preferences, beyond the general factors mentioned.",
            "what_was_missed": "Let me think through this: I haven't considered the user's budget, intended use (city driving vs. highway, family car vs. individual use), and preference for petrol, diesel, or electric vehicles. These factors are crucial for a tailored recommendation.",
            "risk_of_misleading": "Let me think through this: Recommending a vehicle without considering the user's budget and specific needs could lead to dissatisfaction. For instance, the XUV.e8 might be an excellent electric SUV, but its expected price may be out of reach for some users.",
            "improvement_opportunities": "Let me think through this: The recommendation can be improved by explicitly stating the assumptions made and suggesting further questions to narrow down the user's requirements. I can also provide a comparative table of the key features and specifications of each model to aid the user's decision-making process."
          },
          "final_report": {
            "summary": "Based on recent Mahindra launches, the Thar 5-Door, XUV300 Facelift, XUV.e8, and XUV400 Facelift are potential options. The best choice depends on individual priorities, such as off-road capability, safety, electric range, and budget. More information is needed to make a specific recommendation.",
            "detailed": "Let me think through this:\n\n**Introduction**\n\nThis report analyzes recent and upcoming Mahindra car launches in 2024 to provide a recommendation for a user seeking to purchase a new car. The analysis considers factors such as fuel efficiency, safety features, technology, and overall value. However, given the broad nature of the request, the recommendation is contingent on further information regarding the user's specific needs, budget, and preferences.\n\n**Overview of Mahindra Launches in 2024**\n\nBased on available information, Mahindra is expected to launch or facelift several models in 2024:\n\n*   **Mahindra Thar 5-Door:** A more practical version of the popular off-road vehicle with a larger footprint, additional features, and both petrol and diesel engine options.\n*   **Mahindra XUV300 Facelift:** A refreshed version of the sub-4m SUV with exterior design changes, a redesigned cabin, and potential ADAS features.\n*   **Mahindra XUV.e8:** An all-electric version of the XUV700, offered with two battery pack options and a dual-motor all-wheel drivetrain.\n*   **Mahindra XUV400 Facelift:** An updated EV showcasing design updates reminiscent of the facelifted XUV300, with an improved range.\n\n**Comparative Analysis**\n\nTo facilitate a better understanding of the options, the following table provides a comparative overview of the key features and specifications of each model:\n\n| Feature                  | Mahindra Thar 5-Door              | Mahindra XUV300 Facelift           | Mahindra XUV.e8                    | Mahindra XUV400 Facelift            |\n| ------------------------ | ----------------------------------- | --------------------------------- | ---------------------------------- | ---------------------------------- |\n| Engine Options           | Petrol and Diesel                   | Petrol and Diesel                   | Electric                             | Electric                             |\n| Expected Price (Rs Lakh) | 15                                  | 9                                 | 35                                 | 16                                 |\n| Expected Launch          | March 2024                          | March 2024                          | End of 2024                        | Second half of 2024               |\n| Key Features             | Larger size, bigger infotainment, sunroof, 4WD/RWD configurations | Redesigned cabin, potential ADAS      | Dual-motor AWD, long range           | Improved range, design updates       |\n| Target Audience          | Off-road enthusiasts, families        | Compact SUV buyers, safety conscious | EV enthusiasts, long-range drivers | EV buyers, city drivers             |\n\n**Recommendation Justification**\n\nThe most suitable recommendation depends heavily on the user's specific requirements. Here's a breakdown of potential recommendations based on different priorities:\n\n*   **For off-road enthusiasts and those seeking adventure:** The Mahindra Thar 5-Door is an excellent choice. It offers the ruggedness and off-road capability of the Thar with added practicality and space. The availability of both petrol and diesel engines provides flexibility in terms of fuel preference.\n\n*   **For buyers seeking a safe and stylish compact SUV:** The Mahindra XUV300 Facelift is a compelling option. The refreshed design and potential ADAS features enhance both aesthetics and safety. The compact size makes it suitable for city driving.\n\n*   **For those prioritizing electric mobility and long-range driving:** The Mahindra XUV.e8 is a promising contender. With its extended range and all-wheel-drive capability, it offers a premium electric SUV experience.\n\n*   **For buyers looking for an updated and affordable EV:** The Mahindra XUV400 Facelift is a viable option. The design updates and improved range make it a more attractive EV choice.\n\n**Factors Not Considered**\n\nThe above recommendations are based on the limited information available. To provide a more tailored recommendation, it's crucial to consider the following factors:\n\n*   **Budget:** The user's budget will significantly narrow down the options. The XUV.e8, with its higher expected price, may not be suitable for all buyers.\n\n*   **Intended Use:** The intended use of the car (city driving vs. highway, family car vs. individual use) will influence the choice. For example, a family with young children might prioritize safety and space, while an individual might prioritize fuel efficiency and maneuverability.\n\n*   **Fuel Preference:** The user's preference for petrol, diesel, or electric vehicles will further refine the selection.\n\n**Further Questions for the User**\n\nTo provide a more specific and accurate recommendation, the following questions should be asked:\n\n1.  What is your budget for the new car?\n2.  What will be the primary use of the car (city driving, highway, off-roading, family trips)?\n3.  Do you have a preference for petrol, diesel, or electric vehicles?\n4.  What are your top priorities in a car (safety, fuel efficiency, performance, technology, comfort)?\n5.  How many passengers will the car typically need to accommodate?\n\n**Conclusion**\n\nMahindra's upcoming launches in 2024 offer a diverse range of options to suit different needs and preferences. By considering the factors mentioned above and gathering more information from the user, a more tailored and effective recommendation can be provided. Further research into real world reviews and comparisons once the vehicles are launched will also aid in the decision making process.",
            "tables": [],
            "recommendations": [
              "Gather more information from the user regarding their budget, intended use, fuel preference, and top priorities.",
              "Conduct further research into real-world reviews and comparisons once the vehicles are launched.",
              "Provide a more tailored recommendation based on the user's specific needs and preferences."
            ],
            "risks_or_warnings": [
              "Recommending a vehicle without considering the user's budget and specific needs could lead to dissatisfaction.",
              "The information provided is based on preliminary data and expected specifications. Actual features and performance may vary upon launch."
            ],
            "key_factors_considered": [
              "Fuel efficiency",
              "Safety features",
              "Technology",
              "Overall value",
              "Expected price",
              "Intended use"
            ],
            "task_completion_score": 0.85
          }
        },
        "call_self": false,
        "cost": 0.0022275,
        "input_tokens": 7218.0,
        "output_tokens": 1908.0,
        "total_tokens": 9126.0
      },
      "error": null,
      "cost": 0.0,
      "start_time": "2025-07-17T15:03:44.419267",
      "end_time": "2025-07-17T15:04:05.487327",
      "execution_time": 21.06806,
      "input_tokens": 0,
      "output_tokens": 0,
      "execution_result": null
    },
    {
      "id": "T003",
      "description": "Retrieve detailed feature specifications for the recommended Mahindra vehicle.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Retrieve comprehensive details on the features and specifications of the Mahindra vehicle recommended in T002. Include details on engine performance, safety features, infotainment system, dimensions, and available variants.",
      "reads": [
        "T002"
      ],
      "writes": [
        "T003"
      ],
      "status": "completed",
      "output": {
        "Thar_5Door": [
          {
            "type": "text",
            "text": "[{'url': 'https://www.zigwheels.com/mahindra-cars/thar/specifications', 'content': 'Mahindra Thar Specifications - Features, Dimensions, Configurations 0 NEWS & REVIEWS NEW CARS NEW BIKES SCOOTERS MORE Used Cars Forum Home New Cars Mahindra Cars Thar Specifications Overview Price Variants Mileage Specs Colours Images Videos More Mahindra Thar Specifications Mahindra Thar is currently available in Petrol and Diesel engines. The 1997 cc Petrol engine generates a power of 150.19bhp@5000rpm and a torque of 300Nm@1250-3000rpm. The 2184 cc Diesel engine generates a power of 130.07bhp@3750rpm and a torque of 300Nm@1600-2800rpm. Mahindra Thar is available in both Manual & Automatic transmission. The claimed mileage of Thar is 11 kmpl. In configurations, Mahindra Thar has a dimensions of 3985 mm in length, 1820 mm in width and 1855 mm in height. Key Specs of Thar Emission Norm Compliance BS VI 2.0 Fuel Type Diesel Transmission Automatic Max Power 130.07bhp@3750rpm Max Torque 300Nm@1600-2800rpm Mileage 9 kmpl Engine Displ. 2184 cc Audio Control Yes Cruise Control Yes Global NCAP Safety Rating 4 Star Mahindra Thar Rs. 11.50 - 17.62 Lakh Check On Road Price 4.2/5 289 reviews Write a Review View July Offers Download Brochure All Specs & Features of Thar Petrol - 1997 cc Petrol AT - 1997 cc Diesel - 2184 cc Diesel AT - 2184 cc Diesel - 1497 cc Engine and Transmission Engine Type mStallion 150 TGDi Engine Displacement 1997 cc Max Power 150.19bhp@5000rpm Emission Norm Compliance BS VI 2.0 Max Torque 300Nm@1250-3000rpm No Of Cylinders 4 Transmission Manual Gearbox 6-Speed Valves Per Cylinder 4 Drive Type 4WD Turbo Charger Yes Performance and Fuel Economy Fuel Type Petrol Fuel Capacity 57 Liters Mileage (City) 8 kmpl Mileage (Highway) 10 kmpl Brakes, Steering, Suspension and Tyres Suspension Front 2 Suspension Rear 3 Brakes Front Disc Brakes Rear Drum Steering Type Hydraulic Tyre Size 255/65 R18 Tyre Type Tubeless All-Terrai Interior Dimensions Seating Capacity 4 Doors 3 Exterior Dimensions Length*Width*Height 3985*1820*1855 mm 3 Wheelbase 2450 mm Ground Clearance (Unladen) 226 mm Interior Additional Interior Features Dashboard Grab Handle For Front passenger,MID Display in Instrument Cluster (Coloured),Adventure Statistics,Decorative Vin Plate (Individual to Thar Earth Edition),Headrest (Embossed Dune Design),Stiching ( Beige Stitching elements & Earth branding),Thar branding on door pads (Desert Fury Coloured),Twin Peak logo on Steering ( Dark Chrome),Steering Wheel elements (Desert Fury Coloured),AC Vents (Dual Tone),HVAC housing (Piano black),Center gear Console & Cup Holder accents (Dark Chrome) Digital Cluster Yes Air Conditioner Yes Exterior Alloy Wheels Yes Additional Exterior Features Hard Top,All-Black Bumpers,Bonnet Latches,Wheel Arch Cladding,Side Foot Steps (Moulded),Fender-mounted Radio Antenna,Tailgate mounted Spare Wheel,Illuminated Key Ring,Body Colour (Satin Matte Desert Fury Colour),ORVMs Inserts (Desert Fury Coloured),Vertical slats on the Front grille (Desert Fury Coloured),Mahindra Wordmark (Matte Black),Thar branding (Matte Black),4x4 badging (Matte black With red accents),Automatic badging (Matte black With red accents),Gear Knob accents (Dark Chrome) Comfort and Convenience Connectivity Android Auto, Apple CarPlay No of Speakers 4 USB Charger Front Addtional Comfort Features Tip & Slide Mechanism in Co-Driver Seat,Reclining Mechanism,Lockable Glovebox,Electrically Operated HVAC Controls,SMS Read Out Lane Change Indicator Yes AC Yes Heater Yes Power Steering Yes Steering Column Tilt Steering Mounted Audio Control Yes Cruise Control Yes Adjustable Driver Seat Yes Height Adjustable Driver Seat Yes Folding Rear Seat 50:50 Split Multifunction Steering Wheel Yes Tachometer Yes Adjustable Headrest Yes Seat Belt Warning Yes AM/FM Radio Yes Touch-screen Display Yes Speakers Front Yes Speakers Rear Yes Follow me home headlamps Yes Adjustable Headlamps Yes Parking Sensors Rear Front Cupholders Yes Door Pockets Front Door 12V Power Outlets Yes Bottle Holder Front Door Heated Seats Rear Not Available in Thar', 'images': [{'url': 'https://media.zigcdn.com/media/model/2020/Aug/thar-3_195x130.jpg', 'alt_text': 'Photo of Mahindra Thar', 'title': 'Mahindra Thar Images', 'width': '195', 'height': '130', 'class': 'txt-c img-responsive c-p', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://images.zigcdn.com/images/spacer.png', 'alt_text': 'Hyundai Creta', 'title': 'Hyundai Creta', 'class': 'sl-img clr', 'confidence': 0.7}, {'url': 'https://images.zigcdn.com/images/spacer.png', 'alt_text': 'Mahindra Scorpio N', 'title': 'Mahindra Scorpio N', 'class': 'sl-img clr', 'confidence': 0.7}, {'url': 'https://images.zigcdn.com/images/spacer.png', 'alt_text': 'Mahindra XUV700', 'title': 'Mahindra XUV700', 'class': 'sl-img clr', 'confidence': 0.7}, {'url': 'https://images.zigcdn.com/images/spacer.png', 'alt_text': 'Mahindra Bolero', 'title': 'Mahindra Bolero', 'class': 'sl-img clr', 'confidence': 0.7}], 'rank': 1}, {'url': 'https://www.cars24.com/new-cars/mahindra/thar/specifications/', 'content': 'Mahindra Thar 2025 specifications, features and configurations New Cars Explore new cars Compare News All cars Upcoming cars Nissan brand store Popular brands Maruti Suzuki Hyundai Tata Mahindra Toyota Kia Honda Popular cars Hyundai Creta Mahindra Thar Tata Nexon Tata Punch Maruti Swift Kia Syros Skoda Kylaq Cars by body type Sedan SUV Hatchback MUV Cars by price range Under 5 Lakh Under 10 Lakh Under 15 Lakh Under 20 Lakh Explore new cars Compare News All cars Upcoming cars Nissan brand store Popular brands Maruti Suzuki Hyundai Tata Mahindra Toyota Kia Honda Popular cars Hyundai Creta Mahindra Thar Tata Nexon Tata Punch Maruti Swift Kia Syros Skoda Kylaq Cars by body type Sedan SUV Hatchback MUV Cars by price range Under 5 Lakh Under 10 Lakh Under 15 Lakh Under 20 Lakh Autoverse News Auto insider Reviews Auto discussions Car advice Articles News Auto insider Reviews Auto discussions Car advice Articles Buy used car Used cars in Delhi NCR Used cars in New Delhi Used cars in Mumbai Used cars in Bangalore Used cars in Hyderabad Used cars in Ahmedabad Used cars in Gurgaon Used cars in Chennai Used cars in Pune Used cars in Noida Used cars in Ghaziabad Used cars in Lucknow Used cars in Jaipur Used cars in Kolkata Used cars in Kochi Used cars in Indore Used cars in India Used cars in Delhi NCR Used cars in New Delhi Used cars in Mumbai Used cars in Bangalore Used cars in Hyderabad Used cars in Ahmedabad Used cars in Gurgaon Used cars in Chennai Used cars in Pune Used cars in Noida Used cars in Ghaziabad Used cars in Lucknow Used cars in Jaipur Used cars in Kolkata Used cars in Kochi Used cars in Indore Used cars in India Sell car Used Car Valuation Sell car In Delhi Sell car In Mumbai Sell car In Bangalore Sell car In Hyderabad Sell car In Ahmedabad Sell car In Gurgaon Sell car In Chennai Sell car In Pune Sell car In Noida Sell car In Ghaziabad Sell car In Lucknow Sell car In Jaipur Sell car In Kolkata Sell car In Kochi Sell car In Indore Sell car online Used Car Valuation Sell car In Delhi Sell car In Mumbai Sell car In Bangalore Sell car In Hyderabad Sell car In Ahmedabad Sell car In Gurgaon Sell car In Chennai Sell car In Pune Sell car In Noida Sell car In Ghaziabad Sell car In Lucknow Sell car In Jaipur Sell car In Kolkata Sell car In Kochi Sell car In Indore Sell car online Car finance Used car loan Used car loan eligibility Used car loan interest rates Used car EMI calculator Used car loan Used car loan eligibility Used car loan interest rates Used car EMI calculator Car services View & pay challan Car service history Car scrap Check vehicle details Pre delivery inspection Driving School View & pay challan Car service history Car scrap Check vehicle details Pre delivery inspection Driving School Login Login Auto News Personal loan Auto News Personal loan Mahindra Thar Price Specs Safety Rating Variants Colours Mileage User Review Gallery Compare Model Mahindra Thar Specifications Engine 1497 cc Mileage 15.0-15.2 km/l Safety 4 Ad Ad Key specifications Fuel Type Diesel, Petrol Transmission Manual, Automatic Seater 4 Change variant Thar AX Opt 4-Str Hard Top Diesel RWD 11.5 Lakh * Price 0 Fuel Type 0 Transmission 0 Engine Capacity 0 Tags 0 > Clear All Base Variant Thar AX Opt 4-Str Hard Top Diesel RWD 1497 cc Diesel 15.2 km/l Manual 11.5 Lakh* Thar LX 4-Str Hard Top Diesel RWD 1497 cc Diesel 15.2 km/l Manual 13.0 Lakh* Thar LX 4-Str Hard Top AT RWD 1497 cc Petrol 15.0 km/l Automatic 14.3 Lakh* Thar AX Opt 4-Str Convert Top 1997 cc Petrol 15.2 km/l Manual 14.5 Lakh* Thar AX Opt 4-Str Convert Top Diesel 2184 cc Diesel 15.2 km/l Manual 15.0 Lakh* Thar AX Opt 4-Str Hard Top Diesel 2184 cc Diesel 15.2 km/l Manual 15.2 Lakh* Thar LX 4-Str Hard Top 1997 cc Petrol 15.2 km/l Manual 15.2 Lakh* Thar Earth Edition 1997 cc Petrol 15.2 km/l Manual 15.4 Lakh* Thar LX 4-Str Convert Top Diesel 2184 cc Diesel 15.2 km/l Manual 15.9 Lakh* Thar LX 4-Str Hard Top Diesel 2184 cc Diesel 15.2 km/l Manual 15.9 Lakh* Thar E', 'images': [{'url': 'https://cdn.cars24.com/prod/new-car-cms/Mahindra/XUV-3XO/2024/04/30/a58a8d5b-e675-43c6-ba5d-e5a8dfa09dfd-3XO__1_.png', 'alt_text': 'XUV 3XO image', 'width': '329', 'height': '170', 'class': 'w-full h-full object-contain', 'loading': 'lazy', 'confidence': 0.9999999999999999}, {'url': 'https://cdn.cars24.com/prod/new-car-cms/Thar_Car_Image_f844855dfa.png', 'alt_text': 'Mahindra Thar Specifications', 'width': '405', 'height': '224', 'confidence': 0.8999999999999999}, {'url': 'https://cdn.cars24.com/prod/new-car-cms/Thar_Car_Image_f844855dfa.png', 'alt_text': 'Mahindra Thar Specifications', 'width': '650', 'height': '650', 'confidence': 0.8999999999999999}, {'url': 'https://i.ytimg.com/vi_webp/W_8BSSsbfj4/hqdefault.webp', 'alt_text': '2023 Mahindra Thar RWD 4X2 Walkaround And First Drive ImpressionsFrom Rs.9.99 Lakh..', 'width': '340', 'height': '200', 'class': 'w-full h-full object-cover', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://i.ytimg.com/vi_webp/pMT1vhTts_0/hqdefault.webp', 'alt_text': 'New Mahindra Thar - Forget Brezza, Venue, Nexon! Rs 9.99 lakhs onwards', 'width': '340', 'height': '200', 'class': 'w-full h-full object-cover', 'loading': 'lazy', 'confidence': 0.8999999999999999}], 'rank': 2}, {'url': 'https://auto.mahindra.com/suv/thar-roxx/TH5D.html', 'content': \"New Mahindra Thar ROXX SUV - Price, Specs & Colours | 5 door Skip to main content Skip to footer content SUVs THAR ROXX 12.99L - 23.39L Book Now Book Now Explore Explore XUV 3XO 7.99L - 15.79L Book Now Book Now Explore Explore SCORPIO-N 13.99L - 25.62L Book Now Book Now Explore Explore XUV700 14.49L - 25.14L Book Now Book Now Explore Explore THAR 11.50L - 17.62L Book Now Book Now Explore Explore SCORPIO CLASSIC 13.77L - 17.72L Book Now Book Now Explore Explore BOLERO NEO 9.97L - 12.18L Book Now Book Now Explore Explore BOLERO NEO PLUS 11.41L - 14.06L Explore Explore BOLERO 9.81L - 10.93L Book Now Book Now Explore Explore XUV400 17.49L Book Now Book Now Explore Explore MARAZZO 14.59L - 17.00L Book Now Book Now Explore Explore Explore All SUVs Explore All SUVs News Contact Us Menu Build your car Test Drive Buy Buy Book Now Exchange Finance Subscribe a Vehicle Owner's Zone Owner's Zone Owner's Action Owner's Action My Dashboard Service Cost Calculator Locate Service Center Renewals Renewals Roadside Assistance Owner's Manual Care & Maintenance Important Notifications Important Notifications Service Action Adventure Adventure Club Events Expeditions Off-Road Academy Gallery Locate a Dealer Global Markets Language News Contact us Switch theme Dark Light Home THAR ROXX Show more Show less Show more Show less Show more Show less Explore in 3D Explore in 3D Show more Show less Register for the latest news and exclusive updates. Stay informed Stay informed For any assistance call us on 1800 209 6006 1800 209 6006 Social links SUVs SUVs Explore All SUVs Thar Roxx Scorpio-N XUV700 XUV 3XO Thar XUV 400 Scorpio Classic Bolero Neo Bolero Bolero Neo Plus Marazzo PIK-UPs PIK-UPs Veero Maxx City Maxx HD Bolero Pik-up Bolero Camper ABOUT ABOUT About us Press Releases Stories Media kit Careers QMS Certificate OWNER OWNER Service Adventure Merchandise & Gear - Eshop Parts and accessories- Eshop Care & Maintenance Owners manual QMS Certificate customer service customer service Contact us FAQs Talk to an expert Dealer Locator Corporate Sales Enquiry Sitemap Sitemap QMS Certificate quick links quick links Vehicle configurator Test Drive Book Online Calculators Exchange Finance Scrappage Subscribe a vehicle Become a Dealer Download the M4U app now! Lets connect on Whatsapp Chat now Chat now Mahindra Corporate Terms & Conditions Our Privacy Policy Copyright 2025 Mahindra & Mahindra Ltd\", 'images': [{'url': 'https://auto.mahindra.com/dw/image/v2/BKRC_PRD/on/demandware.static/-/Sites-mahindra-product-catalog/default/dw95797f68/images/SCRC/large/ScorpioClassic_602x339.png?sw=360&sh=202', 'alt_text': 'SCORPIO CLASSIC', 'class': 'd-block img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://auto.mahindra.com/dw/image/v2/BKRC_PRD/on/demandware.static/-/Sites-mahindra-product-catalog/default/dwc6625064/images/NEOP/large/BoleroNeoPlus_602x339.png?sw=360&sh=202', 'alt_text': 'BOLERO NEO PLUS', 'class': 'd-block img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://auto.mahindra.com/on/demandware.static/Sites-amc-Site/-/default/dwbe1329bd/images/placeholder-image.png', 'alt_text': 'Thar ROXX Earn 5-Star Bharat-NCAP Rating', 'width': '1400px', 'height': '700px', 'class': 'ITC-image image-fluid common-image-component flexi-height', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://auto.mahindra.com/on/demandware.static/Sites-amc-Site/-/default/dwbe1329bd/images/placeholder-image.png', 'alt_text': 'Mahindra Thar Roxx', 'width': '1400px', 'height': '700px', 'class': 'ITC-image image-fluid common-image-component flexi-height', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://auto.mahindra.com/on/demandware.static/Sites-amc-Site/-/default/dwbe1329bd/images/placeholder-image.png', 'alt_text': \"Mahindra Thar Roxx 'THE SUV\", 'width': '1400px', 'height': '700px', 'class': 'ITC-image image-fluid common-image-component flexi-height', 'loading': 'eager', 'confidence': 0.7}], 'rank': 3}, {'url': 'https://carsinfo.in/7-seater-mahindra-thar/', 'content': 'Mahindra 5 Door Thar Price in India and Specifications CarsInfo Skip to content CarsInfo Menu Menu About Us Contact Us Disclaimer Privacy Policy Terms and Conditions Mahindra 5 Door Thar Price in India and Specifications 2024-11-04 2024-11-04 by carsinfo.in Mahindra is a well-known car manufacturer in the Indian automotive market. The Thar is a well-regarded off-roading car launched by Mahindra. Now, Mahindra & Mahindra recently launched the 5-door Thar in the Indian market with additional features and specifications. Table Of Contents 5 Door Thar Specifications 5 Door Thar Features 5 Door Thar Interior 5 Door Thar Exterior 5 Door Thar Performance 5 Door Thar Safety Features 5 Door Thar Price 5 Door Thar Specifications Power: 130 HP @ 3750 rpm Torque: 300 Nm @ 1500-2800 rpm Transmission: 6-speed manual or 6-speed automatic Fuel Tank Capacity: 57 liters Ground Clearance: 222 mm Wheelbase: 2695 mm Length: 4420 mm Width: 1820 mm Height: 1945 mm Kerb Weight: 1845-2020 kg 5 Door Thar Features Bold, rugged design LED headlights and taillights Front grille with signature slats Roof-mounted spare wheel Multiple exterior color options Spacious 5-seater cabin 10.25-inch touchscreen infotainment system Android Auto and Apple CarPlay Automatic climate control Cruise control Sunroof Premium sound system Leather upholstery (higher variants) 5 Door Thar Interior The 5-door Mahindra Thar offers very spacious and rugged cabin. It offers ample legroom and headroom for better comfort during off roading and also for long drive. Thar 5 door offers 10.25 touchscreen infotainment display to access some features and connected car features like android auto and apple car play. In 5 door Thar, the digital instrument cluster is very clear and easy to read in any environment, and it also comes with automatic climate control for a comfortable cabin experience. 5 Door Thar Exterior In term of exterior, The 5-door Thar resembles the Thar 3-door version. The model is longer, featuring a larger grille for a more distinct presence. Mahindra has also upgraded to LED lights with LED DRL and LED taillights. The 5-door Thar comes with 18-inch alloy wheels that complement its bold design. 5 Door Thar Performance Mahindra Thar 5 door version has two engine option: petrol and diesel. With 2.0-liter mStallion Turbo Petrol engine, it generates 170 bhp power and 320 Nm torque and comes with both 6 speed manual and 6 speed automatic gearbox. With 2.2-liter mHawk Diesel engine, it generates 150 bhp power and 300 Nm torque and comes with both 6 speed manual and 6 speed automatic gearbox. The 5-door Thar provides an estimated fuel efficiency between 12kmpl to 15kmpl. 5 Door Thar Safety Features Dual front airbags Dual front airbags ABS with EBD Electronic Stability Program (ESP) Traction Control System (TCS) Hill Hold Control Rear parking sensors with camera ISOFIX child seat mounts 5 Door Thar Price 5 Door Thar price depends on variants and engine options. 5 Door Thar price starts from 12.99 Lakh to 22.49 Lakh (Ex-Showroom Delhi) . Read More: Toyota Fortuner 2024 Price, Features and Specifications Categories Cars , News Tags 5 door thar , Mahindra Thar 5 door , mahindra thar 5 door price in india , thar 5 door , thar 5 door images , thar 5 door interior , thar 5 door mileage , thar 5 door price , thar 5 door price in india Toyota Fortuner 2024 Price, Features and Specifications Mahindra Bolero Neo Plus Price, Features and Specifications Leave a Comment Cancel reply Comment Name Email Website Save my name, email, and website in this browser for the next time I comment. 2025 CarsInfo Built with GeneratePress', 'images': [{'url': 'https://carsinfo.in/wp-content/uploads/2023/12/Mahindra-Thar-5-Door-1024x576.webp', 'alt_text': 'Mahindra Thar 5 Door', 'title': 'Mahindra Thar 5 Door', 'width': '1024', 'height': '576', 'class': 'uag-image-1411', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://carsinfo.in/wp-content/uploads/2023/12/Mahindra-Thar-5-Door-1-1024x576.webp', 'alt_text': 'Mahindra Thar 5 Door', 'title': 'Mahindra Thar 5 Door-1', 'width': '1024', 'height': '576', 'class': 'uag-image-1410', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://carsinfo.in/wp-content/uploads/2023/12/Mahindra-Thar-5-Door-3-1024x576.webp', 'alt_text': 'Mahindra Thar 5 Door', 'title': 'Mahindra Thar 5 Door-3', 'width': '1024', 'height': '576', 'class': 'uag-image-1408', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://carsinfo.in/wp-content/uploads/2023/12/Mahindra-Thar-5-Door-2-1024x576.webp', 'alt_text': 'Mahindra Thar 5 Door', 'title': 'Mahindra Thar 5 Door-2', 'width': '1024', 'height': '576', 'class': 'uag-image-1409', 'loading': 'lazy', 'confidence': 0.8999999999999999}], 'rank': 4}, {'url': 'https://www.mmmotorsmahindra.co.in/new-cars/mahindra-thar/specification.html', 'content': 'Mahindra Thar Specifications & Features | MM Motors Mahindra true MM Motors Mahindra Sales 9884999993 Home SUV Thar ROXX XUV 3XO Scorpio N XUV700 View All BEVs BE 6 XEV 9e View All CV Small Commercial Vehicle Last Mile Mobility Pick-Ups Service Service Home Buy RSA Buy Shield Outlets More About Us Commercial Vehicle Used Cars Career Testimonials Get in Touch Sales: 9884999993 Home New Cars Mahindra Thar Specification Overview Price Pictures Colors Specifications Mahindra Thar Specifications Features AX Opt Hard Top Diesel RWD LX Hard Top Diesel RWD AX Opt Convert Top Diesel AX Opt Hard Top Diesel LX Hard Top MLD Diesel LX Convert Top Diesel LX Hard Top Diesel Earth Edition Diesel LX Hard Top MLD Diesel AT LX Convert Top Diesel AT Earth Edition Diesel AT LX Hard Top Diesel AT LX Hard Top AT RWD AX Opt Convert Top LX Hard Top Earth Edition LX Convert Top AT LX Hard Top AT Earth Edition AT Engine & Transmission Fuel Type Diesel Displacement 1497 Maximum Power With Unit 116.93 kW @3500rpm Maximum Torque 300Nm@1750-2500rpm Gear Box 6-Speed Capacity Seating Capacity 4 Cargo Volumn - Fuel Tank Capacity 45.0 Brakes Front Brake Type Disc Rear Brake Type Drum Suspension, Tyres & Turning Circle Front Suspension Double wishbone suspension Rear Suspension Multi-link, Solid Axle Tyre_Size 245/75 R16 Turning Radius - Vehicle Dimensions Length 3985 mm Width 1820 mm Height 1850 mm Front Tread - Rear Tread 1520 mm Wheel Base 2450 mm Engine & Transmission Fuel Type Diesel Displacement 1497 Maximum Power With Unit 116.93 kW @3500rpm Maximum Torque 300Nm@1750-2500rpm Gear Box 6-Speed Capacity Seating Capacity 4 Cargo Volumn - Fuel Tank Capacity 45.0 Brakes Front Brake Type Disc Rear Brake Type Drum Suspension, Tyres & Turning Circle Front Suspension Double wishbone suspension Rear Suspension Multi-link, Solid Axle Tyre_Size 255/65 R18 Turning Radius - Vehicle Dimensions Length 3985 mm Width 1820 mm Height 1855 mm Front Tread - Rear Tread 1520 mm Wheel Base 2450 mm Engine & Transmission Fuel Type Diesel Displacement 2184 Maximum Power With Unit 130.07 kW @3750rpm Maximum Torque 300Nm@1600-2800rpm Gear Box 6-Speed Capacity Seating Capacity 4 Cargo Volumn - Fuel Tank Capacity 57.0 Brakes Front Brake Type Disc Rear Brake Type Drum Suspension, Tyres & Turning Circle Front Suspension Double wishbone suspension Rear Suspension Multi-link, Solid Axle Tyre_Size 245/75 R16 Turning Radius - Vehicle Dimensions Length 3985 mm Width 1820 mm Height 1844 mm Front Tread - Rear Tread 1520 mm Wheel Base 2450 mm Engine & Transmission Fuel Type Diesel Displacement 2184 Maximum Power With Unit 130.07 kW @3750rpm Maximum Torque 300Nm@1600-2800rpm Gear Box 6-Speed Capacity Seating Capacity 4 Cargo Volumn - Fuel Tank Capacity 57.0 Brakes Front Brake Type Disc Rear Brake Type Drum Suspension, Tyres & Turning Circle Front Suspension Double wishbone suspension Rear Suspension Multi-link, Solid Axle Tyre_Size 245/75 R16 Turning Radius - Vehicle Dimensions Length 3985 mm Width 1820 mm Height 1844 mm Front Tread - Rear Tread 1520 mm Wheel Base 2450 mm Engine & Transmission Fuel Type Diesel Displacement 2184 Maximum Power With Unit 130.07 kW @3750rpm Maximum Torque 300Nm@1600-2800rpm Gear Box 6-Speed Capacity Seating Capacity 4 Cargo Volumn - Fuel Tank Capacity 57.0 Brakes Front Brake Type Disc Rear Brake Type Drum Suspension, Tyres & Turning Circle Front Suspension Double wishbone suspension Rear Suspension Multi-link, Solid Axle Tyre_Size 255/65 R18 Turning Radius - Vehicle Dimensions Length 3985 mm Width 1820 mm Height 1844 mm Front Tread - Rear Tread 1520 mm Wheel Base 2450 mm Engine & Transmission Fuel Type Diesel Displacement 2184 Maximum Power With Unit 130.07 kW @3750rpm Maximum Torque 300Nm@1600-2800rpm Gear Box 6-Speed Capacity Seating Capacity 4 Cargo Volumn - Fuel Tank Capacity 57.0 Brakes Front Brake Type Disc Rear Brake Type Drum Suspension, Tyres & Turning Circle Front Suspension Double wishbone suspension Rear Suspension Multi-link, Solid Axle Tyre_Size 255/65 R', 'images': [{'url': 'https://stimg.cardekho.com/images/carexteriorimages/320x224/Mahindra/XUV-3XO/10184/1751288551835/front-left-side-47.jpg', 'alt_text': 'Mahindra XUV 3XO', 'confidence': 0.7999999999999999}, {'url': 'https://stimg.cardekho.com/images/carexteriorimages/320x224/Mahindra/Thar-ROXX/8438/1751288658241/front-left-side-47.jpg', 'alt_text': 'Mahindra Thar ROXX', 'confidence': 0.7}, {'url': 'https://stimg.cardekho.com/images/carexteriorimages/320x224/Mahindra/Scorpio-N/10818/1749626691069/front-left-side-47.jpg', 'alt_text': 'Mahindra Scorpio N', 'confidence': 0.7}, {'url': 'https://stimg.cardekho.com/images/carexteriorimages/320x224/Mahindra/XUV700/11736/1749631327264/front-left-side-47.jpg', 'alt_text': 'Mahindra XUV700', 'confidence': 0.7}, {'url': 'https://stimg.cardekho.com/images/carexteriorimages/320x224/Mahindra/BE-6/9263/1739189295831/front-left-side-47.jpg', 'alt_text': 'Mahindra BE 6', 'confidence': 0.7}], 'rank': 5}, {'url': 'https://ackodrive.com/cars/mahindra-thar/', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://suvtale.com/mahindra-thar-5-door-a-comprehensive-review/', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://99caars.com/car-details/mahindra-thar-5-door', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null,
            "_meta": null
          }
        ]
      },
      "error": null,
      "cost": 0.0,
      "start_time": "2025-07-17T15:04:05.495323",
      "end_time": "2025-07-17T15:04:20.626560",
      "execution_time": 15.131237,
      "input_tokens": 0,
      "output_tokens": 0,
      "execution_result": null
    },
    {
      "id": "T004",
      "description": "Consolidate and format the information on the recommended Mahindra vehicle, including its features and specifications, into a comprehensive report.",
      "agent": "FormatterAgent",
      "agent_prompt": "Consolidate the information on the recommended Mahindra vehicle (from T002) and its detailed features (from T003) into a comprehensive and well-organized report. Use a clear and visually appealing format, highlighting key features and specifications. Create an HTML report.",
      "reads": [
        "T002",
        "T003"
      ],
      "writes": [
        "T004"
      ],
      "status": "failed",
      "output": null,
      "error": "503 UNAVAILABLE. {'error': {'code': 503, 'message': 'The model is overloaded. Please try again later.', 'status': 'UNAVAILABLE'}}",
      "cost": 0.0,
      "start_time": "2025-07-17T15:04:20.636039",
      "end_time": "2025-07-17T15:04:23.389118",
      "execution_time": 2.753079
    }
  ],
  "links": [
    {
      "source": "ROOT",
      "target": "T001"
    },
    {
      "source": "T001",
      "target": "T002"
    },
    {
      "source": "T002",
      "target": "T003"
    },
    {
      "source": "T003",
      "target": "T004"
    }
  ]
}