{
  "directed": true,
  "multigraph": false,
  "graph": {
    "session_id": "52760890",
    "original_query": "I want to know the details of features for Mahindra XUV 3XO, use a multiple steps for Retriever Agent OR use multiple iterations in a single step to fetch detailed information (using the pattern --> find sources → extract details) and then create a report. Suggested approach is to fetch the releavnt urls first and then look for data in those URLs",
    "file_manifest": [],
    "created_at": "2025-07-17T14:01:30.344277",
    "status": "running",
    "output_chain": {
      "T001": {
        "xuv_3xo_urls": [
          {
            "type": "text",
            "text": "[{'url': 'https://www.team-bhp.com/news/2024-mahindra-xuv-3xo-review-8-pros-7-cons', 'content': \"2024 Mahindra XUV 3XO Review : 8 Pros & 7 Cons | Team-BHP Skip to main content About Us | Advertise | Contact Us Forum Hot Threads News Reviews Photos Buy Used Car Spare Parts Buy Accessories Classifieds Store News 2024 Mahindra XUV 3XO Review : 8 Pros & 7 Cons 8th May 2024, 12:20 by Omkar Shendge View Forum Discussion It gets a refreshed exterior, some changes to the interiors, quite a few feature additions and a new 6-speed Aisin-sourced automatic gearbox for its petrol engines. Mahindra XUV 3XO Pros A truly premium crossover. Nice build, quality & refinement levels Cabin has enough space for 5. Quality-wise, the interior is more like a Hyundai Fantastic petrol & diesel engine line-up; they offer fast performance & good driveability Finally gets a smooth torque converter automatic with the turbo-petrol engines Wide variant spread ensures there's something for everyone A compliant ride with sorted road manners 5-star NCAP rating & kit. Level 2 ADAS, 6 airbags, ESP, ABS, all-wheel disc brakes, TPMS, seatbelt reminders for all & more Loaded to the gills with equipment (360-degree camera, big sunroof, drive modes, Harman Kardon audio system, wireless smartphone connectivity, auto headlamps & wipers etc.) Mahindra XUV 3XO Cons The new edgy & outlandish design may not be to everyone's liking. Some love it, some don't. It is very polarizing Top-end variants are expensive. Not overpriced, but definitely higher than expected 295-liter boot is the smallest in the segment. There are cheaper hatchbacks that have a larger boot No proper diesel automatic option, just a jerky AMT which has no place in a premium crossover Light & disconnected steering is the biggest drawback in a competent handling package Mahindra's after-sales service quality is a hit or miss. Remains a gamble Some important features missing (ventilated seats, parcel tray, full-sized spare wheel, paddle shifters etc.) Read Team-BHP's detailed Mahindra XUV 3XO Review View Forum Discussion Tags: Indian Mahindra Launches & Updates Mahindra XUV 3XO Back to Index Next Article Related News Mahindra XUV 3XO RevX edition launch soon; details revealed Mahindra XUV 3XO REVX Series launched at Rs 8.94 lakh 10,000 km with my Mahindra XUV 3X0: Service & ownership recap Booked Mahindra XUV 3XO AX5 over Skoda Kylaq Signature Plus: Here's why Improving my Mahindra XUV 3XO AX5L's audio setup with a 2-stage upgrade Find Car News By Brand Any Brand Audi BMW BYD Chevrolet Citroen Datsun Ferrari Fiat Force Ford HM Honda Hyundai Isuzu Jaguar Jeep Kia Lamborghini Land Rover Lexus Lotus Mahindra Maruti Suzuki McLaren Mercedes-Benz MG Mini Mitsubishi Nissan Porsche Premier Renault Rolls-Royce Skoda Tata Tesla Toyota VinFast Volkswagen Volvo Or By Category Any Category 2-Wheels Commercial Vehicles Industry & Policy Launches & Updates Member Content Motorsports Other Sales & Analysis Scoops & Rumours Just News Range Rover Velar Autobiography launched at Rs 89.90 lakh Tata rolls out 6 lakh units of the Punch in less than 4 years BMW 2 Series Gran Coupe launched at Rs 46.90 lakh Volvo XC60 facelift to be launched on August 1 MG M9 electric MPV to be launched on July 21 2025 TVS Apache RTR 310 launched at Rs 2.40 lakh Cars24 launches all-in-one ownership plan for used cars Tesla Model Y long-wheelbase leaked ahead of launch Volvo plannning to shift some XC60 & XC90 production to U.S. Maruti Suzuki Ertiga & Baleno now get 6 airbags as standard Tesla to install V4 Superchargers in Mumbai & Delhi Kawasaki Ninja ZX-6R recalled over an engine issue Team-BHP.com Advice Classifieds Forum Hot Threads News Photos Reviews Road Safety Store Tech Stuff About Us Overview The Team Key Features Philosophy History Contact Us Speak Share Advertise Copyright 2025 - www.team-bhp.com Site Map | Privacy Policy | Terms & Conditions Team-BHP's Daily Newsletter View recent samples Hero Vida VX2 Buy & Sell USED CARS Rs. 2 Lakhs or less Rs. 2 - 4 Lakhs Rs. 4 - 6 Lakhs Rs. 6 - 8 Lakhs Rs. 8 Lakhs or more Hot Threads All-New M\", 'images': [{'url': 'https://www.team-bhp.com/sites/default/files/styles/check_extra_large_for_review/public/2024_mahindra_xuv3xo_exterior_01_0.jpg', 'alt_text': '2024 Mahindra XUV 3XO Review : 8 Pros & 7 Cons', 'confidence': 0.7999999999999999}, {'url': 'https://www.team-bhp.com/sites/default/files/styles/check_extra_large_for_review/public/2024_mahindra_xuv3xo_interior_01.jpg', 'alt_text': '2024 Mahindra XUV 3XO Review : 8 Pros & 7 Cons', 'confidence': 0.7999999999999999}, {'url': 'https://www.team-bhp.com/sites/default/files/styles/check_extra_large_for_review/public/2024_mahindra_xuv3xo_interior_20.jpg', 'alt_text': '2024 Mahindra XUV 3XO Review : 8 Pros & 7 Cons', 'confidence': 0.7999999999999999}, {'url': 'https://www.team-bhp.com/sites/default/files/styles/check_extra_large_for_review/public/2024_mahindra_xuv3xo_interior_27.jpg', 'alt_text': '2024 Mahindra XUV 3XO Review : 8 Pros & 7 Cons', 'confidence': 0.7999999999999999}, {'url': 'https://www.team-bhp.com/sites/default/files/styles/check_thumb_review_detail/public/2024_mahindra_xuv3xo_exterior_01_0.jpg', 'alt_text': '2024 Mahindra XUV 3XO Review : 8 Pros & 7 Cons', 'confidence': 0.7999999999999999}], 'rank': 1}, {'url': 'https://cargraze.com/blog/mahindra-xuv-3xo-review-specs-price-mileage-and-the-right-one-for-you', 'content': \"Mahindra XUV 3XO Review: Specs, Price, Mileage, and the Right One for You  | Cargraze Home Cars Car Blog Tools Loan EMI Calculator Mileage Calculator Sell Used Car Check RC Login/ Register Home Car Info Mahindra XUV 3XO Review: Specs, Price, Mileage, and the Right One for You Mahindra XUV 3XO Review: Specs, Price, Mileage, and the Right One for You Published On Oct 22, 2024 By Cargraze for Car Info Exploring the Features of the New Mahindra XUV 3XO: A Detailed Review Looking for a car that perfectly balances luxury, performance, and safety? Lets dive into the newly launched Mahindra XUV 3XO, a vehicle packed with features that make it a top contender in its segment. Whether youre searching for great engine performance or unbeatable in-car tech, this SUV has something for everyone. Panoramic Sunroof and Elegant Interiors Who doesnt love a sunroof? The Mahindra XUV 3XO boasts the largest panoramic sunroof in its segment, offering a breathtaking view on those long drives. The interior options give a touch of sophistication, with leatherette upholstery available on top trims. If you're aiming for practicality, the lower variants come with durable fabric options, ensuring you find the right balance between luxury and utility. Engine Performance to Suit Your Drive Style This SUV offers two engine choices to fit different needs: 1.2L Petrol Engine: Producing 110 PS and 200 Nm of torque, ideal for smooth city rides. 1.5L CRDI Diesel Engine: Delivering 116 PS and 300 Nm of torque, ensuring effortless highway drives. If you need power combined with efficiency, the diesel variant promises impressive torque delivery, making it ideal for road trips. Advanced Safety Features and Ratings Safety is non-negotiable, and the Mahindra XUV 3XO delivers on that front. Right from the base model, you get all four disc brakes, six airbags, and a five-star safety rating - one of the highest in its class. It also includes power windows across all four doors as standard, ensuring convenience. Variants and Value-for-Money Choices The Mahindra XUV 3XO comes in several exciting variants, including the MX series and the AX series . If youre on a budget but still want the essentials, the A5 variant is a great pick. It offers: Manual transmission at 12.3 lakhs (on-road). Automatic transmission at 14 lakhs (on-road). The top-end AX7 trim is loaded with premium features like 360 cameras, electronic parking brakes, and ADAS (Advanced Driver Assistance System), which enhance both safety and convenience. In-Car Technology and Infotainment For tech lovers, this SUV doesnt disappoint. It comes with Harman Kardon sound systems, offering immersive audio, but only on select high-end models. Other highlights include: Wireless charging from the MX3 Pro variant onwards. Dual-zone automatic climate control. Apple CarPlay and Android Auto connectivity, with an intuitive touchscreen infotainment system. Built-in navigation system with a high-resolution display. Driving Comfort and Space Even if you are on the taller side, the Mahindra XUV 3XO offers ample headroom and legroom. Rear passengers benefit from additional AC vents, Type-C ports, and a 12V charging socket. Plus, the center armrest with twin cup holders adds a touch of convenience on family road trips. The boot space of 364 liters is sufficient for your weekend luggage, and the hydraulic tailgate makes it easy to load and unload items. While the powered tailgate feature is missing, the ease of manual operation ensures a hassle-free experience. Fuel Efficiency You Can Count On Mahindra claims a fuel efficiency of around 20 km/l for the petrol variant under ideal conditions. However, in real-world city driving, expect around 12-14 km/l with the manual transmission. For diesel enthusiasts, the Mahindra XUV 3XO delivers 15-16 km/l in urban settings and up to 20 km/l on highways. Financing and Insurance Options When it comes to financing your purchase, Mahindra offers attractive loan options through partner banks. While\", 'images': [{'url': 'https://cargraze.com/assets/img/otp-login-register.webp', 'alt_text': 'verify login account', 'confidence': 0.7}], 'rank': 2}, {'url': 'https://www.carsauce.com/car-review/2026-mahindra-xuv-3xo-review', 'content': \"2026 Mahindra XUV 3XO Review - CarSauce LATEST car News expert Reviews Extra Sauce Search Car reviews Mahindra 2026 Mahindra XUV 3XO Review The Mahindra XUV 3XO arrives with good looks and great value in the small SUV segment, ready to take on the likes of the Chery Tiggo 4. Jack MacKenzie Expert reviewer Updated on Jul 8, 2025 6:37 PM Saucey Grade View full breakdown B+ UNGRADED 7.0 Saucey Grade View full breakdown 7.0 /10 B+ UNGRADED Why is this grade different to the rating? The Mahindra XUV 3XO makes a strong case for itself as a comfortable, trendy value-conscious small SUV but falls short in some areas, earning a B+ grade. This grade reflects our expert team's overall verdict, factoring in real-world usability, fun factor & valuebeyond just the star ratings. Was our grading fair? Too low! Just right! Too high! Remove Vote Be the first to vote! What people are saying: Too Low: Loading... Just Right: Loading... Too High: Loading... Pros Excellent exterior design Cheap price tag Well-equipped Cons Slightly lacking in safety equipment Disconnected steering feel Dated-looking dashboard Car specs 82 kW + 200 Nm $23,990 drive away 6.5L/100km Unrated Want a great rate on your next car? Enquire now The Small SUV is one of the most popular car segments in Australia, and Indian manufacturer, Mahindra, are looking to establish themselves at the budget end of a market. However, this is currently the territory of the Chery Tiggo 4. The Tiggo 4 and the pre-facelift Tiggo 4 Pro offers a comfortable, well-equipped package with a very competitive price tag. The Mahindra XUV 3XO is not, in fact, C-3POs new set of wheels as its name would suggest, but it is the Indian-marques latest offering with budget and value conscious customers in mind, lining up the Tiggo 4 squarely in its crosshair. However, the small SUV space is as competitive as it is abundant, and the 3XO will not only go toe-to-toe with the Tiggo 4, but also its rivals including the likes of the MG ZS, GWM Haval Jolion and Hyundai Venue. But can the new Mahindra find its feet in its segment? And can it take on the Tiggo 4? Value for Money How much does the 2026 Mahindra XUV 3XO cost? In order to take the fight to the Tiggo 4 and other value offerings in the small SUV segment, Mahindra had to get the price of the XUV 3XO right. They did. With prices starting from $23,990 drive away for the entry-level AX5L trim level, The Mahindra XUV 3XO arrives as one of the most competitively priced offerings in the segment. Its price tag matches that of the entry-level Tiggo 4 to the dollar, and its the same story when you go one level up to the AX7L model, priced at $26,990 drive away. Until August 31st, 2025, both 3XO trim levels will be discounted by $500 for introductory pricing, temporarily undercutting the Tiggo-4 as a result. Not only is the Mahindra XUV 3XO the joint cheapest small SUVs, its now also one of the cheapest new cars in Australia. 2026 Mahindra XUV 3XO Pricing: AX5L: $23,990 drive away AX7L: $26,990 drive away Options Metallic Paint (on all colours except white): $495 Are you interested in a Mahindra XUV 3XO and looking for the best price? Find a Deal! Exterior Styling Diamonds are Mahindra Despite wrapping a platform thats over a decade old, the Mahindra XUV 3XO arrives with a trendy, contemporary exterior design. It stands out in Mahindras Australian range as the most modern-looking vehicle on offer and sets itself apart in what is becoming an increasingly uniform segment. The styling is angular and striking, sporting a diamond theme most evident in the headlight design, the accents placed on the exterior trim including on the tail lights, roof rails and rear bumper, and the diamond cut alloy wheels. Additional touches such as the rear light bar and the two tone roof featured on some specs further aid in its effectiveness. Somehow, the proportions resulting from the short wheelbase and little overhang have been supremely managed too, with the 3XO appearing tightly pa\", 'images': [{'url': 'https://cdn.carsauce.com/63c4bd441c21782eb0d195d5/6868788cf479f4ed60135708_hero.webp', 'alt_text': '2026 Mahindra XUV 3XO Review', 'class': 'review-hero-image', 'loading': 'eager', 'confidence': 0.8999999999999999}, {'url': 'https://cdn.carsauce.com/63c4bd441c21782eb0d195d5/6847a810de906801142b7037_jack-mackenzie-1.webp', 'alt_text': 'Jack MacKenzie', 'class': 'blogpost2_author-image', 'loading': 'eager', 'confidence': 0.7}], 'rank': 3}, {'url': 'https://www.cardekho.com/mahindra/xuv-3xo/specs', 'content': \"Mahindra XUV 3XO Specifications - Dimensions, Configurations, Features, Engine cc Ad Select City All New Used English Login New Cars Explore New Cars Electric Cars Mahindra BE 6 Mahindra XEV 9e Tata Harrier EV MG Windsor EV Tata Nexon EV MG Comet EV All Electric Cars Popular Cars Hyundai Creta Defender Mahindra XUV 3XO Mahindra Thar ROXX Mahindra Scorpio Maruti Swift All Popular Cars Upcoming Cars New Launches Car Insurance Ad Popular Brands Maruti Cars Tata Cars Kia Cars Toyota Cars Hyundai Cars Mahindra Cars Compare Cars New Car Offers & Discounts Find Car Dealers Find EV Charging Stations Find Fuel Stations Check Fuel Prices Used Cars Buy Used Cars Used Cars In Your City Ahmedabad Bangalore Chennai Delhi NCR Hyderabad Jaipur Kolkata Mumbai Pune More Cities Sell My Car Used Car Valuation Dealership Near Me News & Reviews News & Top stories Car Expert Reviews User Reviews Car Collection Tips & Advice Videos Video Reviews Visual Stories Ask AI.CarDekho XUV 3XO Price Compare Images Specs User Reviews 360 View Variants Videos More Mileage Colours XUV 3XO News FAQs Dealers Service Center Brochure XUV 3XO EMI Loan Second Hand XUV 3XO Mahindra XUV 3XO Specifications The Mahindra XUV 3XO has 1 Diesel Engine and 1 Petrol Engine on offer. The Diesel engine is 1498 cc while the Petrol engine is 1197 cc . It is available with Manual & Automatic transmission.Depending upon the variant and fuel type the XUV 3XO has a mileage of 17.96 to 20.6 kmpl. The XUV 3XO is a 5 seater 3 cylinder car and has length of 3990 mm, width of 1821 mm and a wheelbase of 2600. Read More 4.6 303 Reviews Shortlist Rs. 7.99 - 15.80 Lakh * EMI starts @ 21,545 View July Offers Ad Ad Standout features of Mahindra XUV 3XO Soft touch material on dashboard and door pads. Panoramic sunroof - largest in the segment. Level 2 ADAS with features such as forward collision warning, adaptive cruise control. 1.2-litre turbo-petrol engine makes 130PS/230Nm most powerful in its class. Mahindra XUV 3XO brochure Download brochure for detailed information of specs, features & prices. Download Brochure Key specifications of Mahindra XUV 3XO ARAI Mileage 18.2 kmpl Fuel Type Petrol Engine Displacement 1197 cc No. of Cylinders 3 Max Power 128.73bhp@5000rpm Max Torque 230Nm@1500-3750rpm Seating Capacity 5 Transmission Type Automatic Boot Space 364 Litres Fuel Tank Capacity 42 Litres Body Type SUV Key features of Mahindra XUV 3XO Power Steering Yes Power Windows Front Yes Anti-lock Braking System (ABS) Yes Air Conditioner Yes Driver Airbag Yes Passenger Airbag Yes Automatic Climate Control Yes Alloy Wheels Yes Multi-function Steering Wheel Yes Mahindra XUV 3XO specifications Engine & Transmission Engine Type mStallion (TGDi) engine Displacement 1197 cc Max Power 128.73bhp@5000rpm Max Torque 230Nm@1500-3750rpm No. of Cylinders 3 Valves Per Cylinder 4 Turbo Charger Yes Transmission Type Automatic Gearbox 6-Speed AT Drive Type FWD Report Incorrect Specs Don't miss out on the best offers for this Month View July Offers Fuel & Performance Fuel Type Petrol Petrol Mileage ARAI 18.2 kmpl Petrol Fuel Tank Capacity 42 Litres Emission Norm Compliance BS VI 2.0 Report Incorrect Specs Suspension, Steering & Brakes Front Suspension MacPherson Strut suspension Rear Suspension Rear twist beam Steering Type Electric Turning Radius 5.3 m Front Brake Type Disc Rear Brake Type Disc Alloy Wheel Size Front 17 Inch Alloy Wheel Size Rear 17 Inch Report Incorrect Specs Don't miss out on the best offers for this Month View July Offers Dimensions & Capacity Length 3990 mm Width 1821 mm Height 1647 mm Boot Space 364 Litres Seating Capacity 5 Wheel Base 2600 mm No. of Doors 5 Report Incorrect Specs Don't miss out on the best offers for this Month View July Offers Comfort & Convenience Power Steering Air Conditioner Heater Height Adjustable Driver Seat Ventilated Seats Electric Adjustable Seats Automatic Climate Control Accessory Power Outlet Rear Reading Lamp Adjustable Headrest Rear Seat Centre Arm Rest Height\", 'images': [{'url': 'https://stimg.cardekho.com/images/expert-review/mahindra-xuv-3xo/1714475519871/original/Mahindra-XUV-3XO-0.jpg?tr=w-320', 'alt_text': 'Mahindra XUV 3XO Soft touch material on dashboard and door pads.', 'title': 'XUV 3XO Soft touch material on dashboard and door pads.', 'height': '175', 'loading': 'eager', 'confidence': 0.7999999999999999}, {'url': 'https://stimg.cardekho.com/pwa/img/spacer3x2.png', 'alt_text': 'Mahindra XUV 3XO Panoramic sunroof - largest in the segment.', 'title': 'XUV 3XO Panoramic sunroof - largest in the segment.', 'height': '175', 'class': 'imageTransition', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://stimg.cardekho.com/pwa/img/spacer3x2.png', 'alt_text': 'Mahindra XUV 3XO Level 2 ADAS with features such as forward collision warning, adaptive cruise control.', 'title': 'XUV 3XO Level 2 ADAS with features such as forward collision warning, adaptive cruise control.', 'height': '175', 'class': 'imageTransition', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://stimg.cardekho.com/pwa/img/spacer3x2.png', 'alt_text': 'Mahindra XUV 3XO \\u20601.2-litre turbo-petrol engine makes 130PS/230Nm — most powerful in its class.', 'title': 'XUV 3XO \\u20601.2-litre turbo-petrol engine makes 130PS/230Nm — most powerful in its class.', 'height': '175', 'class': 'imageTransition', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://stimg.cardekho.com/pwa/img/spacer3x2.png', 'alt_text': 'download brochure', 'height': '90', 'class': 'image imageTransition', 'loading': 'lazy', 'confidence': 0.7999999999999999}], 'rank': 4}, {'url': 'https://www.autocarindia.com/car-reviews/mahindra-xuv-3xo-review-feature-and-power-packed-compact-suv-431439', 'content': \"Mahindra XUV300, XUV 3XO review, design, interior, features, performance, first drive - Introduction | Autocar India All All Price News Reviews Features Specifications Images Videos All All Price News Reviews Features Specifications Images Videos Signup Login Find a Car Cars Compare Cars New Cars Upcoming Cars Car Price Car Loan Calculator Find a Bike Bikes Compare Bikes New New Bikes New Scooters Upcoming Upcoming Bikes Upcoming Scooters Electric Electric Bikes Electric Scooters Bike Price Bike Loan Calculator News Cars Bikes Motorsports Industry Marketplace Reviews Car First drive / Reviews Comparisons Video reviews Long-term reviews Bike First ride / Reviews Comparisons Video reviews Long-term reviews Features Features Travelogues Blogs Interviews Partner Content Galleries Videos Images Stories Advice Signup Login Home Car Reviews Mahindra XUV 3XO review - Feature and power packed compact SUV Mahindra XUV 3XO review - Feature and power packed compact SUV Out goes the Mahindra XUV300 and in comes the XUV 3XO. The new name is just the starting point of a very comprehensive upgrade. Updated on May 02, 2024 05:35:55 PM 86,990 Views Follow us on The XUV 3XO's styling is big on flash The diamond-shaped detailing on the lights and grille are a nice touch. The infotainment is now a 10.25-inch unit and works well. By Nikhil Bhatia Share - Make : Mahindra Model : XUV 3XO We Like Upmarket interior Strong engines Long equipment list We Don't Like Boot space Competent as the Mahindra XUV300 was, it never quite made it to the list of compact SUV bestsellers. Mahindra is now gunning for glory with the updated XUV300, christened the XUV 3XO. Mind you, this is no run-of-the-mill nip and tuck update. Mahindra has gone all out with a new look, redone interior, some class-first feature introductions, some class-best specifications and very enticing pricing. The aim is to take the fight to the Tata Nexon, Maruti Brezza, Kia Sonet and Hyundai Venue, and win. Mahindra XUV 3XO: design and styling Where the XUV300s styling was understated, the XUV 3XO is big on flash. Giving the 3XO its distinctive face are the large, new vertically oriented headlights outlined by C-shaped DRLs (a link to the larger XUV700). The headlights are split into two sections with a concealed projector unit up top, and an open projector fog lamp unit lower down, both set amidst a black surround. The lights flank the new grille, which is actually a gloss panel that runs much of the XUVs width. The new front bumper with its pronounced cuts and creases is very concept car-like and the newly contoured bonnet also does its bit to add volume to the design. New C-shaped LED DRLs provide a visual link with the larger XUV700. Like the XUV300, the 3XO looks muscular in profile, and furthering the impression are the stylish new 17-inch diamond cut alloy wheels that are the largest in the segment. Theres also chunkier side cladding with cuts at the wheel arches. Mahindra says ground clearance is a generous 201mm, up from the XUV300s figure of 180mm. Mahindra XUV 3XO Price, Mileage, Specifications, Features and Variants Brand Mahindra Model Name XUV 3XO Mahindra XUV 3XO Price 9.06 - 18.39 lakh Mahindra XUV 3XO Range/Mileage Petrol : 17.96 - 20.1kpl | Diesel : 20.6 - 21.2kpl Mahindra XUV 3XO Specifications SUV | 5 doors | 5 seats View All Specs Mahindra XUV 3XO Features LED headlight | 10.25-inch Touchscreen display | 6 airbags View All Features Mahindra XUV 3XO Variants MX1 1.2 Petrol MT | REVX M 1.2 Petrol MT | REVX M (O) 1.2 Petrol MT View All Variants In its basic shape though, the 3XO is no different than the XUV300. The 2,600mm wheelbase remains class best, but the short overhangs, particularly at the back, tell you that this is a vehicle that's brutally shortened (remember it started life as a SsangYong Tivoli) to get length under the critical 4m mark, needed to qualify as a small car and hence a lower rate of tax. New 17-inch alloys are the largest in the segment. At the back, y\", 'images': [{'url': 'https://img.autocarindia.com/ExtraImages/20240502111525_First Drive 3XO Web.001.jpeg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO review', 'title': 'Mahindra XUV 3XO review', 'class': 'img-fluid', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/ExtraImages/20240502012130_First Drive 3XO Web.008.jpeg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO front quarter', 'title': 'Mahindra XUV 3XO front quarter', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/ExtraImages/20240502012130_First Drive 3XO Web.014.jpeg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO review - Feature and power packed compact SUV', 'title': 'Mahindra XUV 3XO review - Feature and power packed compact SUV', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/ExtraImages/20240502012130_First Drive 3XO Web.016.jpeg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO review - Feature and power packed compact SUV', 'title': 'Mahindra XUV 3XO review - Feature and power packed compact SUV', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/model/uploads/modelimages/Mahindra-XUV-3XO-290420241902.jpg', 'alt_text': 'Latest Image of Mahindra XUV 3XO', 'title': 'Mahindra XUV 3XO', 'class': 'img-fluid wid-img', 'loading': 'lazy', 'confidence': 0.7999999999999999}], 'rank': 5}, {'url': 'https://whatinsider.com/mahindra-xuv-3xo/', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://www.carwale.com/mahindra-cars/xuv-3xo/', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://www.drivespark.com/car-reviews/mahindra-xuv-3xo-review-driving-impressions-specs-features-images-047267.html', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null,
            "_meta": null
          }
        ]
      }
    },
    "validation_results": {
      "is_valid": true,
      "is_dag": true,
      "cycles": [],
      "disconnected_components": [],
      "orphaned_nodes": [],
      "root_nodes": [],
      "leaf_nodes": [
        "T003"
      ],
      "warnings": [],
      "errors": []
    }
  },
  "nodes": [
    {
      "description": "Initial Query",
      "agent": "System",
      "status": "completed",
      "id": "ROOT"
    },
    {
      "id": "T001",
      "description": "Find relevant URLs related to Mahindra XUV 3XO features using RetrieverAgent.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Find at least 5 URLs that provide detailed information about the features of Mahindra XUV 3XO.",
      "reads": [],
      "writes": [
        "T001"
      ],
      "status": "completed",
      "output": {
        "xuv_3xo_urls": [
          {
            "type": "text",
            "text": "[{'url': 'https://www.team-bhp.com/news/2024-mahindra-xuv-3xo-review-8-pros-7-cons', 'content': \"2024 Mahindra XUV 3XO Review : 8 Pros & 7 Cons | Team-BHP Skip to main content About Us | Advertise | Contact Us Forum Hot Threads News Reviews Photos Buy Used Car Spare Parts Buy Accessories Classifieds Store News 2024 Mahindra XUV 3XO Review : 8 Pros & 7 Cons 8th May 2024, 12:20 by Omkar Shendge View Forum Discussion It gets a refreshed exterior, some changes to the interiors, quite a few feature additions and a new 6-speed Aisin-sourced automatic gearbox for its petrol engines. Mahindra XUV 3XO Pros A truly premium crossover. Nice build, quality & refinement levels Cabin has enough space for 5. Quality-wise, the interior is more like a Hyundai Fantastic petrol & diesel engine line-up; they offer fast performance & good driveability Finally gets a smooth torque converter automatic with the turbo-petrol engines Wide variant spread ensures there's something for everyone A compliant ride with sorted road manners 5-star NCAP rating & kit. Level 2 ADAS, 6 airbags, ESP, ABS, all-wheel disc brakes, TPMS, seatbelt reminders for all & more Loaded to the gills with equipment (360-degree camera, big sunroof, drive modes, Harman Kardon audio system, wireless smartphone connectivity, auto headlamps & wipers etc.) Mahindra XUV 3XO Cons The new edgy & outlandish design may not be to everyone's liking. Some love it, some don't. It is very polarizing Top-end variants are expensive. Not overpriced, but definitely higher than expected 295-liter boot is the smallest in the segment. There are cheaper hatchbacks that have a larger boot No proper diesel automatic option, just a jerky AMT which has no place in a premium crossover Light & disconnected steering is the biggest drawback in a competent handling package Mahindra's after-sales service quality is a hit or miss. Remains a gamble Some important features missing (ventilated seats, parcel tray, full-sized spare wheel, paddle shifters etc.) Read Team-BHP's detailed Mahindra XUV 3XO Review View Forum Discussion Tags: Indian Mahindra Launches & Updates Mahindra XUV 3XO Back to Index Next Article Related News Mahindra XUV 3XO RevX edition launch soon; details revealed Mahindra XUV 3XO REVX Series launched at Rs 8.94 lakh 10,000 km with my Mahindra XUV 3X0: Service & ownership recap Booked Mahindra XUV 3XO AX5 over Skoda Kylaq Signature Plus: Here's why Improving my Mahindra XUV 3XO AX5L's audio setup with a 2-stage upgrade Find Car News By Brand Any Brand Audi BMW BYD Chevrolet Citroen Datsun Ferrari Fiat Force Ford HM Honda Hyundai Isuzu Jaguar Jeep Kia Lamborghini Land Rover Lexus Lotus Mahindra Maruti Suzuki McLaren Mercedes-Benz MG Mini Mitsubishi Nissan Porsche Premier Renault Rolls-Royce Skoda Tata Tesla Toyota VinFast Volkswagen Volvo Or By Category Any Category 2-Wheels Commercial Vehicles Industry & Policy Launches & Updates Member Content Motorsports Other Sales & Analysis Scoops & Rumours Just News Range Rover Velar Autobiography launched at Rs 89.90 lakh Tata rolls out 6 lakh units of the Punch in less than 4 years BMW 2 Series Gran Coupe launched at Rs 46.90 lakh Volvo XC60 facelift to be launched on August 1 MG M9 electric MPV to be launched on July 21 2025 TVS Apache RTR 310 launched at Rs 2.40 lakh Cars24 launches all-in-one ownership plan for used cars Tesla Model Y long-wheelbase leaked ahead of launch Volvo plannning to shift some XC60 & XC90 production to U.S. Maruti Suzuki Ertiga & Baleno now get 6 airbags as standard Tesla to install V4 Superchargers in Mumbai & Delhi Kawasaki Ninja ZX-6R recalled over an engine issue Team-BHP.com Advice Classifieds Forum Hot Threads News Photos Reviews Road Safety Store Tech Stuff About Us Overview The Team Key Features Philosophy History Contact Us Speak Share Advertise Copyright 2025 - www.team-bhp.com Site Map | Privacy Policy | Terms & Conditions Team-BHP's Daily Newsletter View recent samples Hero Vida VX2 Buy & Sell USED CARS Rs. 2 Lakhs or less Rs. 2 - 4 Lakhs Rs. 4 - 6 Lakhs Rs. 6 - 8 Lakhs Rs. 8 Lakhs or more Hot Threads All-New M\", 'images': [{'url': 'https://www.team-bhp.com/sites/default/files/styles/check_extra_large_for_review/public/2024_mahindra_xuv3xo_exterior_01_0.jpg', 'alt_text': '2024 Mahindra XUV 3XO Review : 8 Pros & 7 Cons', 'confidence': 0.7999999999999999}, {'url': 'https://www.team-bhp.com/sites/default/files/styles/check_extra_large_for_review/public/2024_mahindra_xuv3xo_interior_01.jpg', 'alt_text': '2024 Mahindra XUV 3XO Review : 8 Pros & 7 Cons', 'confidence': 0.7999999999999999}, {'url': 'https://www.team-bhp.com/sites/default/files/styles/check_extra_large_for_review/public/2024_mahindra_xuv3xo_interior_20.jpg', 'alt_text': '2024 Mahindra XUV 3XO Review : 8 Pros & 7 Cons', 'confidence': 0.7999999999999999}, {'url': 'https://www.team-bhp.com/sites/default/files/styles/check_extra_large_for_review/public/2024_mahindra_xuv3xo_interior_27.jpg', 'alt_text': '2024 Mahindra XUV 3XO Review : 8 Pros & 7 Cons', 'confidence': 0.7999999999999999}, {'url': 'https://www.team-bhp.com/sites/default/files/styles/check_thumb_review_detail/public/2024_mahindra_xuv3xo_exterior_01_0.jpg', 'alt_text': '2024 Mahindra XUV 3XO Review : 8 Pros & 7 Cons', 'confidence': 0.7999999999999999}], 'rank': 1}, {'url': 'https://cargraze.com/blog/mahindra-xuv-3xo-review-specs-price-mileage-and-the-right-one-for-you', 'content': \"Mahindra XUV 3XO Review: Specs, Price, Mileage, and the Right One for You  | Cargraze Home Cars Car Blog Tools Loan EMI Calculator Mileage Calculator Sell Used Car Check RC Login/ Register Home Car Info Mahindra XUV 3XO Review: Specs, Price, Mileage, and the Right One for You Mahindra XUV 3XO Review: Specs, Price, Mileage, and the Right One for You Published On Oct 22, 2024 By Cargraze for Car Info Exploring the Features of the New Mahindra XUV 3XO: A Detailed Review Looking for a car that perfectly balances luxury, performance, and safety? Lets dive into the newly launched Mahindra XUV 3XO, a vehicle packed with features that make it a top contender in its segment. Whether youre searching for great engine performance or unbeatable in-car tech, this SUV has something for everyone. Panoramic Sunroof and Elegant Interiors Who doesnt love a sunroof? The Mahindra XUV 3XO boasts the largest panoramic sunroof in its segment, offering a breathtaking view on those long drives. The interior options give a touch of sophistication, with leatherette upholstery available on top trims. If you're aiming for practicality, the lower variants come with durable fabric options, ensuring you find the right balance between luxury and utility. Engine Performance to Suit Your Drive Style This SUV offers two engine choices to fit different needs: 1.2L Petrol Engine: Producing 110 PS and 200 Nm of torque, ideal for smooth city rides. 1.5L CRDI Diesel Engine: Delivering 116 PS and 300 Nm of torque, ensuring effortless highway drives. If you need power combined with efficiency, the diesel variant promises impressive torque delivery, making it ideal for road trips. Advanced Safety Features and Ratings Safety is non-negotiable, and the Mahindra XUV 3XO delivers on that front. Right from the base model, you get all four disc brakes, six airbags, and a five-star safety rating - one of the highest in its class. It also includes power windows across all four doors as standard, ensuring convenience. Variants and Value-for-Money Choices The Mahindra XUV 3XO comes in several exciting variants, including the MX series and the AX series . If youre on a budget but still want the essentials, the A5 variant is a great pick. It offers: Manual transmission at 12.3 lakhs (on-road). Automatic transmission at 14 lakhs (on-road). The top-end AX7 trim is loaded with premium features like 360 cameras, electronic parking brakes, and ADAS (Advanced Driver Assistance System), which enhance both safety and convenience. In-Car Technology and Infotainment For tech lovers, this SUV doesnt disappoint. It comes with Harman Kardon sound systems, offering immersive audio, but only on select high-end models. Other highlights include: Wireless charging from the MX3 Pro variant onwards. Dual-zone automatic climate control. Apple CarPlay and Android Auto connectivity, with an intuitive touchscreen infotainment system. Built-in navigation system with a high-resolution display. Driving Comfort and Space Even if you are on the taller side, the Mahindra XUV 3XO offers ample headroom and legroom. Rear passengers benefit from additional AC vents, Type-C ports, and a 12V charging socket. Plus, the center armrest with twin cup holders adds a touch of convenience on family road trips. The boot space of 364 liters is sufficient for your weekend luggage, and the hydraulic tailgate makes it easy to load and unload items. While the powered tailgate feature is missing, the ease of manual operation ensures a hassle-free experience. Fuel Efficiency You Can Count On Mahindra claims a fuel efficiency of around 20 km/l for the petrol variant under ideal conditions. However, in real-world city driving, expect around 12-14 km/l with the manual transmission. For diesel enthusiasts, the Mahindra XUV 3XO delivers 15-16 km/l in urban settings and up to 20 km/l on highways. Financing and Insurance Options When it comes to financing your purchase, Mahindra offers attractive loan options through partner banks. While\", 'images': [{'url': 'https://cargraze.com/assets/img/otp-login-register.webp', 'alt_text': 'verify login account', 'confidence': 0.7}], 'rank': 2}, {'url': 'https://www.carsauce.com/car-review/2026-mahindra-xuv-3xo-review', 'content': \"2026 Mahindra XUV 3XO Review - CarSauce LATEST car News expert Reviews Extra Sauce Search Car reviews Mahindra 2026 Mahindra XUV 3XO Review The Mahindra XUV 3XO arrives with good looks and great value in the small SUV segment, ready to take on the likes of the Chery Tiggo 4. Jack MacKenzie Expert reviewer Updated on Jul 8, 2025 6:37 PM Saucey Grade View full breakdown B+ UNGRADED 7.0 Saucey Grade View full breakdown 7.0 /10 B+ UNGRADED Why is this grade different to the rating? The Mahindra XUV 3XO makes a strong case for itself as a comfortable, trendy value-conscious small SUV but falls short in some areas, earning a B+ grade. This grade reflects our expert team's overall verdict, factoring in real-world usability, fun factor & valuebeyond just the star ratings. Was our grading fair? Too low! Just right! Too high! Remove Vote Be the first to vote! What people are saying: Too Low: Loading... Just Right: Loading... Too High: Loading... Pros Excellent exterior design Cheap price tag Well-equipped Cons Slightly lacking in safety equipment Disconnected steering feel Dated-looking dashboard Car specs 82 kW + 200 Nm $23,990 drive away 6.5L/100km Unrated Want a great rate on your next car? Enquire now The Small SUV is one of the most popular car segments in Australia, and Indian manufacturer, Mahindra, are looking to establish themselves at the budget end of a market. However, this is currently the territory of the Chery Tiggo 4. The Tiggo 4 and the pre-facelift Tiggo 4 Pro offers a comfortable, well-equipped package with a very competitive price tag. The Mahindra XUV 3XO is not, in fact, C-3POs new set of wheels as its name would suggest, but it is the Indian-marques latest offering with budget and value conscious customers in mind, lining up the Tiggo 4 squarely in its crosshair. However, the small SUV space is as competitive as it is abundant, and the 3XO will not only go toe-to-toe with the Tiggo 4, but also its rivals including the likes of the MG ZS, GWM Haval Jolion and Hyundai Venue. But can the new Mahindra find its feet in its segment? And can it take on the Tiggo 4? Value for Money How much does the 2026 Mahindra XUV 3XO cost? In order to take the fight to the Tiggo 4 and other value offerings in the small SUV segment, Mahindra had to get the price of the XUV 3XO right. They did. With prices starting from $23,990 drive away for the entry-level AX5L trim level, The Mahindra XUV 3XO arrives as one of the most competitively priced offerings in the segment. Its price tag matches that of the entry-level Tiggo 4 to the dollar, and its the same story when you go one level up to the AX7L model, priced at $26,990 drive away. Until August 31st, 2025, both 3XO trim levels will be discounted by $500 for introductory pricing, temporarily undercutting the Tiggo-4 as a result. Not only is the Mahindra XUV 3XO the joint cheapest small SUVs, its now also one of the cheapest new cars in Australia. 2026 Mahindra XUV 3XO Pricing: AX5L: $23,990 drive away AX7L: $26,990 drive away Options Metallic Paint (on all colours except white): $495 Are you interested in a Mahindra XUV 3XO and looking for the best price? Find a Deal! Exterior Styling Diamonds are Mahindra Despite wrapping a platform thats over a decade old, the Mahindra XUV 3XO arrives with a trendy, contemporary exterior design. It stands out in Mahindras Australian range as the most modern-looking vehicle on offer and sets itself apart in what is becoming an increasingly uniform segment. The styling is angular and striking, sporting a diamond theme most evident in the headlight design, the accents placed on the exterior trim including on the tail lights, roof rails and rear bumper, and the diamond cut alloy wheels. Additional touches such as the rear light bar and the two tone roof featured on some specs further aid in its effectiveness. Somehow, the proportions resulting from the short wheelbase and little overhang have been supremely managed too, with the 3XO appearing tightly pa\", 'images': [{'url': 'https://cdn.carsauce.com/63c4bd441c21782eb0d195d5/6868788cf479f4ed60135708_hero.webp', 'alt_text': '2026 Mahindra XUV 3XO Review', 'class': 'review-hero-image', 'loading': 'eager', 'confidence': 0.8999999999999999}, {'url': 'https://cdn.carsauce.com/63c4bd441c21782eb0d195d5/6847a810de906801142b7037_jack-mackenzie-1.webp', 'alt_text': 'Jack MacKenzie', 'class': 'blogpost2_author-image', 'loading': 'eager', 'confidence': 0.7}], 'rank': 3}, {'url': 'https://www.cardekho.com/mahindra/xuv-3xo/specs', 'content': \"Mahindra XUV 3XO Specifications - Dimensions, Configurations, Features, Engine cc Ad Select City All New Used English Login New Cars Explore New Cars Electric Cars Mahindra BE 6 Mahindra XEV 9e Tata Harrier EV MG Windsor EV Tata Nexon EV MG Comet EV All Electric Cars Popular Cars Hyundai Creta Defender Mahindra XUV 3XO Mahindra Thar ROXX Mahindra Scorpio Maruti Swift All Popular Cars Upcoming Cars New Launches Car Insurance Ad Popular Brands Maruti Cars Tata Cars Kia Cars Toyota Cars Hyundai Cars Mahindra Cars Compare Cars New Car Offers & Discounts Find Car Dealers Find EV Charging Stations Find Fuel Stations Check Fuel Prices Used Cars Buy Used Cars Used Cars In Your City Ahmedabad Bangalore Chennai Delhi NCR Hyderabad Jaipur Kolkata Mumbai Pune More Cities Sell My Car Used Car Valuation Dealership Near Me News & Reviews News & Top stories Car Expert Reviews User Reviews Car Collection Tips & Advice Videos Video Reviews Visual Stories Ask AI.CarDekho XUV 3XO Price Compare Images Specs User Reviews 360 View Variants Videos More Mileage Colours XUV 3XO News FAQs Dealers Service Center Brochure XUV 3XO EMI Loan Second Hand XUV 3XO Mahindra XUV 3XO Specifications The Mahindra XUV 3XO has 1 Diesel Engine and 1 Petrol Engine on offer. The Diesel engine is 1498 cc while the Petrol engine is 1197 cc . It is available with Manual & Automatic transmission.Depending upon the variant and fuel type the XUV 3XO has a mileage of 17.96 to 20.6 kmpl. The XUV 3XO is a 5 seater 3 cylinder car and has length of 3990 mm, width of 1821 mm and a wheelbase of 2600. Read More 4.6 303 Reviews Shortlist Rs. 7.99 - 15.80 Lakh * EMI starts @ 21,545 View July Offers Ad Ad Standout features of Mahindra XUV 3XO Soft touch material on dashboard and door pads. Panoramic sunroof - largest in the segment. Level 2 ADAS with features such as forward collision warning, adaptive cruise control. 1.2-litre turbo-petrol engine makes 130PS/230Nm most powerful in its class. Mahindra XUV 3XO brochure Download brochure for detailed information of specs, features & prices. Download Brochure Key specifications of Mahindra XUV 3XO ARAI Mileage 18.2 kmpl Fuel Type Petrol Engine Displacement 1197 cc No. of Cylinders 3 Max Power 128.73bhp@5000rpm Max Torque 230Nm@1500-3750rpm Seating Capacity 5 Transmission Type Automatic Boot Space 364 Litres Fuel Tank Capacity 42 Litres Body Type SUV Key features of Mahindra XUV 3XO Power Steering Yes Power Windows Front Yes Anti-lock Braking System (ABS) Yes Air Conditioner Yes Driver Airbag Yes Passenger Airbag Yes Automatic Climate Control Yes Alloy Wheels Yes Multi-function Steering Wheel Yes Mahindra XUV 3XO specifications Engine & Transmission Engine Type mStallion (TGDi) engine Displacement 1197 cc Max Power 128.73bhp@5000rpm Max Torque 230Nm@1500-3750rpm No. of Cylinders 3 Valves Per Cylinder 4 Turbo Charger Yes Transmission Type Automatic Gearbox 6-Speed AT Drive Type FWD Report Incorrect Specs Don't miss out on the best offers for this Month View July Offers Fuel & Performance Fuel Type Petrol Petrol Mileage ARAI 18.2 kmpl Petrol Fuel Tank Capacity 42 Litres Emission Norm Compliance BS VI 2.0 Report Incorrect Specs Suspension, Steering & Brakes Front Suspension MacPherson Strut suspension Rear Suspension Rear twist beam Steering Type Electric Turning Radius 5.3 m Front Brake Type Disc Rear Brake Type Disc Alloy Wheel Size Front 17 Inch Alloy Wheel Size Rear 17 Inch Report Incorrect Specs Don't miss out on the best offers for this Month View July Offers Dimensions & Capacity Length 3990 mm Width 1821 mm Height 1647 mm Boot Space 364 Litres Seating Capacity 5 Wheel Base 2600 mm No. of Doors 5 Report Incorrect Specs Don't miss out on the best offers for this Month View July Offers Comfort & Convenience Power Steering Air Conditioner Heater Height Adjustable Driver Seat Ventilated Seats Electric Adjustable Seats Automatic Climate Control Accessory Power Outlet Rear Reading Lamp Adjustable Headrest Rear Seat Centre Arm Rest Height\", 'images': [{'url': 'https://stimg.cardekho.com/images/expert-review/mahindra-xuv-3xo/1714475519871/original/Mahindra-XUV-3XO-0.jpg?tr=w-320', 'alt_text': 'Mahindra XUV 3XO Soft touch material on dashboard and door pads.', 'title': 'XUV 3XO Soft touch material on dashboard and door pads.', 'height': '175', 'loading': 'eager', 'confidence': 0.7999999999999999}, {'url': 'https://stimg.cardekho.com/pwa/img/spacer3x2.png', 'alt_text': 'Mahindra XUV 3XO Panoramic sunroof - largest in the segment.', 'title': 'XUV 3XO Panoramic sunroof - largest in the segment.', 'height': '175', 'class': 'imageTransition', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://stimg.cardekho.com/pwa/img/spacer3x2.png', 'alt_text': 'Mahindra XUV 3XO Level 2 ADAS with features such as forward collision warning, adaptive cruise control.', 'title': 'XUV 3XO Level 2 ADAS with features such as forward collision warning, adaptive cruise control.', 'height': '175', 'class': 'imageTransition', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://stimg.cardekho.com/pwa/img/spacer3x2.png', 'alt_text': 'Mahindra XUV 3XO \\u20601.2-litre turbo-petrol engine makes 130PS/230Nm — most powerful in its class.', 'title': 'XUV 3XO \\u20601.2-litre turbo-petrol engine makes 130PS/230Nm — most powerful in its class.', 'height': '175', 'class': 'imageTransition', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://stimg.cardekho.com/pwa/img/spacer3x2.png', 'alt_text': 'download brochure', 'height': '90', 'class': 'image imageTransition', 'loading': 'lazy', 'confidence': 0.7999999999999999}], 'rank': 4}, {'url': 'https://www.autocarindia.com/car-reviews/mahindra-xuv-3xo-review-feature-and-power-packed-compact-suv-431439', 'content': \"Mahindra XUV300, XUV 3XO review, design, interior, features, performance, first drive - Introduction | Autocar India All All Price News Reviews Features Specifications Images Videos All All Price News Reviews Features Specifications Images Videos Signup Login Find a Car Cars Compare Cars New Cars Upcoming Cars Car Price Car Loan Calculator Find a Bike Bikes Compare Bikes New New Bikes New Scooters Upcoming Upcoming Bikes Upcoming Scooters Electric Electric Bikes Electric Scooters Bike Price Bike Loan Calculator News Cars Bikes Motorsports Industry Marketplace Reviews Car First drive / Reviews Comparisons Video reviews Long-term reviews Bike First ride / Reviews Comparisons Video reviews Long-term reviews Features Features Travelogues Blogs Interviews Partner Content Galleries Videos Images Stories Advice Signup Login Home Car Reviews Mahindra XUV 3XO review - Feature and power packed compact SUV Mahindra XUV 3XO review - Feature and power packed compact SUV Out goes the Mahindra XUV300 and in comes the XUV 3XO. The new name is just the starting point of a very comprehensive upgrade. Updated on May 02, 2024 05:35:55 PM 86,990 Views Follow us on The XUV 3XO's styling is big on flash The diamond-shaped detailing on the lights and grille are a nice touch. The infotainment is now a 10.25-inch unit and works well. By Nikhil Bhatia Share - Make : Mahindra Model : XUV 3XO We Like Upmarket interior Strong engines Long equipment list We Don't Like Boot space Competent as the Mahindra XUV300 was, it never quite made it to the list of compact SUV bestsellers. Mahindra is now gunning for glory with the updated XUV300, christened the XUV 3XO. Mind you, this is no run-of-the-mill nip and tuck update. Mahindra has gone all out with a new look, redone interior, some class-first feature introductions, some class-best specifications and very enticing pricing. The aim is to take the fight to the Tata Nexon, Maruti Brezza, Kia Sonet and Hyundai Venue, and win. Mahindra XUV 3XO: design and styling Where the XUV300s styling was understated, the XUV 3XO is big on flash. Giving the 3XO its distinctive face are the large, new vertically oriented headlights outlined by C-shaped DRLs (a link to the larger XUV700). The headlights are split into two sections with a concealed projector unit up top, and an open projector fog lamp unit lower down, both set amidst a black surround. The lights flank the new grille, which is actually a gloss panel that runs much of the XUVs width. The new front bumper with its pronounced cuts and creases is very concept car-like and the newly contoured bonnet also does its bit to add volume to the design. New C-shaped LED DRLs provide a visual link with the larger XUV700. Like the XUV300, the 3XO looks muscular in profile, and furthering the impression are the stylish new 17-inch diamond cut alloy wheels that are the largest in the segment. Theres also chunkier side cladding with cuts at the wheel arches. Mahindra says ground clearance is a generous 201mm, up from the XUV300s figure of 180mm. Mahindra XUV 3XO Price, Mileage, Specifications, Features and Variants Brand Mahindra Model Name XUV 3XO Mahindra XUV 3XO Price 9.06 - 18.39 lakh Mahindra XUV 3XO Range/Mileage Petrol : 17.96 - 20.1kpl | Diesel : 20.6 - 21.2kpl Mahindra XUV 3XO Specifications SUV | 5 doors | 5 seats View All Specs Mahindra XUV 3XO Features LED headlight | 10.25-inch Touchscreen display | 6 airbags View All Features Mahindra XUV 3XO Variants MX1 1.2 Petrol MT | REVX M 1.2 Petrol MT | REVX M (O) 1.2 Petrol MT View All Variants In its basic shape though, the 3XO is no different than the XUV300. The 2,600mm wheelbase remains class best, but the short overhangs, particularly at the back, tell you that this is a vehicle that's brutally shortened (remember it started life as a SsangYong Tivoli) to get length under the critical 4m mark, needed to qualify as a small car and hence a lower rate of tax. New 17-inch alloys are the largest in the segment. At the back, y\", 'images': [{'url': 'https://img.autocarindia.com/ExtraImages/20240502111525_First Drive 3XO Web.001.jpeg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO review', 'title': 'Mahindra XUV 3XO review', 'class': 'img-fluid', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/ExtraImages/20240502012130_First Drive 3XO Web.008.jpeg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO front quarter', 'title': 'Mahindra XUV 3XO front quarter', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/ExtraImages/20240502012130_First Drive 3XO Web.014.jpeg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO review - Feature and power packed compact SUV', 'title': 'Mahindra XUV 3XO review - Feature and power packed compact SUV', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/ExtraImages/20240502012130_First Drive 3XO Web.016.jpeg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO review - Feature and power packed compact SUV', 'title': 'Mahindra XUV 3XO review - Feature and power packed compact SUV', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/model/uploads/modelimages/Mahindra-XUV-3XO-290420241902.jpg', 'alt_text': 'Latest Image of Mahindra XUV 3XO', 'title': 'Mahindra XUV 3XO', 'class': 'img-fluid wid-img', 'loading': 'lazy', 'confidence': 0.7999999999999999}], 'rank': 5}, {'url': 'https://whatinsider.com/mahindra-xuv-3xo/', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://www.carwale.com/mahindra-cars/xuv-3xo/', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://www.drivespark.com/car-reviews/mahindra-xuv-3xo-review-driving-impressions-specs-features-images-047267.html', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null,
            "_meta": null
          }
        ]
      },
      "error": null,
      "cost": 0.0,
      "start_time": "2025-07-17T14:01:30.352273",
      "end_time": "2025-07-17T14:02:00.257793",
      "execution_time": 29.90552,
      "input_tokens": 0,
      "output_tokens": 0,
      "execution_result": null
    },
    {
      "id": "T002",
      "description": "Extract detailed feature information from the URLs found in T001 using RetrieverAgent.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Extract detailed information about the features of Mahindra XUV 3XO from the following URLs: {{T001.output.urls}}. Focus on key features, specifications, and any unique selling points. Prioritize official Mahindra websites and reputable automotive news sources.",
      "reads": [
        "T001"
      ],
      "writes": [
        "T002"
      ],
      "status": "failed",
      "output": null,
      "error": "Code execution failed: Code execution failed: All code variants failed. Errors: CODE_1: JSONDecodeError: Expecting property name enclosed in double quotes: line 1 column 3 (char 2)",
      "cost": 0.0,
      "start_time": "2025-07-17T14:02:00.265793",
      "end_time": "2025-07-17T14:02:04.118915",
      "execution_time": 3.853122
    },
    {
      "id": "T003",
      "description": "Synthesize the extracted feature information into a structured report using FormatterAgent.",
      "agent": "FormatterAgent",
      "agent_prompt": "Synthesize the extracted feature information from the output of T002 into a well-structured report. The report should include a summary of key features, specifications, and any unique selling points of Mahindra XUV 3XO. Use appropriate headings, subheadings, and bullet points to organize the information clearly. Create the report in HTML format.",
      "reads": [
        "T002"
      ],
      "writes": [
        "T003"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    }
  ],
  "links": [
    {
      "source": "ROOT",
      "target": "T001"
    },
    {
      "source": "T001",
      "target": "T002"
    },
    {
      "source": "T002",
      "target": "T003"
    }
  ]
}