{
  "directed": true,
  "multigraph": false,
  "graph": {
    "session_id": "51471167",
    "original_query": "I am running a real test for which you need to write a plan. First call retreiverAgent, and ask it to call 'search_web_with_text_content' for 'Ola Electric' and save the data. Then you need to call FormatterAgent and ask it create 1 page report (ask it to not call self), and then stop.",
    "file_manifest": [],
    "created_at": "2025-07-02T15:46:07.239699",
    "status": "running",
    "output_chain": {
      "T001": {
        "ola_electric": [
          {
            "type": "text",
            "text": "[{'url': 'https://tracxn.com/d/companies/ola-electric/__6IJkJRdLTLqpbr0U9y9iAZUrtZVZC1HCfmjdnQe6edo', 'content': \"Ola Electric - 2025 Company Profile, Team, Funding, Competitors & Financials - Tracxn JavaScript is disabled in your browser. enable it to enjoy the full features of Tracxn. Your browser was unable to load all of Tracxn resources. They may have been blocked by your firewall, proxy or browser configuration. Press Ctrl+F5 or Ctrl+Shift+R to have your browser try again and if that doesn't work, click here to retry or mail us at hi@tracxn.com Internal Server Error Get Started. It's FREE! Toggle navigation Get Started. It's FREE! Customers Offerings Company Close Customers Offerings Company Pricing Login Investment Industry Venture Capital Funds Private Equity Funds Accelerators & Incubators Investment Banks Corporates and Startups Corp Dev and M&A Teams Corporate Innovation Startup Founders Sales Team Ecosystem Journalists and Publications Universities Rich Data Sets Companies Investors Funding Acquisitions Financials Cap Tables Employee Count Deep Dives Company deep-dive Investor deep-dive Activity by Corporates Sector Coverage Workflow Solutions Sourcing new deals Tracking Market Updates Portfolio Management Deal Flow CRM LiveDeals And Much More... Data Solutions Reports by Tracxn Enterprise Grade Support Sector Coverage Apps & Extensions Try our premium features for FREE - no threads attached! Learn More Get Started. Its FREE Our Investors Media & Newsroom Careers Contact Us Ola Electric - Company Profile Last updated: June 21, 2025 Claim Profile Suggest Edits Linkedin Twitter Facebook Email Copy Url Claim Profile Suggest Edits Request page removal Overview Funding & Investors Latest Shareholding Competitors Landscape Comparables Historical Cap Tables Historical Financials All Related Reports Ola Electric - About the company Ola Electric is a public company based in Bengaluru (India), founded in 2017 by Bhavish Aggarwal , Anand Shah and Ankit Jain . It operates as a Manufacturer of electric scooters and motorcycles . Ola Electric has raised $1B in funding from investors like Edelweiss , SoftBank and Tiger Global Management . The company has 1253 active competitors, including 79 funded and 29 that have exited . Its top competitor s include companies like Ather Energy , BGauss and Niu . Sectors and market segments that Ola Electric operate in Ola Electric serves in the B2C space in the Energy Tech , Auto Tech market segments. The primary business model of Ola Electric are : Energy Tech > Electric Vehicles > ***** **** > ***** ****** Auto Tech > Electric Vehicles > ***** **** > ***** ****** Company Details Manufacturer of electric scooters and motorcycles. The company designs, manufactures, and sells a range of electric two-wheelers for personal and commercial use. These vehicles are offered in various models with differing performance specifications and price points. The company also provides related services such as maintenance and repair. A focus on technological innovation is evident in the design and manufacturing processes. Website www.olaelectric.com/ Social Email ID *****@olaelectric.com Phone Number +91 ********** Part Of olacabs.com Registered Address Wing C, Prestige RMZ Startech, Hosur Road, Municipal Ward No.67, Municipal No. 140, Koramangala VI Bk, Bangalore, Bangalore South, Karnataka, India, 560095 Key Metrics Founded Year 2017 Location Bengaluru, India Stage Public Total Funding $1B in 14 rounds Latest Funding Round Conventional Debt, Jun 12, 2024 , $12M Investors Edelweiss & 67 more Ranked 1 st among 1253 active competitors Annual Revenue 5,240Cr as on Mar 31, 2024 Employee Count 3,612 as on Apr 30, 2025 Investment & Acquisitions StoreDot & 1 more Similar Companies Ather Energy & 579 more Exit Details Public Legal entities associated with Ola Electric Ola Electric is associated with 3 legal entit ies given below: Ola Electric Mobility Limited CIN: L74999KA2017PLC099619 Location: India Current Status: Active Date of Incorporation: Feb 03, 2017 Revenue: $633M (as on Mar 31, 2024) Latest Employee Count: 5 (as on Ap\", 'images': [{'url': 'https://i.tracxn.com/tracxn-data-attachments/report/thumbnail/image/Electric_Vehicles_-_Feed_Report_fd062de9-b052-4cea-9504-dcaecdd985c2.jpg?width=350', 'alt_text': 'An image depicting Electric Vehicles - Sector Report', 'class': 'txn--seo-companies__report-img txn--full-height txn--full-width txn--border-top-right-radius-sm txn--border-top-left-radius-sm', 'loading': 'lazy', 'confidence': 0.7}], 'rank': 1}, {'url': 'https://www.crunchbase.com/organization/ola-electric/investor_financials', 'content': 'Attention Required! | Cloudflare Please enable cookies. Sorry, you have been blocked You are unable to access crunchbase.com Why have I been blocked? This website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data. What can I do to resolve this? You can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page. Cloudflare Ray ID: 958f467bfd217eb8 Your IP: Click to reveal 49.206.26.171 Performance & security by Cloudflare', 'images': [], 'rank': 2}, {'url': 'https://www.cbinsights.com/company/ola-electric-mobility/financials', 'content': \"Ola Electric Stock Price, Funding, Valuation, Revenue & Financial Statements Technology Vendors Recent Research Newsletter Media Support Login Who We Serve Function Corporate Strategy Corporate Venture Capital Venture Capital IT Corporate Innovation How VCs Use CB Insights Go to the video gallery Industries Consumer & Retail Tech Insurance Healthcare Industrials Financial Services Professional Services Professional Services Learn More Success Stories How We Help Understand Tech Markets Anticipate Competitor Strategy Determine Tech Strategy Connect with Tech Vendors & Partners Turbocharge Digital Transformation What We Offer Platform Overview Technology Search Engine Market Analytics and Visualizations Team Management and Collaboration Platform Overview Learn More Data Research Personal Briefing GenAI Instant Insights Public Equity Data Buyer Interview Transcripts Analyst Briefings API & Data Feeds Integrations Overview Chrome and Edge Salesforce Affinity Microsoft Excel Google Sheets Microsoft Teams Slack Google Slides App Partners Browser Extension Pricing About Us Overview Our teams Business Development Engineering Operations Product See all Open Jobs Loading... Ola Electric Unclaimed olaelectric.com Overview & Products Financials Alternatives & Competitors Total Raised $1.569B Investors Count 26 Deal Terms 5 Investments 1 Funding, Valuation & Revenue 15 Fundings Ola Electric has raised $1.569B over 15 rounds . Ola Electric's latest funding round was a IPO for $732.16M on August 9, 2024 . Ola Electric's valuation in September 2023 was $5,400 - $5,500M . Date Round Amount Investors Valuation Valuations are submitted by companies, mined from state filings or news, provided by VentureSource, or based on a comparables valuation model. Revenue Sources 8/9/2024 IPO $732.16M Public $XXM 0 FY undefined 7 6/11/2024 Debt - IV $11.97M Alteria Capital $XXM 0 FY undefined 1 4/1/2024 Debt - III $50M EvolutionX Debt Capital $XXM 0 FY undefined 3 10/26/2023 Debt - II $XXM Subscribe to see more $XXM 0 FY undefined 10 9/6/2023 Series E $XXM Subscribe to see more $5,400 - $5,500M 0 FY undefined 10 Date 8/9/2024 6/11/2024 4/1/2024 10/26/2023 9/6/2023 Round IPO Debt - IV Debt - III Debt - II Series E Amount $732.16M $11.97M $50M $XXM $XXM Investors Public Alteria Capital EvolutionX Debt Capital Subscribe to see more Subscribe to see more Valuation $XXM $XXM $XXM $XXM $5,400 - $5,500M Revenue 0 FY undefined 0 FY undefined 0 FY undefined 0 FY undefined 0 FY undefined Sources 7 1 3 10 10 Learn more by requesting a demo Ola Electric Deal Terms 5 Deal Terms Ola Electric's deal structure is available for 5 funding rounds , including their Series E from September 06, 2023 . Round Series E Series D Series C - II Series C Series B Funding Date $XXM $XXM $XXM $XXM $XXM Pre-Money Valuation $XXM $XXM $XXM $XXM $XXM Post-Money Valuation $XXM $XXM $XXM $XXM $XXM Amount Raised $XXM $XXM $XXM $XXM $XXM Shares Authorized Issuance Price Dividend Rate Liquidation Preferences Liquidation Price Participation Conversion Price Anti Dilution General Voting $XXM $XXM $XXM $XXM $XXM Board Voting $XXM $XXM $XXM $XXM $XXM Par Value Round Funding Date Pre-Money Valuation Post-Money Valuation Amount Raised Shares Authorized Issuance Price Dividend Rate Liquidation Preferences Liquidation Price Participation Conversion Price Anti Dilution General Voting Board Voting Par Value Series E $XXM $XXM $XXM $XXM $XXM $XXM Series D $XXM $XXM $XXM $XXM $XXM $XXM Series C - II $XXM $XXM $XXM $XXM $XXM $XXM Series C $XXM $XXM $XXM $XXM $XXM $XXM Series B $XXM $XXM $XXM $XXM $XXM $XXM Learn more by requesting a demo Ola Electric Investors 26 Investors Ola Electric has 26 investors . Alteria Capital invested in Ola Electric's Debt - IV funding round . First funding Last Funding Investor Rounds Board Seats Type Location 6/11/2024 6/11/2024 Alteria Capital 1 Debt - IV Debt & Specialty Finance India 4/1/2024 4/1/2024 EvolutionX Debt Capital 1 Debt - III Debt & Specialty Finance Singapor\", 'images': [{'url': 'https://public-pages.cbinsights.com/public-site/555112/_next/static/public/images/VC_Persona_Videos.png?w=640&q=75', 'alt_text': 'Featured Item', 'width': '300', 'height': '181', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://public-pages.cbinsights.com/public-site/555112/_next/static/public/images/professionalservices.png?w=640&q=75', 'alt_text': 'Featured Item', 'width': '300', 'height': '181', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://public-pages.cbinsights.com/public-site/555112/_next/static/public/images/investment_chart.png?w=1920&q=75', 'alt_text': 'investments chart', 'width': '928', 'height': '540', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://s3-us-west-2.amazonaws.com/cbi-image-service-prd/modified/999765ca-4599-4b1b-8e10-53206dc41385.png?w=3840', 'alt_text': 'Ola Electric company logo', 'class': 'my-auto h-[80px] w-[80px] rounded-2xl sm:h-[90px] sm:w-[90px]', 'loading': 'lazy', 'confidence': 0.7}, {'url': 'https://no-cache.hubspot.com/cta/default/763793/55926c7d-e7c1-4c17-8ceb-37665ca53a2f.png', 'alt_text': 'Start free trial', 'class': 'hs-cta-img', 'confidence': 0.7}], 'rank': 3}, {'url': 'https://pitchbook.com/profiles/company/265813-57', 'content': 'Products Solutions Data News & Analysis About Blog Log in Request a free trial Ola Electric This is a profile preview from the PitchBook Platform. Request a free trial Overview Timeline Stock Performance Financials Summary Earnings Call Transcripts Valuation & Funding Equity Research (Morningstar) Cap Table VC Exit Predictor Comparisons Competitors Research & Analysis Related News Patents Signals Investors Acquisitions ESG Exits Affiliates FAQs Data Transparency Ola Electric Overview Update this profile Year Founded 2017 Status Public Employees 7,369 Stock Symbol OLAELEC Investments 2 Share Price $0.49 (As of Tuesday Closing) Ola Electric General Information Description Ola Electric Mobility Ltd is a pure EV player in India and is building vertically integrated technology and manufacturing capabilities for EVs and EV components, including cells. The company manufactures EVs and certain core EV components like battery packs, motors and vehicle frames at the Ola Futurefactory. Its business focuses on capturing the opportunity arising out of electrification of mobility in India and it also seeks opportunities to export its EVs in select international markets in the future. Contact Information Website www.olaelectric.com Formerly Known As Ola Electric Mobility Private Limited Ownership Status Publicly Held Financing Status Formerly VC-backed Primary Industry Application Software Other Industries Automotive Stock Exchange NSE Vertical(s) CleanTech, Mobility Tech, Manufacturing, Car-Sharing Corporate Office 17th Main, 100 Feet Road Koramangala Regent Insignia, Number 414, 3rd Floor 4th Block Bangalore, Karnataka 560034 India +91 080   Ola Electric Timeline 2022 2023 2024 2025 Financing Round Captured Employee Count Estimated Employee Growth Want detailed data on 3M+ companies? What you see here scratches the surface Request a free trial Want to dig into this profile? Well help you find what you need Learn more Ola Electric Stock Performance As of 01-Jul-2025, Ola Electrics stock price is $0.49. Its current market cap is $2.05B with 4.18B shares. (As of Tuesday Closing) Stock Price\\tPrevious Close\\t52 wk Range\\tMarket Cap\\tShares\\tAverage Volume\\tEPS $0.49\\t$0.51\\t$0.49 - $1.88\\t$2.05B\\t4.18B\\t33.4M\\t-$0.06 Ola Electric Financials Summary As of 31-Mar-2025, Ola Electric has a trailing 12-month revenue of $534M. In Thousands, USD\\t TTM 31-Mar-2025 \\t FY 2025 31-Mar-2025 \\t FY 2024 31-Mar-2024 \\t FY 2023 31-Mar-2023 EV\\t2,177,286\\t2,177,286\\t\\t Revenue\\t533,861\\t533,861\\t605,176\\t323,854 EBITDA\\t(158,952)\\t(158,952)\\t(125,625)\\t(161,474) Net Income\\t(269,178)\\t(269,178)\\t(191,337)\\t(183,327) Total Assets\\t1,294,727\\t1,294,727\\t927,579\\t678,819 Total Debt\\t415,715\\t415,715\\t325,013\\t206,547 Public Fundamental Data provided by Morningstar, Inc. disclaimer Ola Electric Valuation & Funding Deal Type\\tDate\\tAmount\\tValuation/ EBITDA\\tPost-Val\\tStatus\\tDebt This information is available in the PitchBook Platform. To explore Ola Electrics full profile, request access. Request a free trial Ola Electric Cap Table Stock\\t# of Shares Authorized\\tPar Value\\tDividend Rate (%)\\tOriginal Issue Price\\tLiquidation\\tLiquidation Pref. Multiple\\tConversion Price\\t% Owned This information is available in the PitchBook Platform. To explore Ola Electrics full profile, request access. Request a free trial Ola Electric Comparisons Description Primary Industry HQ Location Employees Total Raised Post Valuation Last Financing Details Ola Electric Mobility Ltd is a pure EV player in India and is building vertically integrated technology and manufacturin Application Software Bangalore, India 7,369 As of2024 San Francisco, CA New Delhi, India Add Comparison PitchBooks comparison feature gives you a side-by-side look at key metrics for similar companies. Personalize which data points you want to see and create visualizations instantly. Request a free trial Ola Electric Competitors (9) One of Ola Electrics 9 competitors is Lime, a Venture Capital-Backed company based in San Francisco, CA. Compa', 'images': [], 'rank': 4}, {'url': 'https://www.olaelectric.com/investor-relations/financials', 'content': \"Investor Relations Financials Introducing Roadster X, the future of motorcycling. Starts at an introductory price of 99,999. Book yours today . Ola S1 Pro+ Starting at 1,48,999 Ola S1 X+ Starting at 1,09,999 Ola S1 Z Starting from 59,999 Ola Gig Starting from 39,999 More for S1 Order now Test Ride Accessories View in 360 Calculate EMI Roadster X Starts at 99,999 Roadster X+ Starts at 1,29,999 Roadster Starts at 1,04,999 More for Roadster Book Now The store will not work correctly when cookies are disabled. JavaScript seems to be disabled in your browser. For the best experience on our site, be sure to turn on Javascript in your browser. We use cookies to ensure that we give you the best experience. Learn more . Got It Skip to Content Sign In Create an Account Toggle Nav Home Financials Governance View All Policies Board Shareholder Info View All Disclosures under Regulation 46 of LODR Announcements News & Events My Orders No orders available! Order Now! Scooters View All Ola S1 Pro+ Ola S1 Pro Ola S1 X+ Ola S1 X Motorcycles View All Roadster X+ Roadster X Roadster Roadster Pro Accessories Our Company View All About Us Investor Relations News & Events Blogs Careers Partner with us Tech & Design View All Software Cell Tech Manufacturing Engineering Design Ownership View All Electric Store 4000 Stores Hypercharger Community Referrals Hyperservice Battery Warranty Emi Calculator Break All Barriers Charger Refund Home Financials Governance View All Policies Board Shareholder Info View All Disclosures under Regulation 46 of LODR Announcements News & Events Ola S1 Pro+ Gen3 Ola S1 Pro Gen3 Ola S1 X Gen3 Ola S1 Z Ola Gig Roadster X+ New Roadster X New Roadster Tech & Design Cell Tech Manufacturing Design Ownership Electric Store Hypercharger Community Referrals Hyperservice Battery Warranty Emi Calculator Break All Barriers Accessories Charger Refund Our Company About Us Investor Relations News & Events Blogs Careers Partner with us Account Sign in My orders Sign Out Support Sign in Sign Out Support Blog My Cart Search Search Advanced Search Search Compare Products Menu Account Game-changing digital experience Game-changing digital experience Financials Quarterly Results Archives Year & Qtr FY 24-25 Q4 Earnings Release INR Shareholders' Letter PDF KPI Databook XLS Earnings Call & Transcript Listen PDF Financial Results PDF Shareholding Pattern PDF Year & Qtr FY 24-25 Q3 Earnings Release INR Shareholders' Letter PDF KPI Databook XLS Earnings Call & Transcript Listen PDF Financial Results PDF Shareholding Pattern PDF Year & Qtr FY 24-25 Q2 Earnings Release INR Shareholders' Letter PDF KPI Databook XLS Earnings Call & Transcript Listen PDF Financial Results PDF Shareholding Pattern PDF Year & Qtr FY 24-25 Q1 Earnings Release INR Shareholders' Letter PDF KPI Databook NA Earnings Call & Transcript Listen PDF Financial Results PDF Shareholding Pattern NA Audited financial results FY 21 FY 22 FY 23 FY 24 Annual Returns FY 21 FY 22 FY 23 FY 24 Investor Relations Financials Products Ola S1 Pro+ Ola S1 Pro Ola S1 X+ Ola S1 X Ola Gig Ola S1 Z Roadster X+ Roadster X Roadster Roadster Pro Tech & Design Software Cell Tech Manufacturing Performance Design Gigafactory Future Factory Ownership Ola Electric Store 4000 Stores Hypercharger Accessories Community Referrals Hyperservice Battery Warranty Company About Us Investor Newsroom Blogs Careers Krutrim Dealership For investor queries, please write to us at: ir@olaelectric.com Call : 080 6896 4050 08068964050 Copyright 2024 Ola Electric Mobility Ltd. All Rights Reserved. Are you interested in getting an Ola Vehicle? Name +91 Which model are you interested in? S1 Pro/Pro+ S1X/X+ Roadster X/X+ Roadster Pro/Pro+ Others Not Decided Get updates on Whatsapp Proceed Your callback is scheduled You should recieve a call from us soon Got someone in mind? Refer Now. Enter the OTP sent to Didn't get the OTP? Resend Please enter a valid OTP Submit Thanks! Lead submitted. Please answer a few quick questions. When\", 'images': [{'url': 'https://cdn.olaelectric.com/ev-discovery-platform/wysiwyg/popup_close_btn.webp', 'alt_text': 'Popup Close Btn', 'class': 'interested-close close-btn', 'loading': 'lazy', 'confidence': 0.7}, {'url': 'https://cdn.olaelectric.com/ev-discovery-platform/degree/close_popup_image.webp', 'alt_text': 'Subscribe PopUp Image', 'confidence': 0.7}], 'rank': 5}, {'url': 'https://www.moneycontrol.com/news/business/earnings/ola-electric-reports-rs-2782-cr-revenue-in-fy23-targets-ebitda-profitability-by-fy25-11860181.html', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://www.clay.com/dossier/ola-electric-funding', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://www.fortuneindia.com/business-news/ola-electric-q4-losses-surge-2x-to-870-cr-revenue-dips-62/123558', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null
          }
        ]
      },
      "T002": {
        "output": {
          "final_format": "html",
          "images": [
            {
              "url": "https://i.tracxn.com/tracxn-data-attachments/report/thumbnail/image/Electric_Vehicles_-_Feed_Report_fd062de9-b052-4cea-9504-dcaecdd985c2.jpg?width=350",
              "alt_text": "An image depicting Electric Vehicles - Sector Report"
            },
            {
              "url": "https://public-pages.cbinsights.com/public-site/555112/_next/static/public/images/VC_Persona_Videos.png?w=640&q=75",
              "alt_text": "Featured Item"
            },
            {
              "url": "https://public-pages.cbinsights.com/public-site/555112/_next/static/public/images/professionalservices.png?w=640&q=75",
              "alt_text": "Featured Item"
            },
            {
              "url": "https://public-pages.cbinsights.com/public-site/555112/_next/static/public/images/investment_chart.png?w=1920&q=75",
              "alt_text": "investments chart"
            },
            {
              "url": "https://s3-us-west-2.amazonaws.com/cbi-image-service-prd/modified/999765ca-4599-4b1b-8e10-53206dc41385.png?w=3840",
              "alt_text": "Ola Electric company logo"
            }
          ],
          "fallback_markdown": "Report on Ola Electric.",
          "reasoning": "I created a one-page report on Ola Electric based on the data retrieved. The report includes an executive summary, company overview, funding details, operational highlights, and key observations, formatted in a concise and visually appealing manner.",
          "formatted_report_T002": "<div class='report'><h1 style='text-align: center;'>Ola Electric: Executive Summary</h1><div id='executive-summary'><h2>🎯 Executive Summary</h2><p>Ola Electric, founded in 2017, is a prominent Indian electric vehicle (EV) manufacturer based in Bengaluru. The company focuses on designing, manufacturing, and selling electric scooters and motorcycles for both personal and commercial use. With a total funding of $1B across 14 rounds, Ola Electric has rapidly grown to become a key player in the Indian EV market. Key investors include SoftBank, Tiger Global Management, and Edelweiss.</p><img src='https://i.tracxn.com/tracxn-data-attachments/report/thumbnail/image/Electric_Vehicles_-_Feed_Report_fd062de9-b052-4cea-9504-dcaecdd985c2.jpg?width=350' alt='An image depicting Electric Vehicles - Sector Report' style='max-width: 400px; margin: 10px 0;'><p>The company's financials show a strong revenue of 5,240Cr as of March 31, 2024, despite incurring losses. Ola Electric went public on August 9, 2024, raising $732.16M through an IPO. The stock price as of July 1, 2025, is $0.49, with a market capitalization of $2.05B.</p></div><div id='company-overview'><h2>🏢 Company Overview</h2><p>Ola Electric operates as a manufacturer of electric scooters and motorcycles, offering various models with differing performance specifications and price points. The company also provides related services such as maintenance and repair. Ola Electric is associated with three legal entities, including Ola Electric Mobility Limited.</p></div><div id='funding-details'><h2>💰 Funding Details</h2><img src='https://public-pages.cbinsights.com/public-site/555112/_next/static/public/images/investment_chart.png?w=1920&q=75' alt='investments chart' style='max-width: 400px; margin: 10px 0;'><p>Ola Electric has raised $1B in funding across 14 rounds. Key funding rounds include a recent IPO on August 9, 2024, raising $732.16M and a conventional debt round of $12M on June 12, 2024, from Edelweiss and others.  The company's valuation in September 2023 was between $5.4B and $5.5B.</p></div><div id='operational-highlights'><h2>⚙️ Operational Highlights</h2><p>As of April 30, 2025, Ola Electric has 3,612 employees.  The company's annual revenue as of March 31, 2024, was 5,240Cr. Ola Electric competes with 1253 active competitors, including Ather Energy and BGauss. The company's business model operates in the B2C space within the Energy Tech and Auto Tech market segments.</p><img src='https://s3-us-west-2.amazonaws.com/cbi-image-service-prd/modified/999765ca-4599-4b1b-8e10-53206dc41385.png?w=3840' alt='Ola Electric company logo' style='max-width: 400px; margin: 10px 0;'></div><div id='key-observations'><h2>💡 Key Observations</h2><ul><li><b>Market Position:</b> Ola Electric is ranked 1st among 1253 active competitors.</li><li><b>Financial Performance:</b> Strong revenue figures but with ongoing losses.</li><li><b>Future Outlook:</b> Focus on technological innovation and expansion in the EV market.</li></ul><img src='https://public-pages.cbinsights.com/public-site/555112/_next/static/public/images/VC_Persona_Videos.png?w=640&q=75' alt='Featured Item' style='max-width: 400px; margin: 10px 0;'></div></div>"
        },
        "call_self": false,
        "cost": 0.001481175,
        "input_tokens": 7210.5,
        "output_tokens": 666.0,
        "total_tokens": 7876.5
      }
    },
    "validation_results": {
      "is_valid": true,
      "is_dag": true,
      "cycles": [],
      "disconnected_components": [],
      "orphaned_nodes": [],
      "root_nodes": [],
      "leaf_nodes": [
        "T002"
      ],
      "warnings": [],
      "errors": []
    }
  },
  "nodes": [
    {
      "description": "Initial Query",
      "agent": "System",
      "status": "completed",
      "id": "ROOT"
    },
    {
      "id": "T001",
      "description": "Retrieve data about Ola Electric using the 'search_web_with_text_content' tool.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Use the 'search_web_with_text_content' tool to gather comprehensive data about Ola Electric. Save the retrieved data for subsequent analysis and report generation.",
      "reads": [],
      "writes": [
        "T001"
      ],
      "status": "completed",
      "output": {
        "ola_electric": [
          {
            "type": "text",
            "text": "[{'url': 'https://tracxn.com/d/companies/ola-electric/__6IJkJRdLTLqpbr0U9y9iAZUrtZVZC1HCfmjdnQe6edo', 'content': \"Ola Electric - 2025 Company Profile, Team, Funding, Competitors & Financials - Tracxn JavaScript is disabled in your browser. enable it to enjoy the full features of Tracxn. Your browser was unable to load all of Tracxn resources. They may have been blocked by your firewall, proxy or browser configuration. Press Ctrl+F5 or Ctrl+Shift+R to have your browser try again and if that doesn't work, click here to retry or mail us at hi@tracxn.com Internal Server Error Get Started. It's FREE! Toggle navigation Get Started. It's FREE! Customers Offerings Company Close Customers Offerings Company Pricing Login Investment Industry Venture Capital Funds Private Equity Funds Accelerators & Incubators Investment Banks Corporates and Startups Corp Dev and M&A Teams Corporate Innovation Startup Founders Sales Team Ecosystem Journalists and Publications Universities Rich Data Sets Companies Investors Funding Acquisitions Financials Cap Tables Employee Count Deep Dives Company deep-dive Investor deep-dive Activity by Corporates Sector Coverage Workflow Solutions Sourcing new deals Tracking Market Updates Portfolio Management Deal Flow CRM LiveDeals And Much More... Data Solutions Reports by Tracxn Enterprise Grade Support Sector Coverage Apps & Extensions Try our premium features for FREE - no threads attached! Learn More Get Started. Its FREE Our Investors Media & Newsroom Careers Contact Us Ola Electric - Company Profile Last updated: June 21, 2025 Claim Profile Suggest Edits Linkedin Twitter Facebook Email Copy Url Claim Profile Suggest Edits Request page removal Overview Funding & Investors Latest Shareholding Competitors Landscape Comparables Historical Cap Tables Historical Financials All Related Reports Ola Electric - About the company Ola Electric is a public company based in Bengaluru (India), founded in 2017 by Bhavish Aggarwal , Anand Shah and Ankit Jain . It operates as a Manufacturer of electric scooters and motorcycles . Ola Electric has raised $1B in funding from investors like Edelweiss , SoftBank and Tiger Global Management . The company has 1253 active competitors, including 79 funded and 29 that have exited . Its top competitor s include companies like Ather Energy , BGauss and Niu . Sectors and market segments that Ola Electric operate in Ola Electric serves in the B2C space in the Energy Tech , Auto Tech market segments. The primary business model of Ola Electric are : Energy Tech > Electric Vehicles > ***** **** > ***** ****** Auto Tech > Electric Vehicles > ***** **** > ***** ****** Company Details Manufacturer of electric scooters and motorcycles. The company designs, manufactures, and sells a range of electric two-wheelers for personal and commercial use. These vehicles are offered in various models with differing performance specifications and price points. The company also provides related services such as maintenance and repair. A focus on technological innovation is evident in the design and manufacturing processes. Website www.olaelectric.com/ Social Email ID *****@olaelectric.com Phone Number +91 ********** Part Of olacabs.com Registered Address Wing C, Prestige RMZ Startech, Hosur Road, Municipal Ward No.67, Municipal No. 140, Koramangala VI Bk, Bangalore, Bangalore South, Karnataka, India, 560095 Key Metrics Founded Year 2017 Location Bengaluru, India Stage Public Total Funding $1B in 14 rounds Latest Funding Round Conventional Debt, Jun 12, 2024 , $12M Investors Edelweiss & 67 more Ranked 1 st among 1253 active competitors Annual Revenue 5,240Cr as on Mar 31, 2024 Employee Count 3,612 as on Apr 30, 2025 Investment & Acquisitions StoreDot & 1 more Similar Companies Ather Energy & 579 more Exit Details Public Legal entities associated with Ola Electric Ola Electric is associated with 3 legal entit ies given below: Ola Electric Mobility Limited CIN: L74999KA2017PLC099619 Location: India Current Status: Active Date of Incorporation: Feb 03, 2017 Revenue: $633M (as on Mar 31, 2024) Latest Employee Count: 5 (as on Ap\", 'images': [{'url': 'https://i.tracxn.com/tracxn-data-attachments/report/thumbnail/image/Electric_Vehicles_-_Feed_Report_fd062de9-b052-4cea-9504-dcaecdd985c2.jpg?width=350', 'alt_text': 'An image depicting Electric Vehicles - Sector Report', 'class': 'txn--seo-companies__report-img txn--full-height txn--full-width txn--border-top-right-radius-sm txn--border-top-left-radius-sm', 'loading': 'lazy', 'confidence': 0.7}], 'rank': 1}, {'url': 'https://www.crunchbase.com/organization/ola-electric/investor_financials', 'content': 'Attention Required! | Cloudflare Please enable cookies. Sorry, you have been blocked You are unable to access crunchbase.com Why have I been blocked? This website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data. What can I do to resolve this? You can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page. Cloudflare Ray ID: 958f467bfd217eb8 Your IP: Click to reveal 49.206.26.171 Performance & security by Cloudflare', 'images': [], 'rank': 2}, {'url': 'https://www.cbinsights.com/company/ola-electric-mobility/financials', 'content': \"Ola Electric Stock Price, Funding, Valuation, Revenue & Financial Statements Technology Vendors Recent Research Newsletter Media Support Login Who We Serve Function Corporate Strategy Corporate Venture Capital Venture Capital IT Corporate Innovation How VCs Use CB Insights Go to the video gallery Industries Consumer & Retail Tech Insurance Healthcare Industrials Financial Services Professional Services Professional Services Learn More Success Stories How We Help Understand Tech Markets Anticipate Competitor Strategy Determine Tech Strategy Connect with Tech Vendors & Partners Turbocharge Digital Transformation What We Offer Platform Overview Technology Search Engine Market Analytics and Visualizations Team Management and Collaboration Platform Overview Learn More Data Research Personal Briefing GenAI Instant Insights Public Equity Data Buyer Interview Transcripts Analyst Briefings API & Data Feeds Integrations Overview Chrome and Edge Salesforce Affinity Microsoft Excel Google Sheets Microsoft Teams Slack Google Slides App Partners Browser Extension Pricing About Us Overview Our teams Business Development Engineering Operations Product See all Open Jobs Loading... Ola Electric Unclaimed olaelectric.com Overview & Products Financials Alternatives & Competitors Total Raised $1.569B Investors Count 26 Deal Terms 5 Investments 1 Funding, Valuation & Revenue 15 Fundings Ola Electric has raised $1.569B over 15 rounds . Ola Electric's latest funding round was a IPO for $732.16M on August 9, 2024 . Ola Electric's valuation in September 2023 was $5,400 - $5,500M . Date Round Amount Investors Valuation Valuations are submitted by companies, mined from state filings or news, provided by VentureSource, or based on a comparables valuation model. Revenue Sources 8/9/2024 IPO $732.16M Public $XXM 0 FY undefined 7 6/11/2024 Debt - IV $11.97M Alteria Capital $XXM 0 FY undefined 1 4/1/2024 Debt - III $50M EvolutionX Debt Capital $XXM 0 FY undefined 3 10/26/2023 Debt - II $XXM Subscribe to see more $XXM 0 FY undefined 10 9/6/2023 Series E $XXM Subscribe to see more $5,400 - $5,500M 0 FY undefined 10 Date 8/9/2024 6/11/2024 4/1/2024 10/26/2023 9/6/2023 Round IPO Debt - IV Debt - III Debt - II Series E Amount $732.16M $11.97M $50M $XXM $XXM Investors Public Alteria Capital EvolutionX Debt Capital Subscribe to see more Subscribe to see more Valuation $XXM $XXM $XXM $XXM $5,400 - $5,500M Revenue 0 FY undefined 0 FY undefined 0 FY undefined 0 FY undefined 0 FY undefined Sources 7 1 3 10 10 Learn more by requesting a demo Ola Electric Deal Terms 5 Deal Terms Ola Electric's deal structure is available for 5 funding rounds , including their Series E from September 06, 2023 . Round Series E Series D Series C - II Series C Series B Funding Date $XXM $XXM $XXM $XXM $XXM Pre-Money Valuation $XXM $XXM $XXM $XXM $XXM Post-Money Valuation $XXM $XXM $XXM $XXM $XXM Amount Raised $XXM $XXM $XXM $XXM $XXM Shares Authorized Issuance Price Dividend Rate Liquidation Preferences Liquidation Price Participation Conversion Price Anti Dilution General Voting $XXM $XXM $XXM $XXM $XXM Board Voting $XXM $XXM $XXM $XXM $XXM Par Value Round Funding Date Pre-Money Valuation Post-Money Valuation Amount Raised Shares Authorized Issuance Price Dividend Rate Liquidation Preferences Liquidation Price Participation Conversion Price Anti Dilution General Voting Board Voting Par Value Series E $XXM $XXM $XXM $XXM $XXM $XXM Series D $XXM $XXM $XXM $XXM $XXM $XXM Series C - II $XXM $XXM $XXM $XXM $XXM $XXM Series C $XXM $XXM $XXM $XXM $XXM $XXM Series B $XXM $XXM $XXM $XXM $XXM $XXM Learn more by requesting a demo Ola Electric Investors 26 Investors Ola Electric has 26 investors . Alteria Capital invested in Ola Electric's Debt - IV funding round . First funding Last Funding Investor Rounds Board Seats Type Location 6/11/2024 6/11/2024 Alteria Capital 1 Debt - IV Debt & Specialty Finance India 4/1/2024 4/1/2024 EvolutionX Debt Capital 1 Debt - III Debt & Specialty Finance Singapor\", 'images': [{'url': 'https://public-pages.cbinsights.com/public-site/555112/_next/static/public/images/VC_Persona_Videos.png?w=640&q=75', 'alt_text': 'Featured Item', 'width': '300', 'height': '181', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://public-pages.cbinsights.com/public-site/555112/_next/static/public/images/professionalservices.png?w=640&q=75', 'alt_text': 'Featured Item', 'width': '300', 'height': '181', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://public-pages.cbinsights.com/public-site/555112/_next/static/public/images/investment_chart.png?w=1920&q=75', 'alt_text': 'investments chart', 'width': '928', 'height': '540', 'loading': 'lazy', 'confidence': 0.8999999999999999}, {'url': 'https://s3-us-west-2.amazonaws.com/cbi-image-service-prd/modified/999765ca-4599-4b1b-8e10-53206dc41385.png?w=3840', 'alt_text': 'Ola Electric company logo', 'class': 'my-auto h-[80px] w-[80px] rounded-2xl sm:h-[90px] sm:w-[90px]', 'loading': 'lazy', 'confidence': 0.7}, {'url': 'https://no-cache.hubspot.com/cta/default/763793/55926c7d-e7c1-4c17-8ceb-37665ca53a2f.png', 'alt_text': 'Start free trial', 'class': 'hs-cta-img', 'confidence': 0.7}], 'rank': 3}, {'url': 'https://pitchbook.com/profiles/company/265813-57', 'content': 'Products Solutions Data News & Analysis About Blog Log in Request a free trial Ola Electric This is a profile preview from the PitchBook Platform. Request a free trial Overview Timeline Stock Performance Financials Summary Earnings Call Transcripts Valuation & Funding Equity Research (Morningstar) Cap Table VC Exit Predictor Comparisons Competitors Research & Analysis Related News Patents Signals Investors Acquisitions ESG Exits Affiliates FAQs Data Transparency Ola Electric Overview Update this profile Year Founded 2017 Status Public Employees 7,369 Stock Symbol OLAELEC Investments 2 Share Price $0.49 (As of Tuesday Closing) Ola Electric General Information Description Ola Electric Mobility Ltd is a pure EV player in India and is building vertically integrated technology and manufacturing capabilities for EVs and EV components, including cells. The company manufactures EVs and certain core EV components like battery packs, motors and vehicle frames at the Ola Futurefactory. Its business focuses on capturing the opportunity arising out of electrification of mobility in India and it also seeks opportunities to export its EVs in select international markets in the future. Contact Information Website www.olaelectric.com Formerly Known As Ola Electric Mobility Private Limited Ownership Status Publicly Held Financing Status Formerly VC-backed Primary Industry Application Software Other Industries Automotive Stock Exchange NSE Vertical(s) CleanTech, Mobility Tech, Manufacturing, Car-Sharing Corporate Office 17th Main, 100 Feet Road Koramangala Regent Insignia, Number 414, 3rd Floor 4th Block Bangalore, Karnataka 560034 India +91 080   Ola Electric Timeline 2022 2023 2024 2025 Financing Round Captured Employee Count Estimated Employee Growth Want detailed data on 3M+ companies? What you see here scratches the surface Request a free trial Want to dig into this profile? Well help you find what you need Learn more Ola Electric Stock Performance As of 01-Jul-2025, Ola Electrics stock price is $0.49. Its current market cap is $2.05B with 4.18B shares. (As of Tuesday Closing) Stock Price\\tPrevious Close\\t52 wk Range\\tMarket Cap\\tShares\\tAverage Volume\\tEPS $0.49\\t$0.51\\t$0.49 - $1.88\\t$2.05B\\t4.18B\\t33.4M\\t-$0.06 Ola Electric Financials Summary As of 31-Mar-2025, Ola Electric has a trailing 12-month revenue of $534M. In Thousands, USD\\t TTM 31-Mar-2025 \\t FY 2025 31-Mar-2025 \\t FY 2024 31-Mar-2024 \\t FY 2023 31-Mar-2023 EV\\t2,177,286\\t2,177,286\\t\\t Revenue\\t533,861\\t533,861\\t605,176\\t323,854 EBITDA\\t(158,952)\\t(158,952)\\t(125,625)\\t(161,474) Net Income\\t(269,178)\\t(269,178)\\t(191,337)\\t(183,327) Total Assets\\t1,294,727\\t1,294,727\\t927,579\\t678,819 Total Debt\\t415,715\\t415,715\\t325,013\\t206,547 Public Fundamental Data provided by Morningstar, Inc. disclaimer Ola Electric Valuation & Funding Deal Type\\tDate\\tAmount\\tValuation/ EBITDA\\tPost-Val\\tStatus\\tDebt This information is available in the PitchBook Platform. To explore Ola Electrics full profile, request access. Request a free trial Ola Electric Cap Table Stock\\t# of Shares Authorized\\tPar Value\\tDividend Rate (%)\\tOriginal Issue Price\\tLiquidation\\tLiquidation Pref. Multiple\\tConversion Price\\t% Owned This information is available in the PitchBook Platform. To explore Ola Electrics full profile, request access. Request a free trial Ola Electric Comparisons Description Primary Industry HQ Location Employees Total Raised Post Valuation Last Financing Details Ola Electric Mobility Ltd is a pure EV player in India and is building vertically integrated technology and manufacturin Application Software Bangalore, India 7,369 As of2024 San Francisco, CA New Delhi, India Add Comparison PitchBooks comparison feature gives you a side-by-side look at key metrics for similar companies. Personalize which data points you want to see and create visualizations instantly. Request a free trial Ola Electric Competitors (9) One of Ola Electrics 9 competitors is Lime, a Venture Capital-Backed company based in San Francisco, CA. Compa', 'images': [], 'rank': 4}, {'url': 'https://www.olaelectric.com/investor-relations/financials', 'content': \"Investor Relations Financials Introducing Roadster X, the future of motorcycling. Starts at an introductory price of 99,999. Book yours today . Ola S1 Pro+ Starting at 1,48,999 Ola S1 X+ Starting at 1,09,999 Ola S1 Z Starting from 59,999 Ola Gig Starting from 39,999 More for S1 Order now Test Ride Accessories View in 360 Calculate EMI Roadster X Starts at 99,999 Roadster X+ Starts at 1,29,999 Roadster Starts at 1,04,999 More for Roadster Book Now The store will not work correctly when cookies are disabled. JavaScript seems to be disabled in your browser. For the best experience on our site, be sure to turn on Javascript in your browser. We use cookies to ensure that we give you the best experience. Learn more . Got It Skip to Content Sign In Create an Account Toggle Nav Home Financials Governance View All Policies Board Shareholder Info View All Disclosures under Regulation 46 of LODR Announcements News & Events My Orders No orders available! Order Now! Scooters View All Ola S1 Pro+ Ola S1 Pro Ola S1 X+ Ola S1 X Motorcycles View All Roadster X+ Roadster X Roadster Roadster Pro Accessories Our Company View All About Us Investor Relations News & Events Blogs Careers Partner with us Tech & Design View All Software Cell Tech Manufacturing Engineering Design Ownership View All Electric Store 4000 Stores Hypercharger Community Referrals Hyperservice Battery Warranty Emi Calculator Break All Barriers Charger Refund Home Financials Governance View All Policies Board Shareholder Info View All Disclosures under Regulation 46 of LODR Announcements News & Events Ola S1 Pro+ Gen3 Ola S1 Pro Gen3 Ola S1 X Gen3 Ola S1 Z Ola Gig Roadster X+ New Roadster X New Roadster Tech & Design Cell Tech Manufacturing Design Ownership Electric Store Hypercharger Community Referrals Hyperservice Battery Warranty Emi Calculator Break All Barriers Accessories Charger Refund Our Company About Us Investor Relations News & Events Blogs Careers Partner with us Account Sign in My orders Sign Out Support Sign in Sign Out Support Blog My Cart Search Search Advanced Search Search Compare Products Menu Account Game-changing digital experience Game-changing digital experience Financials Quarterly Results Archives Year & Qtr FY 24-25 Q4 Earnings Release INR Shareholders' Letter PDF KPI Databook XLS Earnings Call & Transcript Listen PDF Financial Results PDF Shareholding Pattern PDF Year & Qtr FY 24-25 Q3 Earnings Release INR Shareholders' Letter PDF KPI Databook XLS Earnings Call & Transcript Listen PDF Financial Results PDF Shareholding Pattern PDF Year & Qtr FY 24-25 Q2 Earnings Release INR Shareholders' Letter PDF KPI Databook XLS Earnings Call & Transcript Listen PDF Financial Results PDF Shareholding Pattern PDF Year & Qtr FY 24-25 Q1 Earnings Release INR Shareholders' Letter PDF KPI Databook NA Earnings Call & Transcript Listen PDF Financial Results PDF Shareholding Pattern NA Audited financial results FY 21 FY 22 FY 23 FY 24 Annual Returns FY 21 FY 22 FY 23 FY 24 Investor Relations Financials Products Ola S1 Pro+ Ola S1 Pro Ola S1 X+ Ola S1 X Ola Gig Ola S1 Z Roadster X+ Roadster X Roadster Roadster Pro Tech & Design Software Cell Tech Manufacturing Performance Design Gigafactory Future Factory Ownership Ola Electric Store 4000 Stores Hypercharger Accessories Community Referrals Hyperservice Battery Warranty Company About Us Investor Newsroom Blogs Careers Krutrim Dealership For investor queries, please write to us at: ir@olaelectric.com Call : 080 6896 4050 08068964050 Copyright 2024 Ola Electric Mobility Ltd. All Rights Reserved. Are you interested in getting an Ola Vehicle? Name +91 Which model are you interested in? S1 Pro/Pro+ S1X/X+ Roadster X/X+ Roadster Pro/Pro+ Others Not Decided Get updates on Whatsapp Proceed Your callback is scheduled You should recieve a call from us soon Got someone in mind? Refer Now. Enter the OTP sent to Didn't get the OTP? Resend Please enter a valid OTP Submit Thanks! Lead submitted. Please answer a few quick questions. When\", 'images': [{'url': 'https://cdn.olaelectric.com/ev-discovery-platform/wysiwyg/popup_close_btn.webp', 'alt_text': 'Popup Close Btn', 'class': 'interested-close close-btn', 'loading': 'lazy', 'confidence': 0.7}, {'url': 'https://cdn.olaelectric.com/ev-discovery-platform/degree/close_popup_image.webp', 'alt_text': 'Subscribe PopUp Image', 'confidence': 0.7}], 'rank': 5}, {'url': 'https://www.moneycontrol.com/news/business/earnings/ola-electric-reports-rs-2782-cr-revenue-in-fy23-targets-ebitda-profitability-by-fy25-11860181.html', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://www.clay.com/dossier/ola-electric-funding', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://www.fortuneindia.com/business-news/ola-electric-q4-losses-surge-2x-to-870-cr-revenue-dips-62/123558', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
            "annotations": null
          }
        ]
      },
      "error": null,
      "cost": 0.0,
      "start_time": "2025-07-02T15:46:07.255711",
      "end_time": "2025-07-02T15:46:48.834088",
      "execution_time": 41.578377,
      "input_tokens": 0,
      "output_tokens": 0,
      "execution_result": null
    },
    {
      "id": "T002",
      "description": "Generate a one-page report summarizing the data retrieved about Ola Electric.",
      "agent": "FormatterAgent",
      "agent_prompt": "Create a concise, one-page report based on the data retrieved in T001 about Ola Electric. Ensure the report is well-structured, visually appealing, and does not call upon itself for further formatting. Focus on key highlights and insights. Aim for executive-level presentation quality.",
      "reads": [
        "T001"
      ],
      "writes": [
        "T002"
      ],
      "status": "completed",
      "output": {
        "output": {
          "final_format": "html",
          "images": [
            {
              "url": "https://i.tracxn.com/tracxn-data-attachments/report/thumbnail/image/Electric_Vehicles_-_Feed_Report_fd062de9-b052-4cea-9504-dcaecdd985c2.jpg?width=350",
              "alt_text": "An image depicting Electric Vehicles - Sector Report"
            },
            {
              "url": "https://public-pages.cbinsights.com/public-site/555112/_next/static/public/images/VC_Persona_Videos.png?w=640&q=75",
              "alt_text": "Featured Item"
            },
            {
              "url": "https://public-pages.cbinsights.com/public-site/555112/_next/static/public/images/professionalservices.png?w=640&q=75",
              "alt_text": "Featured Item"
            },
            {
              "url": "https://public-pages.cbinsights.com/public-site/555112/_next/static/public/images/investment_chart.png?w=1920&q=75",
              "alt_text": "investments chart"
            },
            {
              "url": "https://s3-us-west-2.amazonaws.com/cbi-image-service-prd/modified/999765ca-4599-4b1b-8e10-53206dc41385.png?w=3840",
              "alt_text": "Ola Electric company logo"
            }
          ],
          "fallback_markdown": "Report on Ola Electric.",
          "reasoning": "I created a one-page report on Ola Electric based on the data retrieved. The report includes an executive summary, company overview, funding details, operational highlights, and key observations, formatted in a concise and visually appealing manner.",
          "formatted_report_T002": "<div class='report'><h1 style='text-align: center;'>Ola Electric: Executive Summary</h1><div id='executive-summary'><h2>🎯 Executive Summary</h2><p>Ola Electric, founded in 2017, is a prominent Indian electric vehicle (EV) manufacturer based in Bengaluru. The company focuses on designing, manufacturing, and selling electric scooters and motorcycles for both personal and commercial use. With a total funding of $1B across 14 rounds, Ola Electric has rapidly grown to become a key player in the Indian EV market. Key investors include SoftBank, Tiger Global Management, and Edelweiss.</p><img src='https://i.tracxn.com/tracxn-data-attachments/report/thumbnail/image/Electric_Vehicles_-_Feed_Report_fd062de9-b052-4cea-9504-dcaecdd985c2.jpg?width=350' alt='An image depicting Electric Vehicles - Sector Report' style='max-width: 400px; margin: 10px 0;'><p>The company's financials show a strong revenue of 5,240Cr as of March 31, 2024, despite incurring losses. Ola Electric went public on August 9, 2024, raising $732.16M through an IPO. The stock price as of July 1, 2025, is $0.49, with a market capitalization of $2.05B.</p></div><div id='company-overview'><h2>🏢 Company Overview</h2><p>Ola Electric operates as a manufacturer of electric scooters and motorcycles, offering various models with differing performance specifications and price points. The company also provides related services such as maintenance and repair. Ola Electric is associated with three legal entities, including Ola Electric Mobility Limited.</p></div><div id='funding-details'><h2>💰 Funding Details</h2><img src='https://public-pages.cbinsights.com/public-site/555112/_next/static/public/images/investment_chart.png?w=1920&q=75' alt='investments chart' style='max-width: 400px; margin: 10px 0;'><p>Ola Electric has raised $1B in funding across 14 rounds. Key funding rounds include a recent IPO on August 9, 2024, raising $732.16M and a conventional debt round of $12M on June 12, 2024, from Edelweiss and others.  The company's valuation in September 2023 was between $5.4B and $5.5B.</p></div><div id='operational-highlights'><h2>⚙️ Operational Highlights</h2><p>As of April 30, 2025, Ola Electric has 3,612 employees.  The company's annual revenue as of March 31, 2024, was 5,240Cr. Ola Electric competes with 1253 active competitors, including Ather Energy and BGauss. The company's business model operates in the B2C space within the Energy Tech and Auto Tech market segments.</p><img src='https://s3-us-west-2.amazonaws.com/cbi-image-service-prd/modified/999765ca-4599-4b1b-8e10-53206dc41385.png?w=3840' alt='Ola Electric company logo' style='max-width: 400px; margin: 10px 0;'></div><div id='key-observations'><h2>💡 Key Observations</h2><ul><li><b>Market Position:</b> Ola Electric is ranked 1st among 1253 active competitors.</li><li><b>Financial Performance:</b> Strong revenue figures but with ongoing losses.</li><li><b>Future Outlook:</b> Focus on technological innovation and expansion in the EV market.</li></ul><img src='https://public-pages.cbinsights.com/public-site/555112/_next/static/public/images/VC_Persona_Videos.png?w=640&q=75' alt='Featured Item' style='max-width: 400px; margin: 10px 0;'></div></div>"
        },
        "call_self": false,
        "cost": 0.001481175,
        "input_tokens": 7210.5,
        "output_tokens": 666.0,
        "total_tokens": 7876.5
      },
      "error": null,
      "cost": 0.0,
      "start_time": "2025-07-02T15:46:48.838090",
      "end_time": "2025-07-02T15:47:01.449255",
      "execution_time": 12.611165,
      "input_tokens": 0,
      "output_tokens": 0,
      "execution_result": null
    }
  ],
  "links": [
    {
      "source": "ROOT",
      "target": "T001"
    },
    {
      "source": "T001",
      "target": "T002"
    }
  ]
}