{
  "directed": true,
  "multigraph": false,
  "graph": {
    "session_id": "52902388",
    "original_query": "You are a stock researcher, prepare a very detailed and comprehensive report on Asian Paints. You must include graphs, tables, comparisons. Finally you must share a well formatted and polished HTML report (use Formatter Agent as last step to generate HTML report). Hint: For graphs, and tables, you must first collect relevant data sources (revenue trend, market share etc.), and then use Coder Agent to generate the graphs",
    "file_manifest": [],
    "created_at": "2025-07-19T05:19:48.517112",
    "status": "running",
    "output_chain": {
      "T001": {
        "iterations": [
          {
            "iteration": 1,
            "output": {
              "asian_paints_info": [
                {
                  "type": "text",
                  "text": "[{'url': 'https://en.wikipedia.org/wiki/Asian_Paints', 'content': \"Asian Paints - Wikipedia Jump to content Main menu Main menu move to sidebar hide Navigation Main page Contents Current events Random article About Wikipedia Contact us Contribute Help Learn to edit Community portal Recent changes Upload file Special pages Search Search Appearance Donate Create account Log in Personal tools Donate Create account Log in Pages for logged out editors learn more Contributions Talk Contents move to sidebar hide (Top) 1 History 2 Corporate structure Toggle Corporate structure subsection 2.1 Ownership 2.2 Shareholding pattern 3 Manufacturing locations 4 Marketing and advertising 5 References 6 External links Toggle the table of contents Asian Paints 9 languages  Deutsch    Edit links Article Talk English Read Edit View history Tools Tools move to sidebar hide Actions Read Edit View history General What links here Related changes Upload file Permanent link Page information Cite this page Get shortened URL Download QR code Print/export Download as PDF Printable version In other projects Wikidata item Appearance move to sidebar hide From Wikipedia, the free encyclopedia Indian multinational paint company Asian Paints Ltd. Formerly Asian Oil and Paint Company Pvt. Ltd. (19451965) [ 1 ] Asian Paints (India) Pvt. Ltd. (19651973) [ 1 ] Company type Public Traded as BSE : 50082 NSE : ASIANPAINT BSE SENSEX constituent NSE NIFTY 50 constituent ISIN INE021A01026 Industry Chemicals Founded 1February 1942 ; 83 years ago ( 1942-02-01 ) Founders Champaklal Choksey Chimanlal Choksi Suryakant Dani Arvind Vakil [ 2 ] Headquarters Mumbai , Maharashtra , India Area served Worldwide Key people Manish Choksi ( Vice Chairman ) Amit Syngle ( CEO ) Products Chemicals Decorative paints Industrial finishing products Coatings Revenue 36,183 crore (US$4.3billion) (2024) Operating income 7,215 crore (US$850million) (2024) Net income 5,558 crore (US$660million) (2024) Total assets 29,924 crore (US$3.5billion) (2024) Total equity 19,424 crore (US$2.3billion) (2024) Number of employees 9,482 permanent & 21,189 contractual (2024) [ 3 ] Website asianpaints.com Footnotes/ references Financials as of 31March2024 [update] . [ 4 ] Asian Paints Ltd is an Indian multinational paint company, headquartered in Mumbai . [ 2 ] The company is engaged in the business of manufacturing, selling and distribution of paints, coatings, products related to home dcor, bath fittings and providing related services. Asian Paints is India's largest paints company by market share. [ 5 ] [ 6 ] The company has 27 paint manufacturing facilities in 15 countries, servicing consumers in over 60 countries. Asian Paints is also present in the home improvement and dcor space in India. [ 7 ] History [ edit ] The company was started in a garage in Gaiwadi, Girgaon , Mumbai by four friends Champaklal Choksey, Chimanlal Choksi, Suryakant Dani and Arvind Vakil, in February 1942. [ 2 ] During World War II and the Quit India Movement of 1942, a temporary ban on paint imports left only foreign companies and Shalimar Paints in the market. Asian Paints took up the market and reported an annual turnover of 23 crore in 1952 but with only 2% PBT margin. By 1967, it became the leading paints manufacturer in the country. [ 8 ] [ 9 ] Asian Paints established its first overseas subsidiary in 1978 in Fiji , [ 10 ] before expanding into Nepal in 1983. [ 11 ] The company made its first international acquisition in 1999, when it took over Sri Lanka 's second largest paint company, Delmege Forsyth & Co. [ 12 ] In 2000, it began operations in Oman through a joint venture with the Al Hassan Group. [ 13 ] In 2002, Asian Paints acquired a 60% stake in Egyptian paint manufacturer SCIB Chemicals for 24.5 crore (US$5.04 million). [ 14 ] It also acquired a 50.1% stake in the SGX -listed Berger International Singapore, which had operations in 11 countries across Southeast Asia , West Asia , the Caribbean , China and Malta , for US$20.8 million. [ 15 ] Later that year, it entered the Bangl\", 'images': [], 'rank': 1}, {'url': 'https://www.asianpaints.com/about-us.html', 'content': 'About Asian Paints - 75+ Years Of Innovation In Paints Asian Paints - About Us Colour With AsianPaints App Calculate Painting Budget Calculate Painting Budget Colours Colour by family All Colours Grey Blue Brown Red Orange Yellow Green Purple Pink Whites Off Whites Colour Collections Royale Designer Colour of the year Colour Tools Find my shade Products For Interior Walls Paints Textures Wallpapers For Exterior Walls Paints Textures Waterproofing All products Bathrooms Terrace & tanks Cracks & joints Interior Tiling Exteriors Other Surface Wood paints Metal paints Undercoats Adhesives Brushes & Ancillaries Services Painting Interior solutions Waterproofing Sleek Kitchen Bathroom design & execution Calculators Paint budget calculator Waterproofing budget calculator Interior design cost calculator Kitchen cost calculator Colour Tools Home Colour Guide Wall Paint Finder Wood Paint Finder Wood Finish Visualiser Textures For You New Shade Cards New Inspiration Colour combinations Celebrity homes Colour of the year Shop DIY Tools Mechanized tools Colour books Royale play texture tool More Find Contractor Find a store Blogs Guides Paint bucket return Explore home decor Search for Store Contact Profile Hello My Profile Wishlist Sign out Hello {{minicart.cartcount > 0 ? minicart.cartcount : 0}} Cart Processing... You have {{minicart.cartcount}} items {{item[\"totalPrice\"][\"value\"]}} - + Total Amount {{minicart.totalprice}} Checkout Your cart is empty Shop now Book Free Site Visit Colours Colour by family All Colours Grey Blue Brown Red Orange Yellow Green Purple Pink Whites Off Whites Colour Collections Royale Designer Colour of the year Colour Tools Find my shade Products For Interior Walls Paints Textures Wallpapers For Exterior Walls Paints Textures Waterproofing All products Bathrooms Terrace & tanks Cracks & joints Interior Tiling Exteriors Other Surface Wood paints Metal paints Undercoats Adhesives Brushes & Ancillaries Services Painting Interior solutions Waterproofing Sleek Kitchen Bathroom design & execution Calculators Paint budget calculator Waterproofing budget calculator Interior design cost calculator Kitchen cost calculator Colour Tools Home Colour Guide Wall Paint Finder Wood Paint Finder Wood Finish Visualiser Textures For You New Shade Cards New Inspiration Colour combinations Celebrity homes Colour of the year Shop DIY Tools Mechanized tools Colour books Royale play texture tool More Find Contractor Find a store Blogs Guides Paint bucket return Explore home decor Book Free Site Visit ABOUT ASIAN PAINTS 75+ Years ofInnovation in Paint HISTORY All Great Things Start Small The company has come a long way since its small beginnings in 1942. It was set up as a partnership firm by four friends who were willing to take on the world\\'s biggest, most famous paint companies operating in India at that time. Over the course of 25 years, Asian Paints became a corporate force and India\\'s leading paints company. Driven by its strong consumer-focus and innovative spirit, the company has been the market leader in paints since 1967. Asian Paints manufactures a wide range of paints for decorative and industrial use and also offers water proofing, adhesives and services under its portfolio. The company is also present in the Home Decor segment and offers Modular kitchens and wardrobes, Bath fittings and sanitaryware, Decorative lightings, uPVC windows and doors, wall coverings, Furniture, Fabric & Furnishings and Rugs. Delivering joy since 1942. We exist to Beautify, Preserve, Transform all Spaces and Objects, bringing happiness to the World! Board of Directors R Seshasayee Non-Executive Chairman / Independent Director Manish Choksi Non-Executive Vice Chairman Amit Syngle Managing Director & CEO Malav Dani Non-Executive Director Amrita Vakil Non-Executive Director MilindSarwate Independent Director Nehal Vakil Non-Executive Director Ireena Vittal Independent Director Soumitra Bhattacharya Independent Director Gopichand Katragadda Inde', 'images': [{'url': 'https://static.asianpaints.com/content/dam/apcolourcatalogue/splash-popup/mobile-home-decor-image.webp', 'alt_text': 'mobile-home-decor-image', 'width': '290', 'height': '260', 'loading': 'eager', 'confidence': 0.8999999999999999}, {'url': 'https://static.asianpaints.com/content/dam/apcolourcatalogue/splash-popup/mobile-paint-textures-image-40.webp', 'alt_text': 'mobile-paint-textures-image-40', 'width': '290', 'height': '260', 'loading': 'eager', 'confidence': 0.8999999999999999}, {'url': 'https://static.asianpaints.com/content/dam/apcolourcatalogue/asset/ap-revamp/static-pages/about-us/desktop-images/mascot.png', 'alt_text': 'A sketch of a man with a paint brush in his hand', 'title': 'A sketch of a man with a paint brush in his hand', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://static.asianpaints.com/content/dam/asianpaints/website/secondary-navigation/about-us/board-of-directors/RSeshasayee1.jpg', 'alt_text': 'R Seshasayee - Non-Executive Chairman / Independent', 'title': 'R Seshasayee - Non-Executive Chairman / Independent', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://static.asianpaints.com/content/dam/asianpaints/website/secondary-navigation/about-us/board-of-directors/Manish.jpg', 'alt_text': 'Manish Choksi - Non-Executive Vice Chairman', 'title': 'Manish Choksi - Non-Executive Vice Chairman', 'loading': 'eager', 'confidence': 0.7}], 'rank': 2}, {'url': 'https://www.iconsofindianbusiness.com/article/asian-paints-success-story', 'content': \"Asian Paints' Success Story Trending News Tech startup Goodmeetings raises $1.7M in pre-Series A round led by Chiratae Ventures-admin Brocade Boutique Successfully Running Since 20 years-admin Successful entrepreneur Ganesh Hegde's Hard work brings Fortune-admin Techie turned into edible oil Extraction :SAPTHAM OIL - Name of Purity-admin How Shoppre worked hard to become one of the best shipping companies in India-admin July 19, 2025,10:50:28 AM Companies She Shines StartupStory Business News Beauty & Fashion Trending News Award Functions Motivational story Invest Guru Startup News Gallery Contact Us Asian Paints' Success Story By News Desk 116 0 Asian Paints is India's largest and Asia's third-largest paint company, with a rich history spanning over 75 years. Here's their story: Founding: Asian Paints was founded in 1942 by four friends - Champaklal Choksey, Chimanlal Choksey, Suryakant Dani, and Arvind Vakil - in a small garage in Mumbai. Initial Struggles: The company faced stiff competition from established players and struggled to find its footing in the market. Turning Point: Asian Paints' fortunes changed when they introduced innovative products, expanded their distribution network, and invested in marketing and branding. Key Factors Contributing to Success: 1. Innovative Products: Introduced a range of innovative products, including exterior and interior paints, enamels, and varnishes. 2.Strong Distribution Network: Established a robust distribution network, making products widely available. 3.Effective Marketing Strategies: Leveraged iconic advertising campaigns, sponsorships, and events to create brand awareness. 4. Quality and Customer Focus: Emphasized on maintaining high-quality products and delivering exceptional customer service. Achievements: 1. Market Leadership: Became India's largest paint company, with a market share of over 50%. 2. Global Expansion: Expanded operations to over 15 countries, including the Middle East, South Asia, and Southeast Asia. 3. Awards and Recognition: Received numerous awards for innovation, marketing, and corporate governance. Lessons Learned: 1. Innovate and Adapt: Stay ahead of the competition by continuously innovating and adapting to changing market trends. 2. Focus on Quality and Customer Service: Prioritize quality and customer satisfaction to build trust and loyalty. 3. Strong Distribution Network: Establish a robust distribution network to make products widely available. Asian Paints' success story serves as an inspiration for entrepreneurs and businesses, highlighting the importance of innovation, quality, and effective marketing strategies. Asian Paints Turnover . Annual Turnover: Asian Paints' annual turnover for 2023 was $4.28 billion, up from $4.18 billion in 2022 . Quarterly Turnover: The company's turnover for Q1 2024-2025 was 9,162.66Cr, a 2.63% decrease from the same period last year . Revenue Streams: Asian Paints generates revenue from the sale of paints, coatings, home dcor products, and bath fittings, as well as from providing related services . Geographic Presence: The company has a significant presence in over 15 countries, including India, and services consumers in over 60  countries CONNECT Whats hot Successful Journey of YONEX Products July 17, 2025 A Journey of Impact in Food Processing and Agribusiness July 17, 2025 How R G Chandramogan built Rs. 7990 cr turnover Arun Icecream company from pushcart. July 13, 2025 She Chose to Begin Again The Story of Shashikala P July 11, 2025 Mana Media Marketing (MMM): Redefining Digital Excellence and Building a Premium Brand Presence July 5, 2025 categories Award Functions (0) Beauty & Fashion (0) Business News (0) Companies (0) Trending News (0) Invest Guru (0) Motivational story (0) She Shines (0) Startup News (0) StartupStory (0) Subscribe Enter Your Email To Get Notified. Icons of Indian Business: Icons of Indian Business is a monthly business magazine targeted at Indian business owners, traders and entrepreneu\", 'images': [], 'rank': 3}, {'url': 'https://mostvaluablebrands.com/2024/06/asian-paints-a-most-valuable-brand-story/', 'content': \"Asian Paints: A Most Valuable Brand Story - BRANDS ILLUSTRATED By using this site, you agree to the Privacy Policy and Terms of Use . Accept Stay Tuned! Subscribe to our newsletter to get our newest articles instantly! Don't show this popup again! Leave this field empty if you're human: July 18, 2025 Trending News: From Differentiator to Power Player: How IndusInd Bank... More Than Motorcycles: Hero MotoCorp and the Spirit... From First Mover to Lifesaver: The Apollo Legacy... The Healing Code: How Dr. Reddys Turned Science... Follow Us Brands Illustrated: Most Valuable Brands Reports Worlds Most Powerful Brands Worlds Most Valuable Workplace 2025 Research About Us Brand News View Stories Construction Energy Finance FMCG Petroleum Pharma Retail Sports Tech Most Valuable Brands Brands Illustrated by WCRC is more than just a rankingits a celebration of the worlds most impactful brands and the stories behind their success. Built on extensive research and real-world insights, WCRCs Most Valuable Brands study dives deep into what makes a brand truly powerfultrust, innovation, relevance, and customer loyalty. The platform goes beyond numbers, offering clear, insightful reports and analytics that help decode how top brands lead, evolve, and inspire. At its core, Brands Illustrated is about recognizing excellence and guiding the future of branding with intelligence, integrity, and a human touch. info@mostvaluablebrands.com Brands Illustrated: Most Valuable Brands Reports Worlds Most Powerful Brands Worlds Most Valuable Workplace 2025 Research About Us Brand News View Stories Construction Energy Finance FMCG Petroleum Pharma Retail Sports Tech Home Uncategorized Asian Paints: A Most Valuable Brand Story Uncategorized Asian Paints: A Most Valuable Brand Story BY valuablebrands June 6, 2024 0 Comments 40 Views Humble Beginnings Asian Paints was founded in 1942 in a small garage by four friends: Champaklal Choksey, Chimanlal Choksi, Suryakant Dani, and Arvind Vakil. Despite starting with a modest capital, the founders had a clear vision of becoming a leading player in the paint industry. Their entrepreneurial spirit and innovative strategies laid the foundation for what would become one of the most successful paint companies in the world. Innovation and Market Leadership Asian Paints quickly distinguished itself from competitors by focusing on innovation and customer satisfaction. In the 1950s and 60s, the company revolutionized the industry by introducing smaller pack sizes, making paint more accessible to a broader audience. This move significantly increased their market share, particularly among rural consumers who could now afford to purchase paint in smaller quantities. In the 1970s, Asian Paints continued its innovative streak by developing computer color matching technology, which allowed for a broader range of colors and more accurate mixing. This technological advancement set them apart from competitors and cemented their position as an industry leader. Commitment to Quality and Sustainability Throughout its history, Asian Paints has maintained a strong commitment to quality. The company invests heavily in research and development to ensure its products meet the highest standards. Their state-of-the-art laboratories and manufacturing facilities are equipped with the latest technology to ensure consistency and excellence in every product. Sustainability is also a core value for Asian Paints. The company has implemented various eco-friendly initiatives, such as water-based paints that reduce environmental impact and energy-efficient manufacturing processes. These efforts have earned Asian Paints numerous accolades for sustainability and corporate responsibility. Global Expansion Asian Paints success is not limited to India. The company has expanded its operations globally, establishing a presence in over 15 countries across Asia, the Middle East, Africa, and the South Pacific. Through strategic acquisitions and joint ventures, Asia\", 'images': [], 'rank': 4}, {'url': 'https://business.mapsofindia.com/india-company/asian-paints.html', 'content': \"Asian Paints - about company, Products and Services and more Business Plans Advertising Agency BPO Consultancy Event Management Financial Services Restaurant Travel Agency Format India Companies Automobile Companies Top Aviation Companies Multinational Companies Top Banking Companies Top Companies India Insurance Agriculture Automobile General Health Insurance Policies Life Insurance Medical Top Insurance Companies Travel Business Leaders Anand Mahindra Anil Ambani Azim Premji Dhirubhai Ambani Lakshmi Narayan Mittal Mukesh Ambani Rahul Bajaj Finance Credit Cards Refinance Top 10 Financial companies Top Auto Finance Top Asset Management Finance Glossary Banks in India Allahabad Bank Axis Bank HDFC Bank ICICI Bank Mudra Bank Punjab National Bank SBI Reserve Bank of India Top Brands in India Cosmetic Bag Handbags Headphones Laptop Red Wine Rum Beer Chocolate Shoe Watch Vodka B-Schools Amity Business School IIM distance learning IIPM Delhi Online Business School S.P. Jain institute Top B Schools in India XLRI Share List of Companies in India Multinational Companies American Companies in India BPO Companies in India Wine Companies India Starting a Company in India How to Register a Company in India Indian Software Companies Pvt. Sector Fertilizer Company Hindustan Unilever Limited Britannia Industries IT Companies in Chandigarh companies in Delhi ONGC NTPC SAIL 3i Infotech 3M India Top Companies in India Top Banking Companies Top Construction Companies Top Brokerage Firms Top Agriculture Companies Top Blue Chip Companies Pharmaceutical Companies in India Top Biotech Companies Top Automobile Companies Top Insurance Companies Top Retail Brands in India You would like to Know How to Start a Business India Income Tax Business Ideas Indian Company Business Leaders Globalization Fixed Deposit scheme Automobile Industry Mudra Bank Gold Monetization Scheme FMCG Home List of Companies in India Asian Paints Asian Paints About Asian Paints Asian Paints is an India based company and having 29 manufacturing bases in 21 countries and five regions. It is India's largest and Asia's 3rd largest Paint Company . It has five corporate brands operating across the globe, they are - Asian Paints, Berger International, SCIB Paints, Apco Coatings and Taubmans . Asian Paints was rated as 'Best Small Companies in the World for 2002 and 2003' by Forbes Global magazine USA and was presented with the 'Best under a Billion' company award. Asian Paints is the only such paint company in the world to receive such award. Latest Financial Figures (Figures in Rs. Crores) ET 500 Rank(2014) 81 Industry Paints/Varnishes Turnover 13548.06 Profit after Tax(PAT) 1218.81 MCAP (Market Capitalization) 59397.45 Assets 4652.05 Products and Services Asian Paints offers a wide spectrum of services in the following areas - Decorative  under this segment it offers Painting Guide, Painting Solution, Paint Calculator and Paint Selector as value added decorative service. Industrial  Asian Paints offers 4 types of industrial coatings such as - Protective Coatings protects steel and concrete structures from the corrosive action of harsh climates, pollution, sea spray, acids, oils and solvents. Road Markings  are used as road markers for lane as indicator of lane separation and also as safety markers. They include ordinary road marking paint, hot applied retro-reflective thermoplastic material and retro-reflective water borne paints. Powder Coatings  is used to enhance the performance of Industrial paints. Floor Coatings  such paints protects the floor surface and prevents crack formation, insect nest formation, water seepage etc. Automotive  It includes wide range of motor bikes and car paints. Board of Directors Mr. K B S Anand, Managing Director & CEO Mr. Mahendra Choksi, Non-Executive Director Head office Asian Paints Limited, Asian Paints House 6A, Shantinagar, Santacruz (E), Mumbai - 400 055, India. Tel: 022 - 3981 8000 Fax: 022 - 3981 8888 Website: www.apaints.com Asian P\", 'images': [], 'rank': 5}, {'url': 'https://economictimes.indiatimes.com/asian-paints-ltd/infocompanyhistory/companyid-14034.cms', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://innovativezoneindia.com/inspiring-success-story-of-asian-paints/', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://pintoscolumn.com/asian-paints-a-colorful-journey-of-innovation-and-excellence/', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
                  "annotations": null
                }
              ]
            }
          }
        ],
        "final_output": null,
        "iteration_count": 1
      },
      "T002": {
        "initial_thoughts": "Let me think through this. I need to gather detailed financial data for Asian Paints over the past 5-10 years. This includes revenue trends, profit margins, financial ratios, and balance sheet information. I will use the web search tool to find reliable financial sources like annual reports, financial databases, and reputable financial news providers.",
        "output": {},
        "call_self": false,
        "code": {
          "CODE_1": "results = search_web_with_text_content('Asian Paints financial performance 2014-2024 revenue profit margins ratios balance sheet', 8)\noutput = {'financial_data': results}",
          "CODE_2": "results = search_web_with_text_content('Asian Paints annual reports 2014-2024 financial statements', 6)\noutput = {'financial_data': results}",
          "CODE_3": "results = search_web_with_text_content('Asian Paints ROE ROI debt-to-equity ratio analysis', 5)\noutput = {'financial_data': results}"
        },
        "cost": 0.00043155,
        "input_tokens": 2205.0,
        "output_tokens": 168.0,
        "total_tokens": 2373.0,
        "execution_result": {
          "status": "success",
          "session_id": "52902388",
          "operations": [
            "python_code"
          ],
          "created_files": [],
          "file_results": {},
          "code_results": {
            "status": "success",
            "result": {
              "financial_data": [
                {
                  "type": "text",
                  "text": "[{'url': 'https://www.moneycontrol.com/financials/asianpaints/ratiosVI/AP31', 'content': 'Would you like to receive Push Notifications? We promise to only send you relevant content and give you updates on your transactions No thanksAllow English Specials Hello, Login Go Ad-Free My Alerts Go PRO Now PRO Markets News Editors Picks Tech India Portfolio Watchlist Commodities Mutual Funds Personal Finance Forum Videos Invest Now Global Markets Indian Indices Economic Calendar IPO All Stats Technical Trends Earnings F&O US Markets Seasonality Analysis Options Webinar 26-27 July Options Webinar SENSEX 81,757.73 -501.51(-0.61%) NIFTY 50 24,968.40 -143.05(-0.57%) NIFTY BANK 56,283.00 -545.80(-0.96%) NIFTY Midcap 100 59,104.50 -414.60(-0.7%) 1 2 3 4 ETF FUNDS PARTNERED BY ICICI Prudential Nifty 50 Index Fund - Direct Plan (G)3 Year Return: 16.34%5 Year Return: 19.08%INVEST NOW EQUITY FUNDS PARTNERED BY Motilal Oswal Midcap Fund - Direct Plan (G)3 Year Return: 33.17%5 Year Return: 37.08%INVEST NOW EQUITY FUNDS PARTNERED BY Motilal Oswal Nifty Microcap 250 Index Fund - Direct Plan - Growth3 Year Return: NA5 Year Return: NAINVEST NOW EQUITY FUNDS PARTNERED BY Motilal Oswal Large and Midcap Fund - Direct Plan (G)3 Year Return: 32.64%5 Year Return: 30.8%INVEST NOW EQUITY FUNDS PARTNERED BY HSBC Mid Cap Fund - Direct Plan (G)3 Year Return: 26.84%5 Year Return: 27.42%INVEST NOW EQUITY FUNDS PARTNERED BY HSBC Multi Cap Fund - Direct Plan (G)3 Year Return: NA5 Year Return: NAINVEST NOW EQUITY FUNDS PARTNERED BY SBI Magnum Children`s Benefit Fund - Investment Plan - DP - (G)3 Year Return: 27.41%5 Year Return: NAINVEST NOW EQUITY FUNDS PARTNERED BY SBI Retirement Benefit Fund - Aggressive Plan - Direct Plan (G)3 Year Return: 18.39%5 Year Return: NAINVEST NOW EQUITY FUNDS PARTNERED BY HSBC Flexi Cap Fund - Direct Plan (G)3 Year Return: 23.88%5 Year Return: 23.94%INVEST NOW EQUITY FUNDS PARTNERED BY HSBC Value Fund - Direct Plan (G)3 Year Return: 29.12%5 Year Return: 29.46%INVEST NOW EQUITY FUNDS PARTNERED BY HSBC Value Fund - Direct Plan (G)3 Year Return: 29.12%5 Year Return: 29.46%INVEST NOW EQUITY FUNDS PARTNERED BY HSBC Value Fund - Direct Plan (G)3 Year Return: 29.12%5 Year Return: 29.46%INVEST NOW EQUITY FUNDS PARTNERED BY HSBC ELSS Tax saver Fund - Direct Plan - Growth3 Year Return: 24.38%5 Year Return: 23.42%INVEST NOW EQUITY FUNDS PARTNERED BY Mirae Asset Small Cap Fund - Direct Plan - Growth3 Year Return: NA5 Year Return: NAINVEST NOW EQUITY FUNDS PARTNERED BY Mirae Asset Balanced Advantage Fund - Direct Plan (G)3 Year Return: NA5 Year Return: NAINVEST NOW EQUITY FUNDS PARTNERED BY Canara Robeco Flexi Cap Fund - Direct Plan (G)3 Year Return: 19.42%5 Year Return: 21.53%INVEST NOW EQUITY FUNDS PARTNERED BY Canara Robeco Blue Chip Equity Fund - Direct Plan (G)3 Year Return: 19.4%5 Year Return: 20.63%INVEST NOW EQUITY FUNDS PARTNERED BY Canara Robeco Emerging Equities - Direct Plan (G)3 Year Return: 20.87%5 Year Return: 24.31%INVEST NOW EQUITY FUNDS PARTNERED BY Axis Small Cap Fund - Direct Plan (G)3 Year Return: 24.94%5 Year Return: 32.32%INVEST NOW EQUITY FUNDS PARTNERED BY HDFC Top 100 Fund - Direct Plan (G)3 Year Return: 19.97%5 Year Return: 22.68%INVEST NOW EQUITY FUNDS PARTNERED BY Canara Robeco Manufacturing Fund - Direct Plan - Growth3 Year Return: NA5 Year Return: NAINVEST NOW EQUITY FUNDS PARTNERED BY Bandhan Nifty Alpha 50 Index Fund - Regular Plan - Growth3 Year Return: NA5 Year Return: NAINVEST NOW EQUITY FUNDS PARTNERED BY SBI Blue Chip Fund - Direct Plan (G)3 Year Return: 17.73%5 Year Return: 20.93%INVEST NOW EQUITY FUNDS PARTNERED BY Bandhan Small Cap Fund - Direct Plan - Growth3 Year Return: 35.95%5 Year Return: 38.25%INVEST NOW EQUITY FUNDS PARTNERED BY Bandhan Infrastructure Fund - Direct Plan (G)3 Year Return: 34.37%5 Year Return: 36.38%INVEST NOW EQUITY FUNDS PARTNERED BY Bandhan Core Equity Fund - Direct Plan (G)3 Year Return: 28.52%5 Year Return: 28.89%INVEST NOW EQUITY FUNDS PARTNERED BY SBI Long Term Equity Fund - Direct Plan (G)3 Year Return: 28.29%5 Year Return: 27.86%INVEST NOW EQUITY FUNDS PARTNE', 'images': [], 'rank': 1}, {'url': 'https://tickjournal.com/stock-screener/asian-paints-ltd/financial-statements/', 'content': 'Dashboard Stock Screener Stats Calendar Settings Sign Out New Trade New Note Asian Paints Complete Financial Statements ASIANPAINT Review detailed financials to uncover trends, confirm thesis & journal trades 11 Years of Data 2025 - 2015 Complete Financial Data Export Download Excel Download CSV Export complete financial statements for Asian Paints (ASIANPAINT). Downloads include all available records across all periods. For market performance, see the ASIANPAINT stock price today. Profitability Ratios NET PROFIT MARGIN 8.29% 2025 data EBITDA MARGIN 15.94% 2025 data OPERATING MARGIN 15.00% 2025 data RETURN ON ASSETS 2.31% 2025 data RETURN ON EQUITY 3.49% 2025 data Balance Sheet Ratios CURRENT RATIO 7.83 2025 data DEBT TO EQUITY 1.51 2025 data EQUITY RATIO 66.05% 2025 data ASSET TURNOVER 0.28 2025 data Year-over-Year Growth Analysis Comparing Mar 2024 vs Mar 2025 Revenue Growth -5.2% Year-over-Year Net Profit Growth -45.0% Year-over-Year EBITDA Growth -28.2% Year-over-Year Expense Growth +1.0% Year-over-Year Assets Growth +1.5% Year-over-Year Equity Growth +3.3% Year-over-Year Liabilities Growth +1.5% Year-over-Year Operating Cash Flow Growth -27.5% Year-over-Year Investing Cash Flow Growth +63.1% Year-over-Year Financing Cash Flow Growth -25.8% Year-over-Year Income Statement Periods Crores Particulars\\tMar 2025\\tSept 2024\\tMar 2024\\tJun 2024\\tDec 2024\\tSept 2023\\tMar 2023\\tJun 2023\\tDec 2023\\tSept 2022\\tMar 2022\\tJun 2022\\tDec 2022\\tSept 2021\\tMar 2021\\tJun 2021\\tDec 2021\\tSept 2020\\tMar 2020\\tJun 2020\\tDec 2020\\tSept 2019\\tMar 2019\\tJun 2019\\tDec 2019\\tSept 2018\\tMar 2018\\tJun 2018\\tDec 2018\\tSept 2017\\tMar 2017\\tJun 2017\\tDec 2017\\tSept 2016\\tMar 2016\\tJun 2016\\tDec 2016\\tSept 2015\\tMar 2015\\tJun 2015\\tDec 2015 Revenue\\t8,453\\t8,208\\t8,914\\t9,136\\t8,714\\t8,646\\t8,880\\t9,382\\t9,261\\t8,548\\t7,979\\t8,691\\t8,730\\t7,244\\t6,623\\t5,675\\t8,549\\t5,445\\t4,695\\t2,970\\t6,912\\t5,171\\t5,055\\t5,190\\t5,509\\t4,688\\t4,528\\t4,464\\t5,328\\t4,401\\t3,993\\t3,905\\t4,327\\t3,794\\t3,714\\t3,661\\t3,926\\t3,457\\t3,532\\t3,353\\t3,826 Expenses\\t7,106\\t6,968\\t7,039\\t7,276\\t6,913\\t6,762\\t6,947\\t7,061\\t7,047\\t7,230\\t6,565\\t7,075\\t7,025\\t6,192\\t5,333\\t4,674\\t6,985\\t4,085\\t3,776\\t2,453\\t5,001\\t4,099\\t4,108\\t3,949\\t4,231\\t3,772\\t3,644\\t3,461\\t4,160\\t3,464\\t3,201\\t3,150\\t3,369\\t3,004\\t2,970\\t2,771\\t3,100\\t2,827\\t2,978\\t2,656\\t3,103 EBITDA\\t1,347\\t1,240\\t1,875\\t1,860\\t1,802\\t1,884\\t1,932\\t2,321\\t2,214\\t1,318\\t1,414\\t1,615\\t1,704\\t1,053\\t1,290\\t1,001\\t1,564\\t1,360\\t919\\t517\\t1,911\\t1,073\\t947\\t1,242\\t1,278\\t917\\t884\\t1,003\\t1,168\\t937\\t792\\t755\\t957\\t790\\t745\\t890\\t826\\t630\\t555\\t698\\t724 Operating Profit Margin %\\t15.00%\\t13.00%\\t19.00%\\t19.00%\\t19.00%\\t20.00%\\t21.00%\\t23.00%\\t22.00%\\t14.00%\\t17.00%\\t18.00%\\t18.00%\\t13.00%\\t18.00%\\t16.00%\\t17.00%\\t24.00%\\t19.00%\\t16.00%\\t26.00%\\t19.00%\\t18.00%\\t23.00%\\t22.00%\\t18.00%\\t19.00%\\t21.00%\\t21.00%\\t19.00%\\t18.00%\\t17.00%\\t21.00%\\t19.00%\\t19.00%\\t23.00%\\t20.00%\\t17.00%\\t15.00%\\t19.00%\\t18.00% Depreciation\\t301\\t242\\t226\\t228\\t256\\t209\\t220\\t198\\t220\\t216\\t205\\t208\\t214\\t203\\t213\\t201\\t208\\t194\\t195\\t191\\t193\\t197\\t179\\t192\\t197\\t144\\t91\\t136\\t165\\t89\\t83\\t91\\t90\\t83\\t72\\t84\\t85\\t68\\t67\\t66\\t69 Interest\\t53\\t63\\t54\\t55\\t56\\t51\\t39\\t46\\t54\\t35\\t23\\t29\\t41\\t24\\t30\\t22\\t28\\t21\\t26\\t20\\t21\\t26\\t30\\t27\\t24\\t26\\t9\\t21\\t29\\t9\\t9\\t8\\t9\\t6\\t15\\t6\\t9\\t9\\t10\\t9\\t8 Profit Before Tax\\t1,022\\t959\\t1,624\\t1,604\\t1,518\\t1,651\\t1,710\\t2,105\\t1,968\\t1,094\\t1,189\\t1,407\\t1,478\\t826\\t1,156\\t779\\t1,394\\t1,146\\t699\\t306\\t1,697\\t849\\t738\\t1,023\\t1,057\\t747\\t784\\t846\\t974\\t840\\t701\\t657\\t859\\t701\\t658\\t799\\t732\\t594\\t522\\t664\\t698 Tax\\t321\\t265\\t349\\t417\\t390\\t419\\t451\\t530\\t493\\t290\\t315\\t371\\t381\\t221\\t286\\t204\\t362\\t294\\t219\\t86\\t431\\t7\\t252\\t351\\t278\\t243\\t288\\t276\\t327\\t246\\t221\\t216\\t291\\t206\\t222\\t247\\t243\\t175\\t170\\t198\\t216 Net Profit\\t701\\t694\\t1,275\\t1,187\\t1,128\\t1,232\\t1,258\\t1,575\\t1,475\\t804\\t874\\t1,036\\t1,097\\t605\\t870\\t574\\t1,031\\t852\\t480\\t220\\t1,265\\t842\\t486\\t672\\t780\\t505\\t496\\t570\\t647\\t594\\t480\\t441\\t567\\t495\\t436\\t553\\t489\\t419\\t352\\t466\\t482 Earnings Per Share ()\\t7.22\\t7.25\\t13.11\\t12.20\\t11.58\\t12.57\\t12.87\\t16.17\\t15.10\\t8.16\\t8.87\\t10.60\\t11.19\\t6.21\\t8.88\\t5.93\\t10.59\\t8.66\\t4.82\\t2.28\\t12.91\\t8.58\\t4.93\\t6.83\\t7.97\\t5.12\\t5.01\\t5.81\\t6.63\\t6.00\\t4.82\\t4.46\\t5.78\\t4.96\\t4.37\\t5.58\\t4.86\\t4.21\\t3.55\\t4.73\\t4.89 Scroll horizontally Related Pages for Asian Paints Additional stock information and data for ASIANPAINT ASIANPAINT share price history As', 'images': [], 'rank': 2}, {'url': 'https://stockanalysis.com/quote/nse/ASIANPAINT/financials/ratios/', 'content': \"Asian Paints (NSE:ASIANPAINT) Financial Ratios and Metrics Skip to main content Log In Sign Up Home Stocks Stock Screener Stock Exchanges Comparison Tool Earnings Calendar By Industry Stock Lists Top Analysts Top Stocks Corporate Actions IPOs Recent IPOs IPO Calendar IPO Statistics IPO News IPO Screener ETFs ETF Screener Comparison Tool New Launches ETF Providers News Trending Articles Technical Chart Market Movers Top Gainers Top Losers Most Active Premarket After Hours Market Heatmap Market Newsletter Stock Analysis Pro Watchlist Collapse Asian Paints Limited (NSE:ASIANPAINT) India Delayed Price Currency is INR Watchlist Compare 2,382.40 -16.50 (-0.69%) Jul 18, 2025, 3:30 PM IST Overview Financials Statistics Dividends Profile Chart Income Balance Sheet Cash Flow Ratios KPIs NEW Annual Quarterly TTM Asian Paints Ratios and Metrics Market cap in millions INR. Fiscal year is April - March. Millions INR. Fiscal year is Apr - Mar. Current Mil Millions Data Data Source Download Full Width Fiscal Year Current FY 2025 FY 2024 FY 2023 FY 2022 FY 2021 2016 - 2020 Period Ending Jul '25 Jul 18, 2025 Mar '25 Mar 31, 2025 Mar '24 Mar 31, 2024 Mar '23 Mar 31, 2023 Mar '22 Mar 31, 2022 Mar '21 Mar 31, 2021 2016 - 2020 Market Capitalization 2,285,193 2,245,146 2,730,596 2,648,969 2,954,281 2,433,868 Upgrade Market Cap Growth -17.78% -17.78% 3.08% -10.33% 21.38% 52.26% Upgrade Enterprise Value 2,267,766 2,248,587 2,720,035 2,646,482 2,937,249 2,423,015 Upgrade Last Close Price 2382.40 2319.25 2788.91 2682.96 2970.76 2432.52 Upgrade PE Ratio 62.28 61.22 50.01 64.51 97.48 77.53 Upgrade Forward PE 52.21 53.55 53.39 56.64 81.35 56.61 Upgrade PS Ratio 6.75 6.63 7.71 7.69 10.19 11.32 Upgrade PB Ratio 11.39 11.19 14.06 16.11 20.81 18.40 Upgrade P/TBV Ratio 12.15 11.94 15.27 17.01 22.08 19.84 Upgrade P/FCF Ratio 87.27 85.74 69.93 90.72 659.07 71.55 Upgrade P/OCF Ratio 51.65 50.75 44.74 63.17 299.47 66.08 Upgrade PEG Ratio 4.93 23.86 3.48 3.03 4.06 3.14 Upgrade EV/Sales Ratio 6.70 6.64 7.68 7.69 10.14 11.27 Upgrade EV/EBITDA Ratio 37.04 40.13 37.61 43.96 64.72 52.52 Upgrade EV/EBIT Ratio 44.29 45.15 40.34 48.44 73.67 59.62 Upgrade EV/FCF Ratio 86.60 85.87 69.66 90.63 655.27 71.23 Upgrade Debt / Equity Ratio 0.11 0.11 0.13 0.12 0.11 0.08 Upgrade Debt / EBITDA Ratio 0.38 0.38 0.33 0.31 0.33 0.23 Upgrade Debt / FCF Ratio 0.88 0.88 0.63 0.66 3.54 0.32 Upgrade Asset Turnover 1.12 1.12 1.27 1.41 1.34 1.18 Upgrade Inventory Turnover 3.12 3.12 3.34 3.45 3.71 3.40 Upgrade Quick Ratio 1.16 1.16 1.27 1.23 1.11 1.29 Upgrade Current Ratio 2.09 2.09 2.06 2.09 2.00 2.03 Upgrade Return on Equity (ROE) 18.79% 18.79% 30.99% 27.38% 22.49% 26.99% Upgrade Return on Assets (ROA) 10.32% 10.32% 15.13% 14.00% 11.50% 13.91% Upgrade Return on Capital (ROIC) 14.07% 14.07% 20.93% 19.99% 16.55% 19.56% Upgrade Return on Capital Employed (ROCE) 22.40% 22.40% 31.50% 30.50% 25.90% 28.10% Upgrade Earnings Yield 1.60% 1.63% 2.00% 1.55% 1.03% 1.29% Upgrade FCF Yield 1.15% 1.17% 1.43% 1.10% 0.15% 1.40% Upgrade Dividend Yield 1.03% 1.07% 1.19% 0.96% 0.65% 0.73% Upgrade Payout Ratio 85.63% 85.63% 46.72% 47.15% 57.45% 15.91% Upgrade Buyback Yield / Dilution 0.01% 0.01% -0.01% 0.02% 0.01% - Upgrade Total Shareholder Return 1.04% 1.08% 1.19% 0.97% 0.66% 0.73% Upgrade Updated Feb 4, 2025. Source: S&P Global Market Intelligence. Standard template. Financial Sources. Sections Stocks IPOs ETFs Blog Services Stock Analysis Pro Free Newsletter Get Support Install The App Website Login Create Account Changelog Sitemap Advertise FAQ Company About Contact Us Terms of Use Privacy Policy Data Disclaimer Affiliate Program Market Newsletter Daily market news in bullet point format. Subscribe Site Theme Light Dark 2025 StockAnalysis.com. All rights reserved.\", 'images': [], 'rank': 3}, {'url': 'https://www.wsj.com/market-data/quotes/IN/XNSE/ASIANPAINT/financials', 'content': '[error] Timeout while extracting content', 'rank': 4}, {'url': 'https://groww.in/stocks/asian-paints-ltd/company-financial', 'content': \"Asian Paints Financial Statements - Check Balance Sheet & EBITDA Stocks Invest in Stocks Invest in stocks, ETFs, IPOs with fast orders. Track returns on your stock holdings and view real-time P&L on your positions. Intraday Monitor top intraday performers in real time ETFs Get the best of Mutual Funds and flexibility of Stocks IPO Track upcoming and ongoing IPOs MTFs Buy now, pay later Stock Screener Filter based on RSI, PE ratio and more Stock Events Dividends, bonus, buybacks and more Demat Account Begin your stock market journey Share Market Today Live news updates from stock market F&O Trade in Futures & Options Trade in F&O using the terminal. View charts, indicators, track your orders , P&L and watchlists in a single space Indices Track markets across the globe Terminal Track charts, orders, positions, watchlists in one place Option chain Analyse chains, view payoffs, create baskets Pledge Get extra balance for trading Commodities Trade in Crude Oil, Gold, Silver and more API trading Set up and execute trades through our API Mutual Funds Invest in Mutual Funds Invest in direct mutual funds at zero charges via lump sump investments or SIPs Mutual Fund Houses Know about AMCs, funds, fund managers NFOs Track all active NFOs in one place Mutual Funds by Groww Mutual funds by Groww designed for your investment goals Mutual Funds screener Filter funds based on risk, fund size and more Track Funds Import funds and track all investments in a single place Compare Funds More SIP calculator Estimate returns on a SIP Brokerage calculator Estimate charges for your trade/investment Margin calculator Estimate balance needed to buy/sell a stock SWP calculator Returns on your systematic withdrawal plan Pricing Brokerage and charges on Groww Blog Asian Paints quarterly yearly Particulars Mar '24 Jun '24 Sep '24 Dec '24 Mar '25 Revenue 7,774 8,107 7,050 7,645 7,330 Expenses 6,252 6,515 5,993 6,168 6,172 EBITDA 1,751 1,819 1,304 1,736 1,462 EBIT 1,555 1,623 896.61 1,512 1,013 Profit Before Tax 1,522 1,592 857.57 1,476 979.00 Net Profit 1,209 1,192 602.31 1,104 694.28 Financial Ratios Operating Profit Margin 23.23 % 23.16 % 16.14 % 23.50 % 17.92 % Net Profit Margin 16.04 % 15.18 % 10.86 % 14.95 % 11.42 % Earning Per Share (Diluted) 12.61 12.44 6.28 11.51 7.24 Dividends Per Share 0.00 0.00 4.25 0.00 0.00 Overview Charts Company financials Peer comparison Shareholding pattern Vaishnavi Tech Park, South Tower, 3rd Floor Sarjapur Main Road, Bellandur, Bengaluru 560103 Karnataka Contact Us GROWW About Us Pricing Blog Media & Press Careers Help & Support Trust & Safety PRODUCTS Stocks F&O MTF ETF IPO Credit Mutual Funds Groww Terminal Stocks Screener Algo Trading Commodities Groww Digest Demat Account Groww AMC 2016-2025 Groww. All rights reserved. Version: 6.4.3 Share Market Indices F&O Mutual Funds Funds By Groww Calculators IPO Miscellaneous Top Gainers Stocks 52 Weeks High Stocks Tata Motors NHPC ITC Wipro BSE NTPC Top Losers Stocks 52 Weeks Low Stocks IREDA State Bank of India Adani Power CDSL Cochin Shipyard SJVN Most Traded Stocks Stocks Market Calender Tata Steel Tata Power Bharat Heavy Electricals Indian Oil Corporation HUDCO SAIL Stocks Feed Suzlon Energy Zomato (Eternal) Yes Bank Infosys NBCC IRCTC Share Market Live Update FII DII Activity IRFC Bharat Electronics HDFC Bank Vedanta Reliance Power Jaiprakash Power Ventures NIFTY 50 NIFTY Midcap 100 NIFTY 100 US Tech 100 NIFTY Realty Nikkei index SENSEX NIFTY Smallcap 100 NIFTY Auto Dow Jones Futures NIFTY PSU Bank NIFTY FMCG NIFTY BANK NIFTY MIDCAP 150 KOSPI Index Dow Jones Index Gift Nifty BSE BANKEX India VIX NIFTY Pharma HANG SENG Index BSE 100 FTSE 100 Index S&P 500 NIFTY NEXT 50 NIFTY Metal DAX Index NIFTY Fin Service CAC Index Nifty Pvt Bank NIFTY Bank Options SBI Options Bajaj Finance Options Axis Bank Options Hindustan Unilever Options NIFTY Bank Futures Finnifty Futures ITC Futures ICICI Bank Futures Biocon Futures Indusind Bank Futures NIFTY 50 Options HDFC Bank Options Wipro\", 'images': [], 'rank': 5}, {'url': 'https://www.etmoney.com/stocks/asian-paints-ltd/financials/944', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://dhan.co/stocks/asian-paints-ltd-financial-results/', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://trendlyne.com/fundamentals/financial-ratios/117/ASIANPAINT/asian-paints-ltd/', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
                  "annotations": null
                }
              ]
            },
            "created_files": [],
            "execution_time": 53.03988910000771,
            "error": null,
            "successful_variant": "CODE_1",
            "total_variants_tried": 1,
            "all_errors": []
          },
          "total_time": 53.04471819999162,
          "error": null
        }
      }
    },
    "validation_results": {
      "is_valid": true,
      "is_dag": true,
      "cycles": [],
      "disconnected_components": [],
      "orphaned_nodes": [],
      "root_nodes": [],
      "leaf_nodes": [
        "T007"
      ],
      "warnings": [],
      "errors": []
    }
  },
  "nodes": [
    {
      "description": "Initial Query",
      "agent": "System",
      "status": "completed",
      "id": "ROOT"
    },
    {
      "id": "T001",
      "description": "Retrieve comprehensive information on Asian Paints' business overview, including its history, products, services, and geographical presence.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Gather detailed information about Asian Paints' business overview, including its history, products, services, and geographical presence. Focus on extracting information from reliable sources such as the company's official website, reputable financial news outlets, and industry reports. The information must be comprehensive and accurate.",
      "reads": [],
      "writes": [
        "T001"
      ],
      "status": "failed",
      "output": null,
      "error": "Code execution failed: Code execution failed: All code variants failed. Errors: CODE_1: KeyError: 'url'",
      "cost": 0.0,
      "start_time": "2025-07-19T05:19:48.526651",
      "end_time": "2025-07-19T05:21:05.037813",
      "execution_time": 76.511162,
      "execution_result": {
        "status": "partial_failure",
        "session_id": "52902388",
        "operations": [
          "python_code"
        ],
        "created_files": [],
        "file_results": {},
        "code_results": {
          "status": "failed",
          "result": {},
          "created_files": [],
          "execution_time": 0.012420700048096478,
          "error": "All code variants failed. Errors: CODE_1: KeyError: 'url'",
          "failed_variants": 1,
          "all_errors": [
            "CODE_1: KeyError: 'url'"
          ]
        },
        "total_time": 0.020489600021392107,
        "error": "Code execution failed: All code variants failed. Errors: CODE_1: KeyError: 'url'"
      },
      "iterations": [
        {
          "iteration": 1,
          "output": {
            "initial_thoughts": "Let me think through this... I need to gather detailed information about Asian Paints, including its history, products, services, and geographical presence. I should use the web search tool to find information from reliable sources such as the company's official website, reputable financial news outlets, and industry reports. Since this requires multiple sequential steps, I will use call_self: true.",
            "output": {},
            "call_self": true,
            "next_instruction": "Extract detailed information about Asian Paints' history and geographical presence from the search results.",
            "code": {
              "CODE_1": "results = search_web_with_text_content('Asian Paints company history products services geographical presence', 8)\noutput = {'asian_paints_info': results}"
            },
            "cost": 0.000420975,
            "input_tokens": 2200.5,
            "output_tokens": 151.5,
            "total_tokens": 2352.0,
            "execution_result": {
              "status": "success",
              "session_id": "52902388",
              "operations": [
                "python_code"
              ],
              "created_files": [],
              "file_results": {},
              "code_results": {
                "status": "success",
                "result": {
                  "asian_paints_info": [
                    {
                      "type": "text",
                      "text": "[{'url': 'https://en.wikipedia.org/wiki/Asian_Paints', 'content': \"Asian Paints - Wikipedia Jump to content Main menu Main menu move to sidebar hide Navigation Main page Contents Current events Random article About Wikipedia Contact us Contribute Help Learn to edit Community portal Recent changes Upload file Special pages Search Search Appearance Donate Create account Log in Personal tools Donate Create account Log in Pages for logged out editors learn more Contributions Talk Contents move to sidebar hide (Top) 1 History 2 Corporate structure Toggle Corporate structure subsection 2.1 Ownership 2.2 Shareholding pattern 3 Manufacturing locations 4 Marketing and advertising 5 References 6 External links Toggle the table of contents Asian Paints 9 languages  Deutsch    Edit links Article Talk English Read Edit View history Tools Tools move to sidebar hide Actions Read Edit View history General What links here Related changes Upload file Permanent link Page information Cite this page Get shortened URL Download QR code Print/export Download as PDF Printable version In other projects Wikidata item Appearance move to sidebar hide From Wikipedia, the free encyclopedia Indian multinational paint company Asian Paints Ltd. Formerly Asian Oil and Paint Company Pvt. Ltd. (19451965) [ 1 ] Asian Paints (India) Pvt. Ltd. (19651973) [ 1 ] Company type Public Traded as BSE : 50082 NSE : ASIANPAINT BSE SENSEX constituent NSE NIFTY 50 constituent ISIN INE021A01026 Industry Chemicals Founded 1February 1942 ; 83 years ago ( 1942-02-01 ) Founders Champaklal Choksey Chimanlal Choksi Suryakant Dani Arvind Vakil [ 2 ] Headquarters Mumbai , Maharashtra , India Area served Worldwide Key people Manish Choksi ( Vice Chairman ) Amit Syngle ( CEO ) Products Chemicals Decorative paints Industrial finishing products Coatings Revenue 36,183 crore (US$4.3billion) (2024) Operating income 7,215 crore (US$850million) (2024) Net income 5,558 crore (US$660million) (2024) Total assets 29,924 crore (US$3.5billion) (2024) Total equity 19,424 crore (US$2.3billion) (2024) Number of employees 9,482 permanent & 21,189 contractual (2024) [ 3 ] Website asianpaints.com Footnotes/ references Financials as of 31March2024 [update] . [ 4 ] Asian Paints Ltd is an Indian multinational paint company, headquartered in Mumbai . [ 2 ] The company is engaged in the business of manufacturing, selling and distribution of paints, coatings, products related to home dcor, bath fittings and providing related services. Asian Paints is India's largest paints company by market share. [ 5 ] [ 6 ] The company has 27 paint manufacturing facilities in 15 countries, servicing consumers in over 60 countries. Asian Paints is also present in the home improvement and dcor space in India. [ 7 ] History [ edit ] The company was started in a garage in Gaiwadi, Girgaon , Mumbai by four friends Champaklal Choksey, Chimanlal Choksi, Suryakant Dani and Arvind Vakil, in February 1942. [ 2 ] During World War II and the Quit India Movement of 1942, a temporary ban on paint imports left only foreign companies and Shalimar Paints in the market. Asian Paints took up the market and reported an annual turnover of 23 crore in 1952 but with only 2% PBT margin. By 1967, it became the leading paints manufacturer in the country. [ 8 ] [ 9 ] Asian Paints established its first overseas subsidiary in 1978 in Fiji , [ 10 ] before expanding into Nepal in 1983. [ 11 ] The company made its first international acquisition in 1999, when it took over Sri Lanka 's second largest paint company, Delmege Forsyth & Co. [ 12 ] In 2000, it began operations in Oman through a joint venture with the Al Hassan Group. [ 13 ] In 2002, Asian Paints acquired a 60% stake in Egyptian paint manufacturer SCIB Chemicals for 24.5 crore (US$5.04 million). [ 14 ] It also acquired a 50.1% stake in the SGX -listed Berger International Singapore, which had operations in 11 countries across Southeast Asia , West Asia , the Caribbean , China and Malta , for US$20.8 million. [ 15 ] Later that year, it entered the Bangl\", 'images': [], 'rank': 1}, {'url': 'https://www.asianpaints.com/about-us.html', 'content': 'About Asian Paints - 75+ Years Of Innovation In Paints Asian Paints - About Us Colour With AsianPaints App Calculate Painting Budget Calculate Painting Budget Colours Colour by family All Colours Grey Blue Brown Red Orange Yellow Green Purple Pink Whites Off Whites Colour Collections Royale Designer Colour of the year Colour Tools Find my shade Products For Interior Walls Paints Textures Wallpapers For Exterior Walls Paints Textures Waterproofing All products Bathrooms Terrace & tanks Cracks & joints Interior Tiling Exteriors Other Surface Wood paints Metal paints Undercoats Adhesives Brushes & Ancillaries Services Painting Interior solutions Waterproofing Sleek Kitchen Bathroom design & execution Calculators Paint budget calculator Waterproofing budget calculator Interior design cost calculator Kitchen cost calculator Colour Tools Home Colour Guide Wall Paint Finder Wood Paint Finder Wood Finish Visualiser Textures For You New Shade Cards New Inspiration Colour combinations Celebrity homes Colour of the year Shop DIY Tools Mechanized tools Colour books Royale play texture tool More Find Contractor Find a store Blogs Guides Paint bucket return Explore home decor Search for Store Contact Profile Hello My Profile Wishlist Sign out Hello {{minicart.cartcount > 0 ? minicart.cartcount : 0}} Cart Processing... You have {{minicart.cartcount}} items {{item[\"totalPrice\"][\"value\"]}} - + Total Amount {{minicart.totalprice}} Checkout Your cart is empty Shop now Book Free Site Visit Colours Colour by family All Colours Grey Blue Brown Red Orange Yellow Green Purple Pink Whites Off Whites Colour Collections Royale Designer Colour of the year Colour Tools Find my shade Products For Interior Walls Paints Textures Wallpapers For Exterior Walls Paints Textures Waterproofing All products Bathrooms Terrace & tanks Cracks & joints Interior Tiling Exteriors Other Surface Wood paints Metal paints Undercoats Adhesives Brushes & Ancillaries Services Painting Interior solutions Waterproofing Sleek Kitchen Bathroom design & execution Calculators Paint budget calculator Waterproofing budget calculator Interior design cost calculator Kitchen cost calculator Colour Tools Home Colour Guide Wall Paint Finder Wood Paint Finder Wood Finish Visualiser Textures For You New Shade Cards New Inspiration Colour combinations Celebrity homes Colour of the year Shop DIY Tools Mechanized tools Colour books Royale play texture tool More Find Contractor Find a store Blogs Guides Paint bucket return Explore home decor Book Free Site Visit ABOUT ASIAN PAINTS 75+ Years ofInnovation in Paint HISTORY All Great Things Start Small The company has come a long way since its small beginnings in 1942. It was set up as a partnership firm by four friends who were willing to take on the world\\'s biggest, most famous paint companies operating in India at that time. Over the course of 25 years, Asian Paints became a corporate force and India\\'s leading paints company. Driven by its strong consumer-focus and innovative spirit, the company has been the market leader in paints since 1967. Asian Paints manufactures a wide range of paints for decorative and industrial use and also offers water proofing, adhesives and services under its portfolio. The company is also present in the Home Decor segment and offers Modular kitchens and wardrobes, Bath fittings and sanitaryware, Decorative lightings, uPVC windows and doors, wall coverings, Furniture, Fabric & Furnishings and Rugs. Delivering joy since 1942. We exist to Beautify, Preserve, Transform all Spaces and Objects, bringing happiness to the World! Board of Directors R Seshasayee Non-Executive Chairman / Independent Director Manish Choksi Non-Executive Vice Chairman Amit Syngle Managing Director & CEO Malav Dani Non-Executive Director Amrita Vakil Non-Executive Director MilindSarwate Independent Director Nehal Vakil Non-Executive Director Ireena Vittal Independent Director Soumitra Bhattacharya Independent Director Gopichand Katragadda Inde', 'images': [{'url': 'https://static.asianpaints.com/content/dam/apcolourcatalogue/splash-popup/mobile-home-decor-image.webp', 'alt_text': 'mobile-home-decor-image', 'width': '290', 'height': '260', 'loading': 'eager', 'confidence': 0.8999999999999999}, {'url': 'https://static.asianpaints.com/content/dam/apcolourcatalogue/splash-popup/mobile-paint-textures-image-40.webp', 'alt_text': 'mobile-paint-textures-image-40', 'width': '290', 'height': '260', 'loading': 'eager', 'confidence': 0.8999999999999999}, {'url': 'https://static.asianpaints.com/content/dam/apcolourcatalogue/asset/ap-revamp/static-pages/about-us/desktop-images/mascot.png', 'alt_text': 'A sketch of a man with a paint brush in his hand', 'title': 'A sketch of a man with a paint brush in his hand', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://static.asianpaints.com/content/dam/asianpaints/website/secondary-navigation/about-us/board-of-directors/RSeshasayee1.jpg', 'alt_text': 'R Seshasayee - Non-Executive Chairman / Independent', 'title': 'R Seshasayee - Non-Executive Chairman / Independent', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://static.asianpaints.com/content/dam/asianpaints/website/secondary-navigation/about-us/board-of-directors/Manish.jpg', 'alt_text': 'Manish Choksi - Non-Executive Vice Chairman', 'title': 'Manish Choksi - Non-Executive Vice Chairman', 'loading': 'eager', 'confidence': 0.7}], 'rank': 2}, {'url': 'https://www.iconsofindianbusiness.com/article/asian-paints-success-story', 'content': \"Asian Paints' Success Story Trending News Tech startup Goodmeetings raises $1.7M in pre-Series A round led by Chiratae Ventures-admin Brocade Boutique Successfully Running Since 20 years-admin Successful entrepreneur Ganesh Hegde's Hard work brings Fortune-admin Techie turned into edible oil Extraction :SAPTHAM OIL - Name of Purity-admin How Shoppre worked hard to become one of the best shipping companies in India-admin July 19, 2025,10:50:28 AM Companies She Shines StartupStory Business News Beauty & Fashion Trending News Award Functions Motivational story Invest Guru Startup News Gallery Contact Us Asian Paints' Success Story By News Desk 116 0 Asian Paints is India's largest and Asia's third-largest paint company, with a rich history spanning over 75 years. Here's their story: Founding: Asian Paints was founded in 1942 by four friends - Champaklal Choksey, Chimanlal Choksey, Suryakant Dani, and Arvind Vakil - in a small garage in Mumbai. Initial Struggles: The company faced stiff competition from established players and struggled to find its footing in the market. Turning Point: Asian Paints' fortunes changed when they introduced innovative products, expanded their distribution network, and invested in marketing and branding. Key Factors Contributing to Success: 1. Innovative Products: Introduced a range of innovative products, including exterior and interior paints, enamels, and varnishes. 2.Strong Distribution Network: Established a robust distribution network, making products widely available. 3.Effective Marketing Strategies: Leveraged iconic advertising campaigns, sponsorships, and events to create brand awareness. 4. Quality and Customer Focus: Emphasized on maintaining high-quality products and delivering exceptional customer service. Achievements: 1. Market Leadership: Became India's largest paint company, with a market share of over 50%. 2. Global Expansion: Expanded operations to over 15 countries, including the Middle East, South Asia, and Southeast Asia. 3. Awards and Recognition: Received numerous awards for innovation, marketing, and corporate governance. Lessons Learned: 1. Innovate and Adapt: Stay ahead of the competition by continuously innovating and adapting to changing market trends. 2. Focus on Quality and Customer Service: Prioritize quality and customer satisfaction to build trust and loyalty. 3. Strong Distribution Network: Establish a robust distribution network to make products widely available. Asian Paints' success story serves as an inspiration for entrepreneurs and businesses, highlighting the importance of innovation, quality, and effective marketing strategies. Asian Paints Turnover . Annual Turnover: Asian Paints' annual turnover for 2023 was $4.28 billion, up from $4.18 billion in 2022 . Quarterly Turnover: The company's turnover for Q1 2024-2025 was 9,162.66Cr, a 2.63% decrease from the same period last year . Revenue Streams: Asian Paints generates revenue from the sale of paints, coatings, home dcor products, and bath fittings, as well as from providing related services . Geographic Presence: The company has a significant presence in over 15 countries, including India, and services consumers in over 60  countries CONNECT Whats hot Successful Journey of YONEX Products July 17, 2025 A Journey of Impact in Food Processing and Agribusiness July 17, 2025 How R G Chandramogan built Rs. 7990 cr turnover Arun Icecream company from pushcart. July 13, 2025 She Chose to Begin Again The Story of Shashikala P July 11, 2025 Mana Media Marketing (MMM): Redefining Digital Excellence and Building a Premium Brand Presence July 5, 2025 categories Award Functions (0) Beauty & Fashion (0) Business News (0) Companies (0) Trending News (0) Invest Guru (0) Motivational story (0) She Shines (0) Startup News (0) StartupStory (0) Subscribe Enter Your Email To Get Notified. Icons of Indian Business: Icons of Indian Business is a monthly business magazine targeted at Indian business owners, traders and entrepreneu\", 'images': [], 'rank': 3}, {'url': 'https://mostvaluablebrands.com/2024/06/asian-paints-a-most-valuable-brand-story/', 'content': \"Asian Paints: A Most Valuable Brand Story - BRANDS ILLUSTRATED By using this site, you agree to the Privacy Policy and Terms of Use . Accept Stay Tuned! Subscribe to our newsletter to get our newest articles instantly! Don't show this popup again! Leave this field empty if you're human: July 18, 2025 Trending News: From Differentiator to Power Player: How IndusInd Bank... More Than Motorcycles: Hero MotoCorp and the Spirit... From First Mover to Lifesaver: The Apollo Legacy... The Healing Code: How Dr. Reddys Turned Science... Follow Us Brands Illustrated: Most Valuable Brands Reports Worlds Most Powerful Brands Worlds Most Valuable Workplace 2025 Research About Us Brand News View Stories Construction Energy Finance FMCG Petroleum Pharma Retail Sports Tech Most Valuable Brands Brands Illustrated by WCRC is more than just a rankingits a celebration of the worlds most impactful brands and the stories behind their success. Built on extensive research and real-world insights, WCRCs Most Valuable Brands study dives deep into what makes a brand truly powerfultrust, innovation, relevance, and customer loyalty. The platform goes beyond numbers, offering clear, insightful reports and analytics that help decode how top brands lead, evolve, and inspire. At its core, Brands Illustrated is about recognizing excellence and guiding the future of branding with intelligence, integrity, and a human touch. info@mostvaluablebrands.com Brands Illustrated: Most Valuable Brands Reports Worlds Most Powerful Brands Worlds Most Valuable Workplace 2025 Research About Us Brand News View Stories Construction Energy Finance FMCG Petroleum Pharma Retail Sports Tech Home Uncategorized Asian Paints: A Most Valuable Brand Story Uncategorized Asian Paints: A Most Valuable Brand Story BY valuablebrands June 6, 2024 0 Comments 40 Views Humble Beginnings Asian Paints was founded in 1942 in a small garage by four friends: Champaklal Choksey, Chimanlal Choksi, Suryakant Dani, and Arvind Vakil. Despite starting with a modest capital, the founders had a clear vision of becoming a leading player in the paint industry. Their entrepreneurial spirit and innovative strategies laid the foundation for what would become one of the most successful paint companies in the world. Innovation and Market Leadership Asian Paints quickly distinguished itself from competitors by focusing on innovation and customer satisfaction. In the 1950s and 60s, the company revolutionized the industry by introducing smaller pack sizes, making paint more accessible to a broader audience. This move significantly increased their market share, particularly among rural consumers who could now afford to purchase paint in smaller quantities. In the 1970s, Asian Paints continued its innovative streak by developing computer color matching technology, which allowed for a broader range of colors and more accurate mixing. This technological advancement set them apart from competitors and cemented their position as an industry leader. Commitment to Quality and Sustainability Throughout its history, Asian Paints has maintained a strong commitment to quality. The company invests heavily in research and development to ensure its products meet the highest standards. Their state-of-the-art laboratories and manufacturing facilities are equipped with the latest technology to ensure consistency and excellence in every product. Sustainability is also a core value for Asian Paints. The company has implemented various eco-friendly initiatives, such as water-based paints that reduce environmental impact and energy-efficient manufacturing processes. These efforts have earned Asian Paints numerous accolades for sustainability and corporate responsibility. Global Expansion Asian Paints success is not limited to India. The company has expanded its operations globally, establishing a presence in over 15 countries across Asia, the Middle East, Africa, and the South Pacific. Through strategic acquisitions and joint ventures, Asia\", 'images': [], 'rank': 4}, {'url': 'https://business.mapsofindia.com/india-company/asian-paints.html', 'content': \"Asian Paints - about company, Products and Services and more Business Plans Advertising Agency BPO Consultancy Event Management Financial Services Restaurant Travel Agency Format India Companies Automobile Companies Top Aviation Companies Multinational Companies Top Banking Companies Top Companies India Insurance Agriculture Automobile General Health Insurance Policies Life Insurance Medical Top Insurance Companies Travel Business Leaders Anand Mahindra Anil Ambani Azim Premji Dhirubhai Ambani Lakshmi Narayan Mittal Mukesh Ambani Rahul Bajaj Finance Credit Cards Refinance Top 10 Financial companies Top Auto Finance Top Asset Management Finance Glossary Banks in India Allahabad Bank Axis Bank HDFC Bank ICICI Bank Mudra Bank Punjab National Bank SBI Reserve Bank of India Top Brands in India Cosmetic Bag Handbags Headphones Laptop Red Wine Rum Beer Chocolate Shoe Watch Vodka B-Schools Amity Business School IIM distance learning IIPM Delhi Online Business School S.P. Jain institute Top B Schools in India XLRI Share List of Companies in India Multinational Companies American Companies in India BPO Companies in India Wine Companies India Starting a Company in India How to Register a Company in India Indian Software Companies Pvt. Sector Fertilizer Company Hindustan Unilever Limited Britannia Industries IT Companies in Chandigarh companies in Delhi ONGC NTPC SAIL 3i Infotech 3M India Top Companies in India Top Banking Companies Top Construction Companies Top Brokerage Firms Top Agriculture Companies Top Blue Chip Companies Pharmaceutical Companies in India Top Biotech Companies Top Automobile Companies Top Insurance Companies Top Retail Brands in India You would like to Know How to Start a Business India Income Tax Business Ideas Indian Company Business Leaders Globalization Fixed Deposit scheme Automobile Industry Mudra Bank Gold Monetization Scheme FMCG Home List of Companies in India Asian Paints Asian Paints About Asian Paints Asian Paints is an India based company and having 29 manufacturing bases in 21 countries and five regions. It is India's largest and Asia's 3rd largest Paint Company . It has five corporate brands operating across the globe, they are - Asian Paints, Berger International, SCIB Paints, Apco Coatings and Taubmans . Asian Paints was rated as 'Best Small Companies in the World for 2002 and 2003' by Forbes Global magazine USA and was presented with the 'Best under a Billion' company award. Asian Paints is the only such paint company in the world to receive such award. Latest Financial Figures (Figures in Rs. Crores) ET 500 Rank(2014) 81 Industry Paints/Varnishes Turnover 13548.06 Profit after Tax(PAT) 1218.81 MCAP (Market Capitalization) 59397.45 Assets 4652.05 Products and Services Asian Paints offers a wide spectrum of services in the following areas - Decorative  under this segment it offers Painting Guide, Painting Solution, Paint Calculator and Paint Selector as value added decorative service. Industrial  Asian Paints offers 4 types of industrial coatings such as - Protective Coatings protects steel and concrete structures from the corrosive action of harsh climates, pollution, sea spray, acids, oils and solvents. Road Markings  are used as road markers for lane as indicator of lane separation and also as safety markers. They include ordinary road marking paint, hot applied retro-reflective thermoplastic material and retro-reflective water borne paints. Powder Coatings  is used to enhance the performance of Industrial paints. Floor Coatings  such paints protects the floor surface and prevents crack formation, insect nest formation, water seepage etc. Automotive  It includes wide range of motor bikes and car paints. Board of Directors Mr. K B S Anand, Managing Director & CEO Mr. Mahendra Choksi, Non-Executive Director Head office Asian Paints Limited, Asian Paints House 6A, Shantinagar, Santacruz (E), Mumbai - 400 055, India. Tel: 022 - 3981 8000 Fax: 022 - 3981 8888 Website: www.apaints.com Asian P\", 'images': [], 'rank': 5}, {'url': 'https://economictimes.indiatimes.com/asian-paints-ltd/infocompanyhistory/companyid-14034.cms', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://innovativezoneindia.com/inspiring-success-story-of-asian-paints/', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://pintoscolumn.com/asian-paints-a-colorful-journey-of-innovation-and-excellence/', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
                      "annotations": null
                    }
                  ]
                },
                "created_files": [],
                "execution_time": 10.572534299979452,
                "error": null,
                "successful_variant": "CODE_1",
                "total_variants_tried": 1,
                "all_errors": []
              },
              "total_time": 10.576992900052574,
              "error": null
            }
          }
        },
        {
          "iteration": 2,
          "output": null
        }
      ],
      "call_self_used": true,
      "total_iterations": 2
    },
    {
      "id": "T002",
      "description": "Retrieve detailed financial performance data for Asian Paints, including revenue trends, profit margins, key financial ratios, and balance sheet information over the past 5-10 years.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Collect detailed financial performance data for Asian Paints over the past 5-10 years. This should include revenue trends, profit margins, key financial ratios (e.g., ROE, ROI, debt-to-equity), and balance sheet information. Use reliable financial sources such as annual reports, financial databases, and reputable financial news providers.",
      "reads": [],
      "writes": [
        "T002"
      ],
      "status": "completed",
      "output": {
        "initial_thoughts": "Let me think through this. I need to gather detailed financial data for Asian Paints over the past 5-10 years. This includes revenue trends, profit margins, financial ratios, and balance sheet information. I will use the web search tool to find reliable financial sources like annual reports, financial databases, and reputable financial news providers.",
        "output": {},
        "call_self": false,
        "code": {
          "CODE_1": "results = search_web_with_text_content('Asian Paints financial performance 2014-2024 revenue profit margins ratios balance sheet', 8)\noutput = {'financial_data': results}",
          "CODE_2": "results = search_web_with_text_content('Asian Paints annual reports 2014-2024 financial statements', 6)\noutput = {'financial_data': results}",
          "CODE_3": "results = search_web_with_text_content('Asian Paints ROE ROI debt-to-equity ratio analysis', 5)\noutput = {'financial_data': results}"
        },
        "cost": 0.00043155,
        "input_tokens": 2205.0,
        "output_tokens": 168.0,
        "total_tokens": 2373.0,
        "execution_result": {
          "status": "success",
          "session_id": "52902388",
          "operations": [
            "python_code"
          ],
          "created_files": [],
          "file_results": {},
          "code_results": {
            "status": "success",
            "result": {
              "financial_data": [
                {
                  "type": "text",
                  "text": "[{'url': 'https://www.moneycontrol.com/financials/asianpaints/ratiosVI/AP31', 'content': 'Would you like to receive Push Notifications? We promise to only send you relevant content and give you updates on your transactions No thanksAllow English Specials Hello, Login Go Ad-Free My Alerts Go PRO Now PRO Markets News Editors Picks Tech India Portfolio Watchlist Commodities Mutual Funds Personal Finance Forum Videos Invest Now Global Markets Indian Indices Economic Calendar IPO All Stats Technical Trends Earnings F&O US Markets Seasonality Analysis Options Webinar 26-27 July Options Webinar SENSEX 81,757.73 -501.51(-0.61%) NIFTY 50 24,968.40 -143.05(-0.57%) NIFTY BANK 56,283.00 -545.80(-0.96%) NIFTY Midcap 100 59,104.50 -414.60(-0.7%) 1 2 3 4 ETF FUNDS PARTNERED BY ICICI Prudential Nifty 50 Index Fund - Direct Plan (G)3 Year Return: 16.34%5 Year Return: 19.08%INVEST NOW EQUITY FUNDS PARTNERED BY Motilal Oswal Midcap Fund - Direct Plan (G)3 Year Return: 33.17%5 Year Return: 37.08%INVEST NOW EQUITY FUNDS PARTNERED BY Motilal Oswal Nifty Microcap 250 Index Fund - Direct Plan - Growth3 Year Return: NA5 Year Return: NAINVEST NOW EQUITY FUNDS PARTNERED BY Motilal Oswal Large and Midcap Fund - Direct Plan (G)3 Year Return: 32.64%5 Year Return: 30.8%INVEST NOW EQUITY FUNDS PARTNERED BY HSBC Mid Cap Fund - Direct Plan (G)3 Year Return: 26.84%5 Year Return: 27.42%INVEST NOW EQUITY FUNDS PARTNERED BY HSBC Multi Cap Fund - Direct Plan (G)3 Year Return: NA5 Year Return: NAINVEST NOW EQUITY FUNDS PARTNERED BY SBI Magnum Children`s Benefit Fund - Investment Plan - DP - (G)3 Year Return: 27.41%5 Year Return: NAINVEST NOW EQUITY FUNDS PARTNERED BY SBI Retirement Benefit Fund - Aggressive Plan - Direct Plan (G)3 Year Return: 18.39%5 Year Return: NAINVEST NOW EQUITY FUNDS PARTNERED BY HSBC Flexi Cap Fund - Direct Plan (G)3 Year Return: 23.88%5 Year Return: 23.94%INVEST NOW EQUITY FUNDS PARTNERED BY HSBC Value Fund - Direct Plan (G)3 Year Return: 29.12%5 Year Return: 29.46%INVEST NOW EQUITY FUNDS PARTNERED BY HSBC Value Fund - Direct Plan (G)3 Year Return: 29.12%5 Year Return: 29.46%INVEST NOW EQUITY FUNDS PARTNERED BY HSBC Value Fund - Direct Plan (G)3 Year Return: 29.12%5 Year Return: 29.46%INVEST NOW EQUITY FUNDS PARTNERED BY HSBC ELSS Tax saver Fund - Direct Plan - Growth3 Year Return: 24.38%5 Year Return: 23.42%INVEST NOW EQUITY FUNDS PARTNERED BY Mirae Asset Small Cap Fund - Direct Plan - Growth3 Year Return: NA5 Year Return: NAINVEST NOW EQUITY FUNDS PARTNERED BY Mirae Asset Balanced Advantage Fund - Direct Plan (G)3 Year Return: NA5 Year Return: NAINVEST NOW EQUITY FUNDS PARTNERED BY Canara Robeco Flexi Cap Fund - Direct Plan (G)3 Year Return: 19.42%5 Year Return: 21.53%INVEST NOW EQUITY FUNDS PARTNERED BY Canara Robeco Blue Chip Equity Fund - Direct Plan (G)3 Year Return: 19.4%5 Year Return: 20.63%INVEST NOW EQUITY FUNDS PARTNERED BY Canara Robeco Emerging Equities - Direct Plan (G)3 Year Return: 20.87%5 Year Return: 24.31%INVEST NOW EQUITY FUNDS PARTNERED BY Axis Small Cap Fund - Direct Plan (G)3 Year Return: 24.94%5 Year Return: 32.32%INVEST NOW EQUITY FUNDS PARTNERED BY HDFC Top 100 Fund - Direct Plan (G)3 Year Return: 19.97%5 Year Return: 22.68%INVEST NOW EQUITY FUNDS PARTNERED BY Canara Robeco Manufacturing Fund - Direct Plan - Growth3 Year Return: NA5 Year Return: NAINVEST NOW EQUITY FUNDS PARTNERED BY Bandhan Nifty Alpha 50 Index Fund - Regular Plan - Growth3 Year Return: NA5 Year Return: NAINVEST NOW EQUITY FUNDS PARTNERED BY SBI Blue Chip Fund - Direct Plan (G)3 Year Return: 17.73%5 Year Return: 20.93%INVEST NOW EQUITY FUNDS PARTNERED BY Bandhan Small Cap Fund - Direct Plan - Growth3 Year Return: 35.95%5 Year Return: 38.25%INVEST NOW EQUITY FUNDS PARTNERED BY Bandhan Infrastructure Fund - Direct Plan (G)3 Year Return: 34.37%5 Year Return: 36.38%INVEST NOW EQUITY FUNDS PARTNERED BY Bandhan Core Equity Fund - Direct Plan (G)3 Year Return: 28.52%5 Year Return: 28.89%INVEST NOW EQUITY FUNDS PARTNERED BY SBI Long Term Equity Fund - Direct Plan (G)3 Year Return: 28.29%5 Year Return: 27.86%INVEST NOW EQUITY FUNDS PARTNE', 'images': [], 'rank': 1}, {'url': 'https://tickjournal.com/stock-screener/asian-paints-ltd/financial-statements/', 'content': 'Dashboard Stock Screener Stats Calendar Settings Sign Out New Trade New Note Asian Paints Complete Financial Statements ASIANPAINT Review detailed financials to uncover trends, confirm thesis & journal trades 11 Years of Data 2025 - 2015 Complete Financial Data Export Download Excel Download CSV Export complete financial statements for Asian Paints (ASIANPAINT). Downloads include all available records across all periods. For market performance, see the ASIANPAINT stock price today. Profitability Ratios NET PROFIT MARGIN 8.29% 2025 data EBITDA MARGIN 15.94% 2025 data OPERATING MARGIN 15.00% 2025 data RETURN ON ASSETS 2.31% 2025 data RETURN ON EQUITY 3.49% 2025 data Balance Sheet Ratios CURRENT RATIO 7.83 2025 data DEBT TO EQUITY 1.51 2025 data EQUITY RATIO 66.05% 2025 data ASSET TURNOVER 0.28 2025 data Year-over-Year Growth Analysis Comparing Mar 2024 vs Mar 2025 Revenue Growth -5.2% Year-over-Year Net Profit Growth -45.0% Year-over-Year EBITDA Growth -28.2% Year-over-Year Expense Growth +1.0% Year-over-Year Assets Growth +1.5% Year-over-Year Equity Growth +3.3% Year-over-Year Liabilities Growth +1.5% Year-over-Year Operating Cash Flow Growth -27.5% Year-over-Year Investing Cash Flow Growth +63.1% Year-over-Year Financing Cash Flow Growth -25.8% Year-over-Year Income Statement Periods Crores Particulars\\tMar 2025\\tSept 2024\\tMar 2024\\tJun 2024\\tDec 2024\\tSept 2023\\tMar 2023\\tJun 2023\\tDec 2023\\tSept 2022\\tMar 2022\\tJun 2022\\tDec 2022\\tSept 2021\\tMar 2021\\tJun 2021\\tDec 2021\\tSept 2020\\tMar 2020\\tJun 2020\\tDec 2020\\tSept 2019\\tMar 2019\\tJun 2019\\tDec 2019\\tSept 2018\\tMar 2018\\tJun 2018\\tDec 2018\\tSept 2017\\tMar 2017\\tJun 2017\\tDec 2017\\tSept 2016\\tMar 2016\\tJun 2016\\tDec 2016\\tSept 2015\\tMar 2015\\tJun 2015\\tDec 2015 Revenue\\t8,453\\t8,208\\t8,914\\t9,136\\t8,714\\t8,646\\t8,880\\t9,382\\t9,261\\t8,548\\t7,979\\t8,691\\t8,730\\t7,244\\t6,623\\t5,675\\t8,549\\t5,445\\t4,695\\t2,970\\t6,912\\t5,171\\t5,055\\t5,190\\t5,509\\t4,688\\t4,528\\t4,464\\t5,328\\t4,401\\t3,993\\t3,905\\t4,327\\t3,794\\t3,714\\t3,661\\t3,926\\t3,457\\t3,532\\t3,353\\t3,826 Expenses\\t7,106\\t6,968\\t7,039\\t7,276\\t6,913\\t6,762\\t6,947\\t7,061\\t7,047\\t7,230\\t6,565\\t7,075\\t7,025\\t6,192\\t5,333\\t4,674\\t6,985\\t4,085\\t3,776\\t2,453\\t5,001\\t4,099\\t4,108\\t3,949\\t4,231\\t3,772\\t3,644\\t3,461\\t4,160\\t3,464\\t3,201\\t3,150\\t3,369\\t3,004\\t2,970\\t2,771\\t3,100\\t2,827\\t2,978\\t2,656\\t3,103 EBITDA\\t1,347\\t1,240\\t1,875\\t1,860\\t1,802\\t1,884\\t1,932\\t2,321\\t2,214\\t1,318\\t1,414\\t1,615\\t1,704\\t1,053\\t1,290\\t1,001\\t1,564\\t1,360\\t919\\t517\\t1,911\\t1,073\\t947\\t1,242\\t1,278\\t917\\t884\\t1,003\\t1,168\\t937\\t792\\t755\\t957\\t790\\t745\\t890\\t826\\t630\\t555\\t698\\t724 Operating Profit Margin %\\t15.00%\\t13.00%\\t19.00%\\t19.00%\\t19.00%\\t20.00%\\t21.00%\\t23.00%\\t22.00%\\t14.00%\\t17.00%\\t18.00%\\t18.00%\\t13.00%\\t18.00%\\t16.00%\\t17.00%\\t24.00%\\t19.00%\\t16.00%\\t26.00%\\t19.00%\\t18.00%\\t23.00%\\t22.00%\\t18.00%\\t19.00%\\t21.00%\\t21.00%\\t19.00%\\t18.00%\\t17.00%\\t21.00%\\t19.00%\\t19.00%\\t23.00%\\t20.00%\\t17.00%\\t15.00%\\t19.00%\\t18.00% Depreciation\\t301\\t242\\t226\\t228\\t256\\t209\\t220\\t198\\t220\\t216\\t205\\t208\\t214\\t203\\t213\\t201\\t208\\t194\\t195\\t191\\t193\\t197\\t179\\t192\\t197\\t144\\t91\\t136\\t165\\t89\\t83\\t91\\t90\\t83\\t72\\t84\\t85\\t68\\t67\\t66\\t69 Interest\\t53\\t63\\t54\\t55\\t56\\t51\\t39\\t46\\t54\\t35\\t23\\t29\\t41\\t24\\t30\\t22\\t28\\t21\\t26\\t20\\t21\\t26\\t30\\t27\\t24\\t26\\t9\\t21\\t29\\t9\\t9\\t8\\t9\\t6\\t15\\t6\\t9\\t9\\t10\\t9\\t8 Profit Before Tax\\t1,022\\t959\\t1,624\\t1,604\\t1,518\\t1,651\\t1,710\\t2,105\\t1,968\\t1,094\\t1,189\\t1,407\\t1,478\\t826\\t1,156\\t779\\t1,394\\t1,146\\t699\\t306\\t1,697\\t849\\t738\\t1,023\\t1,057\\t747\\t784\\t846\\t974\\t840\\t701\\t657\\t859\\t701\\t658\\t799\\t732\\t594\\t522\\t664\\t698 Tax\\t321\\t265\\t349\\t417\\t390\\t419\\t451\\t530\\t493\\t290\\t315\\t371\\t381\\t221\\t286\\t204\\t362\\t294\\t219\\t86\\t431\\t7\\t252\\t351\\t278\\t243\\t288\\t276\\t327\\t246\\t221\\t216\\t291\\t206\\t222\\t247\\t243\\t175\\t170\\t198\\t216 Net Profit\\t701\\t694\\t1,275\\t1,187\\t1,128\\t1,232\\t1,258\\t1,575\\t1,475\\t804\\t874\\t1,036\\t1,097\\t605\\t870\\t574\\t1,031\\t852\\t480\\t220\\t1,265\\t842\\t486\\t672\\t780\\t505\\t496\\t570\\t647\\t594\\t480\\t441\\t567\\t495\\t436\\t553\\t489\\t419\\t352\\t466\\t482 Earnings Per Share ()\\t7.22\\t7.25\\t13.11\\t12.20\\t11.58\\t12.57\\t12.87\\t16.17\\t15.10\\t8.16\\t8.87\\t10.60\\t11.19\\t6.21\\t8.88\\t5.93\\t10.59\\t8.66\\t4.82\\t2.28\\t12.91\\t8.58\\t4.93\\t6.83\\t7.97\\t5.12\\t5.01\\t5.81\\t6.63\\t6.00\\t4.82\\t4.46\\t5.78\\t4.96\\t4.37\\t5.58\\t4.86\\t4.21\\t3.55\\t4.73\\t4.89 Scroll horizontally Related Pages for Asian Paints Additional stock information and data for ASIANPAINT ASIANPAINT share price history As', 'images': [], 'rank': 2}, {'url': 'https://stockanalysis.com/quote/nse/ASIANPAINT/financials/ratios/', 'content': \"Asian Paints (NSE:ASIANPAINT) Financial Ratios and Metrics Skip to main content Log In Sign Up Home Stocks Stock Screener Stock Exchanges Comparison Tool Earnings Calendar By Industry Stock Lists Top Analysts Top Stocks Corporate Actions IPOs Recent IPOs IPO Calendar IPO Statistics IPO News IPO Screener ETFs ETF Screener Comparison Tool New Launches ETF Providers News Trending Articles Technical Chart Market Movers Top Gainers Top Losers Most Active Premarket After Hours Market Heatmap Market Newsletter Stock Analysis Pro Watchlist Collapse Asian Paints Limited (NSE:ASIANPAINT) India Delayed Price Currency is INR Watchlist Compare 2,382.40 -16.50 (-0.69%) Jul 18, 2025, 3:30 PM IST Overview Financials Statistics Dividends Profile Chart Income Balance Sheet Cash Flow Ratios KPIs NEW Annual Quarterly TTM Asian Paints Ratios and Metrics Market cap in millions INR. Fiscal year is April - March. Millions INR. Fiscal year is Apr - Mar. Current Mil Millions Data Data Source Download Full Width Fiscal Year Current FY 2025 FY 2024 FY 2023 FY 2022 FY 2021 2016 - 2020 Period Ending Jul '25 Jul 18, 2025 Mar '25 Mar 31, 2025 Mar '24 Mar 31, 2024 Mar '23 Mar 31, 2023 Mar '22 Mar 31, 2022 Mar '21 Mar 31, 2021 2016 - 2020 Market Capitalization 2,285,193 2,245,146 2,730,596 2,648,969 2,954,281 2,433,868 Upgrade Market Cap Growth -17.78% -17.78% 3.08% -10.33% 21.38% 52.26% Upgrade Enterprise Value 2,267,766 2,248,587 2,720,035 2,646,482 2,937,249 2,423,015 Upgrade Last Close Price 2382.40 2319.25 2788.91 2682.96 2970.76 2432.52 Upgrade PE Ratio 62.28 61.22 50.01 64.51 97.48 77.53 Upgrade Forward PE 52.21 53.55 53.39 56.64 81.35 56.61 Upgrade PS Ratio 6.75 6.63 7.71 7.69 10.19 11.32 Upgrade PB Ratio 11.39 11.19 14.06 16.11 20.81 18.40 Upgrade P/TBV Ratio 12.15 11.94 15.27 17.01 22.08 19.84 Upgrade P/FCF Ratio 87.27 85.74 69.93 90.72 659.07 71.55 Upgrade P/OCF Ratio 51.65 50.75 44.74 63.17 299.47 66.08 Upgrade PEG Ratio 4.93 23.86 3.48 3.03 4.06 3.14 Upgrade EV/Sales Ratio 6.70 6.64 7.68 7.69 10.14 11.27 Upgrade EV/EBITDA Ratio 37.04 40.13 37.61 43.96 64.72 52.52 Upgrade EV/EBIT Ratio 44.29 45.15 40.34 48.44 73.67 59.62 Upgrade EV/FCF Ratio 86.60 85.87 69.66 90.63 655.27 71.23 Upgrade Debt / Equity Ratio 0.11 0.11 0.13 0.12 0.11 0.08 Upgrade Debt / EBITDA Ratio 0.38 0.38 0.33 0.31 0.33 0.23 Upgrade Debt / FCF Ratio 0.88 0.88 0.63 0.66 3.54 0.32 Upgrade Asset Turnover 1.12 1.12 1.27 1.41 1.34 1.18 Upgrade Inventory Turnover 3.12 3.12 3.34 3.45 3.71 3.40 Upgrade Quick Ratio 1.16 1.16 1.27 1.23 1.11 1.29 Upgrade Current Ratio 2.09 2.09 2.06 2.09 2.00 2.03 Upgrade Return on Equity (ROE) 18.79% 18.79% 30.99% 27.38% 22.49% 26.99% Upgrade Return on Assets (ROA) 10.32% 10.32% 15.13% 14.00% 11.50% 13.91% Upgrade Return on Capital (ROIC) 14.07% 14.07% 20.93% 19.99% 16.55% 19.56% Upgrade Return on Capital Employed (ROCE) 22.40% 22.40% 31.50% 30.50% 25.90% 28.10% Upgrade Earnings Yield 1.60% 1.63% 2.00% 1.55% 1.03% 1.29% Upgrade FCF Yield 1.15% 1.17% 1.43% 1.10% 0.15% 1.40% Upgrade Dividend Yield 1.03% 1.07% 1.19% 0.96% 0.65% 0.73% Upgrade Payout Ratio 85.63% 85.63% 46.72% 47.15% 57.45% 15.91% Upgrade Buyback Yield / Dilution 0.01% 0.01% -0.01% 0.02% 0.01% - Upgrade Total Shareholder Return 1.04% 1.08% 1.19% 0.97% 0.66% 0.73% Upgrade Updated Feb 4, 2025. Source: S&P Global Market Intelligence. Standard template. Financial Sources. Sections Stocks IPOs ETFs Blog Services Stock Analysis Pro Free Newsletter Get Support Install The App Website Login Create Account Changelog Sitemap Advertise FAQ Company About Contact Us Terms of Use Privacy Policy Data Disclaimer Affiliate Program Market Newsletter Daily market news in bullet point format. Subscribe Site Theme Light Dark 2025 StockAnalysis.com. All rights reserved.\", 'images': [], 'rank': 3}, {'url': 'https://www.wsj.com/market-data/quotes/IN/XNSE/ASIANPAINT/financials', 'content': '[error] Timeout while extracting content', 'rank': 4}, {'url': 'https://groww.in/stocks/asian-paints-ltd/company-financial', 'content': \"Asian Paints Financial Statements - Check Balance Sheet & EBITDA Stocks Invest in Stocks Invest in stocks, ETFs, IPOs with fast orders. Track returns on your stock holdings and view real-time P&L on your positions. Intraday Monitor top intraday performers in real time ETFs Get the best of Mutual Funds and flexibility of Stocks IPO Track upcoming and ongoing IPOs MTFs Buy now, pay later Stock Screener Filter based on RSI, PE ratio and more Stock Events Dividends, bonus, buybacks and more Demat Account Begin your stock market journey Share Market Today Live news updates from stock market F&O Trade in Futures & Options Trade in F&O using the terminal. View charts, indicators, track your orders , P&L and watchlists in a single space Indices Track markets across the globe Terminal Track charts, orders, positions, watchlists in one place Option chain Analyse chains, view payoffs, create baskets Pledge Get extra balance for trading Commodities Trade in Crude Oil, Gold, Silver and more API trading Set up and execute trades through our API Mutual Funds Invest in Mutual Funds Invest in direct mutual funds at zero charges via lump sump investments or SIPs Mutual Fund Houses Know about AMCs, funds, fund managers NFOs Track all active NFOs in one place Mutual Funds by Groww Mutual funds by Groww designed for your investment goals Mutual Funds screener Filter funds based on risk, fund size and more Track Funds Import funds and track all investments in a single place Compare Funds More SIP calculator Estimate returns on a SIP Brokerage calculator Estimate charges for your trade/investment Margin calculator Estimate balance needed to buy/sell a stock SWP calculator Returns on your systematic withdrawal plan Pricing Brokerage and charges on Groww Blog Asian Paints quarterly yearly Particulars Mar '24 Jun '24 Sep '24 Dec '24 Mar '25 Revenue 7,774 8,107 7,050 7,645 7,330 Expenses 6,252 6,515 5,993 6,168 6,172 EBITDA 1,751 1,819 1,304 1,736 1,462 EBIT 1,555 1,623 896.61 1,512 1,013 Profit Before Tax 1,522 1,592 857.57 1,476 979.00 Net Profit 1,209 1,192 602.31 1,104 694.28 Financial Ratios Operating Profit Margin 23.23 % 23.16 % 16.14 % 23.50 % 17.92 % Net Profit Margin 16.04 % 15.18 % 10.86 % 14.95 % 11.42 % Earning Per Share (Diluted) 12.61 12.44 6.28 11.51 7.24 Dividends Per Share 0.00 0.00 4.25 0.00 0.00 Overview Charts Company financials Peer comparison Shareholding pattern Vaishnavi Tech Park, South Tower, 3rd Floor Sarjapur Main Road, Bellandur, Bengaluru 560103 Karnataka Contact Us GROWW About Us Pricing Blog Media & Press Careers Help & Support Trust & Safety PRODUCTS Stocks F&O MTF ETF IPO Credit Mutual Funds Groww Terminal Stocks Screener Algo Trading Commodities Groww Digest Demat Account Groww AMC 2016-2025 Groww. All rights reserved. Version: 6.4.3 Share Market Indices F&O Mutual Funds Funds By Groww Calculators IPO Miscellaneous Top Gainers Stocks 52 Weeks High Stocks Tata Motors NHPC ITC Wipro BSE NTPC Top Losers Stocks 52 Weeks Low Stocks IREDA State Bank of India Adani Power CDSL Cochin Shipyard SJVN Most Traded Stocks Stocks Market Calender Tata Steel Tata Power Bharat Heavy Electricals Indian Oil Corporation HUDCO SAIL Stocks Feed Suzlon Energy Zomato (Eternal) Yes Bank Infosys NBCC IRCTC Share Market Live Update FII DII Activity IRFC Bharat Electronics HDFC Bank Vedanta Reliance Power Jaiprakash Power Ventures NIFTY 50 NIFTY Midcap 100 NIFTY 100 US Tech 100 NIFTY Realty Nikkei index SENSEX NIFTY Smallcap 100 NIFTY Auto Dow Jones Futures NIFTY PSU Bank NIFTY FMCG NIFTY BANK NIFTY MIDCAP 150 KOSPI Index Dow Jones Index Gift Nifty BSE BANKEX India VIX NIFTY Pharma HANG SENG Index BSE 100 FTSE 100 Index S&P 500 NIFTY NEXT 50 NIFTY Metal DAX Index NIFTY Fin Service CAC Index Nifty Pvt Bank NIFTY Bank Options SBI Options Bajaj Finance Options Axis Bank Options Hindustan Unilever Options NIFTY Bank Futures Finnifty Futures ITC Futures ICICI Bank Futures Biocon Futures Indusind Bank Futures NIFTY 50 Options HDFC Bank Options Wipro\", 'images': [], 'rank': 5}, {'url': 'https://www.etmoney.com/stocks/asian-paints-ltd/financials/944', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://dhan.co/stocks/asian-paints-ltd-financial-results/', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://trendlyne.com/fundamentals/financial-ratios/117/ASIANPAINT/asian-paints-ltd/', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
                  "annotations": null
                }
              ]
            },
            "created_files": [],
            "execution_time": 53.03988910000771,
            "error": null,
            "successful_variant": "CODE_1",
            "total_variants_tried": 1,
            "all_errors": []
          },
          "total_time": 53.04471819999162,
          "error": null
        }
      },
      "error": null,
      "cost": 0.0,
      "start_time": "2025-07-19T05:21:10.060206",
      "end_time": "2025-07-19T05:22:36.002983",
      "execution_time": 85.942777,
      "execution_result": {
        "status": "success",
        "session_id": "52902388",
        "operations": [
          "python_code"
        ],
        "created_files": [],
        "file_results": {},
        "code_results": {
          "status": "success",
          "result": {
            "financial_data": [
              {
                "type": "text",
                "text": "[{'url': 'https://www.moneycontrol.com/financials/asianpaints/ratiosVI/AP31', 'content': 'Would you like to receive Push Notifications? We promise to only send you relevant content and give you updates on your transactions No thanksAllow English Specials Hello, Login Go Ad-Free My Alerts Go PRO Now PRO Markets News Editors Picks Tech India Portfolio Watchlist Commodities Mutual Funds Personal Finance Forum Videos Invest Now Global Markets Indian Indices Economic Calendar IPO All Stats Technical Trends Earnings F&O US Markets Seasonality Analysis Options Webinar 26-27 July Options Webinar SENSEX 81,757.73 -501.51(-0.61%) NIFTY 50 24,968.40 -143.05(-0.57%) NIFTY BANK 56,283.00 -545.80(-0.96%) NIFTY Midcap 100 59,104.50 -414.60(-0.7%) 1 2 3 4 ETF FUNDS PARTNERED BY ICICI Prudential Nifty 50 Index Fund - Direct Plan (G)3 Year Return: 16.34%5 Year Return: 19.08%INVEST NOW EQUITY FUNDS PARTNERED BY Motilal Oswal Midcap Fund - Direct Plan (G)3 Year Return: 33.17%5 Year Return: 37.08%INVEST NOW EQUITY FUNDS PARTNERED BY Motilal Oswal Nifty Microcap 250 Index Fund - Direct Plan - Growth3 Year Return: NA5 Year Return: NAINVEST NOW EQUITY FUNDS PARTNERED BY Motilal Oswal Large and Midcap Fund - Direct Plan (G)3 Year Return: 32.64%5 Year Return: 30.8%INVEST NOW EQUITY FUNDS PARTNERED BY HSBC Mid Cap Fund - Direct Plan (G)3 Year Return: 26.84%5 Year Return: 27.42%INVEST NOW EQUITY FUNDS PARTNERED BY HSBC Multi Cap Fund - Direct Plan (G)3 Year Return: NA5 Year Return: NAINVEST NOW EQUITY FUNDS PARTNERED BY SBI Magnum Children`s Benefit Fund - Investment Plan - DP - (G)3 Year Return: 27.41%5 Year Return: NAINVEST NOW EQUITY FUNDS PARTNERED BY SBI Retirement Benefit Fund - Aggressive Plan - Direct Plan (G)3 Year Return: 18.39%5 Year Return: NAINVEST NOW EQUITY FUNDS PARTNERED BY HSBC Flexi Cap Fund - Direct Plan (G)3 Year Return: 23.88%5 Year Return: 23.94%INVEST NOW EQUITY FUNDS PARTNERED BY HSBC Value Fund - Direct Plan (G)3 Year Return: 29.12%5 Year Return: 29.46%INVEST NOW EQUITY FUNDS PARTNERED BY HSBC Value Fund - Direct Plan (G)3 Year Return: 29.12%5 Year Return: 29.46%INVEST NOW EQUITY FUNDS PARTNERED BY HSBC Value Fund - Direct Plan (G)3 Year Return: 29.12%5 Year Return: 29.46%INVEST NOW EQUITY FUNDS PARTNERED BY HSBC ELSS Tax saver Fund - Direct Plan - Growth3 Year Return: 24.38%5 Year Return: 23.42%INVEST NOW EQUITY FUNDS PARTNERED BY Mirae Asset Small Cap Fund - Direct Plan - Growth3 Year Return: NA5 Year Return: NAINVEST NOW EQUITY FUNDS PARTNERED BY Mirae Asset Balanced Advantage Fund - Direct Plan (G)3 Year Return: NA5 Year Return: NAINVEST NOW EQUITY FUNDS PARTNERED BY Canara Robeco Flexi Cap Fund - Direct Plan (G)3 Year Return: 19.42%5 Year Return: 21.53%INVEST NOW EQUITY FUNDS PARTNERED BY Canara Robeco Blue Chip Equity Fund - Direct Plan (G)3 Year Return: 19.4%5 Year Return: 20.63%INVEST NOW EQUITY FUNDS PARTNERED BY Canara Robeco Emerging Equities - Direct Plan (G)3 Year Return: 20.87%5 Year Return: 24.31%INVEST NOW EQUITY FUNDS PARTNERED BY Axis Small Cap Fund - Direct Plan (G)3 Year Return: 24.94%5 Year Return: 32.32%INVEST NOW EQUITY FUNDS PARTNERED BY HDFC Top 100 Fund - Direct Plan (G)3 Year Return: 19.97%5 Year Return: 22.68%INVEST NOW EQUITY FUNDS PARTNERED BY Canara Robeco Manufacturing Fund - Direct Plan - Growth3 Year Return: NA5 Year Return: NAINVEST NOW EQUITY FUNDS PARTNERED BY Bandhan Nifty Alpha 50 Index Fund - Regular Plan - Growth3 Year Return: NA5 Year Return: NAINVEST NOW EQUITY FUNDS PARTNERED BY SBI Blue Chip Fund - Direct Plan (G)3 Year Return: 17.73%5 Year Return: 20.93%INVEST NOW EQUITY FUNDS PARTNERED BY Bandhan Small Cap Fund - Direct Plan - Growth3 Year Return: 35.95%5 Year Return: 38.25%INVEST NOW EQUITY FUNDS PARTNERED BY Bandhan Infrastructure Fund - Direct Plan (G)3 Year Return: 34.37%5 Year Return: 36.38%INVEST NOW EQUITY FUNDS PARTNERED BY Bandhan Core Equity Fund - Direct Plan (G)3 Year Return: 28.52%5 Year Return: 28.89%INVEST NOW EQUITY FUNDS PARTNERED BY SBI Long Term Equity Fund - Direct Plan (G)3 Year Return: 28.29%5 Year Return: 27.86%INVEST NOW EQUITY FUNDS PARTNE', 'images': [], 'rank': 1}, {'url': 'https://tickjournal.com/stock-screener/asian-paints-ltd/financial-statements/', 'content': 'Dashboard Stock Screener Stats Calendar Settings Sign Out New Trade New Note Asian Paints Complete Financial Statements ASIANPAINT Review detailed financials to uncover trends, confirm thesis & journal trades 11 Years of Data 2025 - 2015 Complete Financial Data Export Download Excel Download CSV Export complete financial statements for Asian Paints (ASIANPAINT). Downloads include all available records across all periods. For market performance, see the ASIANPAINT stock price today. Profitability Ratios NET PROFIT MARGIN 8.29% 2025 data EBITDA MARGIN 15.94% 2025 data OPERATING MARGIN 15.00% 2025 data RETURN ON ASSETS 2.31% 2025 data RETURN ON EQUITY 3.49% 2025 data Balance Sheet Ratios CURRENT RATIO 7.83 2025 data DEBT TO EQUITY 1.51 2025 data EQUITY RATIO 66.05% 2025 data ASSET TURNOVER 0.28 2025 data Year-over-Year Growth Analysis Comparing Mar 2024 vs Mar 2025 Revenue Growth -5.2% Year-over-Year Net Profit Growth -45.0% Year-over-Year EBITDA Growth -28.2% Year-over-Year Expense Growth +1.0% Year-over-Year Assets Growth +1.5% Year-over-Year Equity Growth +3.3% Year-over-Year Liabilities Growth +1.5% Year-over-Year Operating Cash Flow Growth -27.5% Year-over-Year Investing Cash Flow Growth +63.1% Year-over-Year Financing Cash Flow Growth -25.8% Year-over-Year Income Statement Periods Crores Particulars\\tMar 2025\\tSept 2024\\tMar 2024\\tJun 2024\\tDec 2024\\tSept 2023\\tMar 2023\\tJun 2023\\tDec 2023\\tSept 2022\\tMar 2022\\tJun 2022\\tDec 2022\\tSept 2021\\tMar 2021\\tJun 2021\\tDec 2021\\tSept 2020\\tMar 2020\\tJun 2020\\tDec 2020\\tSept 2019\\tMar 2019\\tJun 2019\\tDec 2019\\tSept 2018\\tMar 2018\\tJun 2018\\tDec 2018\\tSept 2017\\tMar 2017\\tJun 2017\\tDec 2017\\tSept 2016\\tMar 2016\\tJun 2016\\tDec 2016\\tSept 2015\\tMar 2015\\tJun 2015\\tDec 2015 Revenue\\t8,453\\t8,208\\t8,914\\t9,136\\t8,714\\t8,646\\t8,880\\t9,382\\t9,261\\t8,548\\t7,979\\t8,691\\t8,730\\t7,244\\t6,623\\t5,675\\t8,549\\t5,445\\t4,695\\t2,970\\t6,912\\t5,171\\t5,055\\t5,190\\t5,509\\t4,688\\t4,528\\t4,464\\t5,328\\t4,401\\t3,993\\t3,905\\t4,327\\t3,794\\t3,714\\t3,661\\t3,926\\t3,457\\t3,532\\t3,353\\t3,826 Expenses\\t7,106\\t6,968\\t7,039\\t7,276\\t6,913\\t6,762\\t6,947\\t7,061\\t7,047\\t7,230\\t6,565\\t7,075\\t7,025\\t6,192\\t5,333\\t4,674\\t6,985\\t4,085\\t3,776\\t2,453\\t5,001\\t4,099\\t4,108\\t3,949\\t4,231\\t3,772\\t3,644\\t3,461\\t4,160\\t3,464\\t3,201\\t3,150\\t3,369\\t3,004\\t2,970\\t2,771\\t3,100\\t2,827\\t2,978\\t2,656\\t3,103 EBITDA\\t1,347\\t1,240\\t1,875\\t1,860\\t1,802\\t1,884\\t1,932\\t2,321\\t2,214\\t1,318\\t1,414\\t1,615\\t1,704\\t1,053\\t1,290\\t1,001\\t1,564\\t1,360\\t919\\t517\\t1,911\\t1,073\\t947\\t1,242\\t1,278\\t917\\t884\\t1,003\\t1,168\\t937\\t792\\t755\\t957\\t790\\t745\\t890\\t826\\t630\\t555\\t698\\t724 Operating Profit Margin %\\t15.00%\\t13.00%\\t19.00%\\t19.00%\\t19.00%\\t20.00%\\t21.00%\\t23.00%\\t22.00%\\t14.00%\\t17.00%\\t18.00%\\t18.00%\\t13.00%\\t18.00%\\t16.00%\\t17.00%\\t24.00%\\t19.00%\\t16.00%\\t26.00%\\t19.00%\\t18.00%\\t23.00%\\t22.00%\\t18.00%\\t19.00%\\t21.00%\\t21.00%\\t19.00%\\t18.00%\\t17.00%\\t21.00%\\t19.00%\\t19.00%\\t23.00%\\t20.00%\\t17.00%\\t15.00%\\t19.00%\\t18.00% Depreciation\\t301\\t242\\t226\\t228\\t256\\t209\\t220\\t198\\t220\\t216\\t205\\t208\\t214\\t203\\t213\\t201\\t208\\t194\\t195\\t191\\t193\\t197\\t179\\t192\\t197\\t144\\t91\\t136\\t165\\t89\\t83\\t91\\t90\\t83\\t72\\t84\\t85\\t68\\t67\\t66\\t69 Interest\\t53\\t63\\t54\\t55\\t56\\t51\\t39\\t46\\t54\\t35\\t23\\t29\\t41\\t24\\t30\\t22\\t28\\t21\\t26\\t20\\t21\\t26\\t30\\t27\\t24\\t26\\t9\\t21\\t29\\t9\\t9\\t8\\t9\\t6\\t15\\t6\\t9\\t9\\t10\\t9\\t8 Profit Before Tax\\t1,022\\t959\\t1,624\\t1,604\\t1,518\\t1,651\\t1,710\\t2,105\\t1,968\\t1,094\\t1,189\\t1,407\\t1,478\\t826\\t1,156\\t779\\t1,394\\t1,146\\t699\\t306\\t1,697\\t849\\t738\\t1,023\\t1,057\\t747\\t784\\t846\\t974\\t840\\t701\\t657\\t859\\t701\\t658\\t799\\t732\\t594\\t522\\t664\\t698 Tax\\t321\\t265\\t349\\t417\\t390\\t419\\t451\\t530\\t493\\t290\\t315\\t371\\t381\\t221\\t286\\t204\\t362\\t294\\t219\\t86\\t431\\t7\\t252\\t351\\t278\\t243\\t288\\t276\\t327\\t246\\t221\\t216\\t291\\t206\\t222\\t247\\t243\\t175\\t170\\t198\\t216 Net Profit\\t701\\t694\\t1,275\\t1,187\\t1,128\\t1,232\\t1,258\\t1,575\\t1,475\\t804\\t874\\t1,036\\t1,097\\t605\\t870\\t574\\t1,031\\t852\\t480\\t220\\t1,265\\t842\\t486\\t672\\t780\\t505\\t496\\t570\\t647\\t594\\t480\\t441\\t567\\t495\\t436\\t553\\t489\\t419\\t352\\t466\\t482 Earnings Per Share ()\\t7.22\\t7.25\\t13.11\\t12.20\\t11.58\\t12.57\\t12.87\\t16.17\\t15.10\\t8.16\\t8.87\\t10.60\\t11.19\\t6.21\\t8.88\\t5.93\\t10.59\\t8.66\\t4.82\\t2.28\\t12.91\\t8.58\\t4.93\\t6.83\\t7.97\\t5.12\\t5.01\\t5.81\\t6.63\\t6.00\\t4.82\\t4.46\\t5.78\\t4.96\\t4.37\\t5.58\\t4.86\\t4.21\\t3.55\\t4.73\\t4.89 Scroll horizontally Related Pages for Asian Paints Additional stock information and data for ASIANPAINT ASIANPAINT share price history As', 'images': [], 'rank': 2}, {'url': 'https://stockanalysis.com/quote/nse/ASIANPAINT/financials/ratios/', 'content': \"Asian Paints (NSE:ASIANPAINT) Financial Ratios and Metrics Skip to main content Log In Sign Up Home Stocks Stock Screener Stock Exchanges Comparison Tool Earnings Calendar By Industry Stock Lists Top Analysts Top Stocks Corporate Actions IPOs Recent IPOs IPO Calendar IPO Statistics IPO News IPO Screener ETFs ETF Screener Comparison Tool New Launches ETF Providers News Trending Articles Technical Chart Market Movers Top Gainers Top Losers Most Active Premarket After Hours Market Heatmap Market Newsletter Stock Analysis Pro Watchlist Collapse Asian Paints Limited (NSE:ASIANPAINT) India Delayed Price Currency is INR Watchlist Compare 2,382.40 -16.50 (-0.69%) Jul 18, 2025, 3:30 PM IST Overview Financials Statistics Dividends Profile Chart Income Balance Sheet Cash Flow Ratios KPIs NEW Annual Quarterly TTM Asian Paints Ratios and Metrics Market cap in millions INR. Fiscal year is April - March. Millions INR. Fiscal year is Apr - Mar. Current Mil Millions Data Data Source Download Full Width Fiscal Year Current FY 2025 FY 2024 FY 2023 FY 2022 FY 2021 2016 - 2020 Period Ending Jul '25 Jul 18, 2025 Mar '25 Mar 31, 2025 Mar '24 Mar 31, 2024 Mar '23 Mar 31, 2023 Mar '22 Mar 31, 2022 Mar '21 Mar 31, 2021 2016 - 2020 Market Capitalization 2,285,193 2,245,146 2,730,596 2,648,969 2,954,281 2,433,868 Upgrade Market Cap Growth -17.78% -17.78% 3.08% -10.33% 21.38% 52.26% Upgrade Enterprise Value 2,267,766 2,248,587 2,720,035 2,646,482 2,937,249 2,423,015 Upgrade Last Close Price 2382.40 2319.25 2788.91 2682.96 2970.76 2432.52 Upgrade PE Ratio 62.28 61.22 50.01 64.51 97.48 77.53 Upgrade Forward PE 52.21 53.55 53.39 56.64 81.35 56.61 Upgrade PS Ratio 6.75 6.63 7.71 7.69 10.19 11.32 Upgrade PB Ratio 11.39 11.19 14.06 16.11 20.81 18.40 Upgrade P/TBV Ratio 12.15 11.94 15.27 17.01 22.08 19.84 Upgrade P/FCF Ratio 87.27 85.74 69.93 90.72 659.07 71.55 Upgrade P/OCF Ratio 51.65 50.75 44.74 63.17 299.47 66.08 Upgrade PEG Ratio 4.93 23.86 3.48 3.03 4.06 3.14 Upgrade EV/Sales Ratio 6.70 6.64 7.68 7.69 10.14 11.27 Upgrade EV/EBITDA Ratio 37.04 40.13 37.61 43.96 64.72 52.52 Upgrade EV/EBIT Ratio 44.29 45.15 40.34 48.44 73.67 59.62 Upgrade EV/FCF Ratio 86.60 85.87 69.66 90.63 655.27 71.23 Upgrade Debt / Equity Ratio 0.11 0.11 0.13 0.12 0.11 0.08 Upgrade Debt / EBITDA Ratio 0.38 0.38 0.33 0.31 0.33 0.23 Upgrade Debt / FCF Ratio 0.88 0.88 0.63 0.66 3.54 0.32 Upgrade Asset Turnover 1.12 1.12 1.27 1.41 1.34 1.18 Upgrade Inventory Turnover 3.12 3.12 3.34 3.45 3.71 3.40 Upgrade Quick Ratio 1.16 1.16 1.27 1.23 1.11 1.29 Upgrade Current Ratio 2.09 2.09 2.06 2.09 2.00 2.03 Upgrade Return on Equity (ROE) 18.79% 18.79% 30.99% 27.38% 22.49% 26.99% Upgrade Return on Assets (ROA) 10.32% 10.32% 15.13% 14.00% 11.50% 13.91% Upgrade Return on Capital (ROIC) 14.07% 14.07% 20.93% 19.99% 16.55% 19.56% Upgrade Return on Capital Employed (ROCE) 22.40% 22.40% 31.50% 30.50% 25.90% 28.10% Upgrade Earnings Yield 1.60% 1.63% 2.00% 1.55% 1.03% 1.29% Upgrade FCF Yield 1.15% 1.17% 1.43% 1.10% 0.15% 1.40% Upgrade Dividend Yield 1.03% 1.07% 1.19% 0.96% 0.65% 0.73% Upgrade Payout Ratio 85.63% 85.63% 46.72% 47.15% 57.45% 15.91% Upgrade Buyback Yield / Dilution 0.01% 0.01% -0.01% 0.02% 0.01% - Upgrade Total Shareholder Return 1.04% 1.08% 1.19% 0.97% 0.66% 0.73% Upgrade Updated Feb 4, 2025. Source: S&P Global Market Intelligence. Standard template. Financial Sources. Sections Stocks IPOs ETFs Blog Services Stock Analysis Pro Free Newsletter Get Support Install The App Website Login Create Account Changelog Sitemap Advertise FAQ Company About Contact Us Terms of Use Privacy Policy Data Disclaimer Affiliate Program Market Newsletter Daily market news in bullet point format. Subscribe Site Theme Light Dark 2025 StockAnalysis.com. All rights reserved.\", 'images': [], 'rank': 3}, {'url': 'https://www.wsj.com/market-data/quotes/IN/XNSE/ASIANPAINT/financials', 'content': '[error] Timeout while extracting content', 'rank': 4}, {'url': 'https://groww.in/stocks/asian-paints-ltd/company-financial', 'content': \"Asian Paints Financial Statements - Check Balance Sheet & EBITDA Stocks Invest in Stocks Invest in stocks, ETFs, IPOs with fast orders. Track returns on your stock holdings and view real-time P&L on your positions. Intraday Monitor top intraday performers in real time ETFs Get the best of Mutual Funds and flexibility of Stocks IPO Track upcoming and ongoing IPOs MTFs Buy now, pay later Stock Screener Filter based on RSI, PE ratio and more Stock Events Dividends, bonus, buybacks and more Demat Account Begin your stock market journey Share Market Today Live news updates from stock market F&O Trade in Futures & Options Trade in F&O using the terminal. View charts, indicators, track your orders , P&L and watchlists in a single space Indices Track markets across the globe Terminal Track charts, orders, positions, watchlists in one place Option chain Analyse chains, view payoffs, create baskets Pledge Get extra balance for trading Commodities Trade in Crude Oil, Gold, Silver and more API trading Set up and execute trades through our API Mutual Funds Invest in Mutual Funds Invest in direct mutual funds at zero charges via lump sump investments or SIPs Mutual Fund Houses Know about AMCs, funds, fund managers NFOs Track all active NFOs in one place Mutual Funds by Groww Mutual funds by Groww designed for your investment goals Mutual Funds screener Filter funds based on risk, fund size and more Track Funds Import funds and track all investments in a single place Compare Funds More SIP calculator Estimate returns on a SIP Brokerage calculator Estimate charges for your trade/investment Margin calculator Estimate balance needed to buy/sell a stock SWP calculator Returns on your systematic withdrawal plan Pricing Brokerage and charges on Groww Blog Asian Paints quarterly yearly Particulars Mar '24 Jun '24 Sep '24 Dec '24 Mar '25 Revenue 7,774 8,107 7,050 7,645 7,330 Expenses 6,252 6,515 5,993 6,168 6,172 EBITDA 1,751 1,819 1,304 1,736 1,462 EBIT 1,555 1,623 896.61 1,512 1,013 Profit Before Tax 1,522 1,592 857.57 1,476 979.00 Net Profit 1,209 1,192 602.31 1,104 694.28 Financial Ratios Operating Profit Margin 23.23 % 23.16 % 16.14 % 23.50 % 17.92 % Net Profit Margin 16.04 % 15.18 % 10.86 % 14.95 % 11.42 % Earning Per Share (Diluted) 12.61 12.44 6.28 11.51 7.24 Dividends Per Share 0.00 0.00 4.25 0.00 0.00 Overview Charts Company financials Peer comparison Shareholding pattern Vaishnavi Tech Park, South Tower, 3rd Floor Sarjapur Main Road, Bellandur, Bengaluru 560103 Karnataka Contact Us GROWW About Us Pricing Blog Media & Press Careers Help & Support Trust & Safety PRODUCTS Stocks F&O MTF ETF IPO Credit Mutual Funds Groww Terminal Stocks Screener Algo Trading Commodities Groww Digest Demat Account Groww AMC 2016-2025 Groww. All rights reserved. Version: 6.4.3 Share Market Indices F&O Mutual Funds Funds By Groww Calculators IPO Miscellaneous Top Gainers Stocks 52 Weeks High Stocks Tata Motors NHPC ITC Wipro BSE NTPC Top Losers Stocks 52 Weeks Low Stocks IREDA State Bank of India Adani Power CDSL Cochin Shipyard SJVN Most Traded Stocks Stocks Market Calender Tata Steel Tata Power Bharat Heavy Electricals Indian Oil Corporation HUDCO SAIL Stocks Feed Suzlon Energy Zomato (Eternal) Yes Bank Infosys NBCC IRCTC Share Market Live Update FII DII Activity IRFC Bharat Electronics HDFC Bank Vedanta Reliance Power Jaiprakash Power Ventures NIFTY 50 NIFTY Midcap 100 NIFTY 100 US Tech 100 NIFTY Realty Nikkei index SENSEX NIFTY Smallcap 100 NIFTY Auto Dow Jones Futures NIFTY PSU Bank NIFTY FMCG NIFTY BANK NIFTY MIDCAP 150 KOSPI Index Dow Jones Index Gift Nifty BSE BANKEX India VIX NIFTY Pharma HANG SENG Index BSE 100 FTSE 100 Index S&P 500 NIFTY NEXT 50 NIFTY Metal DAX Index NIFTY Fin Service CAC Index Nifty Pvt Bank NIFTY Bank Options SBI Options Bajaj Finance Options Axis Bank Options Hindustan Unilever Options NIFTY Bank Futures Finnifty Futures ITC Futures ICICI Bank Futures Biocon Futures Indusind Bank Futures NIFTY 50 Options HDFC Bank Options Wipro\", 'images': [], 'rank': 5}, {'url': 'https://www.etmoney.com/stocks/asian-paints-ltd/financials/944', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://dhan.co/stocks/asian-paints-ltd-financial-results/', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://trendlyne.com/fundamentals/financial-ratios/117/ASIANPAINT/asian-paints-ltd/', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
                "annotations": null
              }
            ]
          },
          "created_files": [],
          "execution_time": 53.03988910000771,
          "error": null,
          "successful_variant": "CODE_1",
          "total_variants_tried": 1,
          "all_errors": []
        },
        "total_time": 53.04471819999162,
        "error": null
      },
      "input_tokens": 0,
      "output_tokens": 0
    },
    {
      "id": "T003",
      "description": "Research Asian Paints' market position, including market share, competitive landscape, and key competitors.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Investigate Asian Paints' market position, including its market share in the paints and coatings industry, the competitive landscape, and its key competitors. Gather data on market trends, growth rates, and the company's competitive advantages and disadvantages. Use market research reports, industry publications, and competitor analysis from reliable sources.",
      "reads": [],
      "writes": [
        "T003"
      ],
      "status": "running",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": "2025-07-19T05:22:41.026073",
      "end_time": null,
      "execution_time": 0.0
    },
    {
      "id": "T004",
      "description": "Gather data on Asian Paints' key competitors, including their market share, financial performance, product offerings, and competitive strategies.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Collect information on Asian Paints' key competitors, focusing on their market share, financial performance, product offerings, and competitive strategies. This should include a detailed analysis of their strengths and weaknesses, and how they compare to Asian Paints. Use competitor analysis reports, financial news, and industry publications.",
      "reads": [],
      "writes": [
        "T004"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    },
    {
      "id": "T005",
      "description": "Analyze the data collected on Asian Paints' business overview and financial performance to create visualizations (graphs and tables) showcasing revenue trends, profit margins, and other key financial metrics.",
      "agent": "CoderAgent",
      "agent_prompt": "Analyze the data gathered on Asian Paints' business overview from T001 and financial performance from T002 to create visualizations (graphs and tables) illustrating revenue trends, profit margins, key financial ratios, and balance sheet information. Ensure that the visualizations are clear, concise, and effectively communicate the financial performance of the company. The visualizations should be designed to be included in an HTML report and can use libraries such as matplotlib, seaborn, or plotly. Save the graphs in appropriate image format for websites like .png and .jpeg. Make sure each file has a unique name to avoid overwriting. Return links of created images in the output.",
      "reads": [
        "T001",
        "T002"
      ],
      "writes": [
        "T005"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    },
    {
      "id": "T006",
      "description": "Compare Asian Paints' market position and competitive strategies with its key competitors, and create visualizations (graphs and tables) that highlight the comparisons.",
      "agent": "CoderAgent",
      "agent_prompt": "Compare Asian Paints' market position and competitive strategies (collected in T003) with its key competitors (collected in T004). Create visualizations (graphs and tables) that highlight the comparisons in market share, financial performance, product offerings, and competitive strategies. Ensure that the visualizations clearly show the relative strengths and weaknesses of Asian Paints compared to its competitors. The visualizations should be suitable for inclusion in an HTML report. Save the graphs in appropriate image format for websites like .png and .jpeg. Make sure each file has a unique name to avoid overwriting. Return links of created images in the output.",
      "reads": [
        "T003",
        "T004"
      ],
      "writes": [
        "T006"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    },
    {
      "id": "T007",
      "description": "Create a comprehensive and well-formatted HTML report on Asian Paints, including the business overview, financial performance analysis, market position analysis, competitor comparison, and visualizations generated in the previous steps.",
      "agent": "FormatterAgent",
      "agent_prompt": "Create a comprehensive and well-formatted HTML report on Asian Paints. The report should include:\n\n- A detailed business overview (from T001).\n- A thorough analysis of financial performance, including revenue trends, profit margins, key financial ratios, and balance sheet information (from T002), along with visualizations generated in T005.\n- An analysis of Asian Paints' market position, including market share, competitive landscape, and key competitors (from T003 and T004), along with visualizations generated in T006.\n- A comparison of Asian Paints with its key competitors, highlighting their strengths and weaknesses.\n\nEnsure the report is well-structured, visually appealing, and easy to read. Use appropriate HTML tags, CSS styling, and incorporate the visualizations (graphs and tables) effectively to enhance the report's clarity and impact. The visualizations are available in the output fields of T005 and T006, ready to be embedded. DO NOT CALL CoderAgent, as CoderAgent cannot create visually appealing HTML reports. Use HTML formatting. The final output has to be just the final HTML report.",
      "reads": [
        "T001",
        "T002",
        "T003",
        "T004",
        "T005",
        "T006"
      ],
      "writes": [
        "T007"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    }
  ],
  "links": [
    {
      "source": "ROOT",
      "target": "T001"
    },
    {
      "source": "ROOT",
      "target": "T002"
    },
    {
      "source": "ROOT",
      "target": "T003"
    },
    {
      "source": "ROOT",
      "target": "T004"
    },
    {
      "source": "T001",
      "target": "T005"
    },
    {
      "source": "T002",
      "target": "T005"
    },
    {
      "source": "T003",
      "target": "T006"
    },
    {
      "source": "T004",
      "target": "T006"
    },
    {
      "source": "T005",
      "target": "T007"
    },
    {
      "source": "T006",
      "target": "T007"
    }
  ]
}