{
  "raw_search_results_T001": [
    {
      "type": "text",
      "text": "[{'url': 'https://duckduckgo.com/y.js?ad_domain=udyogsuvidhakendra.in&ad_provider=bingv7aa&ad_type=txad&click_metadata=uc9THn94U4l_8nZTJbQreXyfKWgMZ3lkzeCJrGDS8ITXYd1qjHJSfA5khO5PxqveEEIplTe_ObGscCV1muyACYw2JVpDtzYR32bfgpzVBIeiCHt14amgi6%2D0yrFIY1A8.VoYcyQ%2DyqFU8hVNvoAsxMg&rut=98f8eec85d0727aad5a393a07fc1772070a7d794b29c9eecdabd45391280824d&u3=https%3A%2F%2Fwww.bing.com%2Faclick%3Fld%3De8o4mrKzayNPc7nuxTa8ckWTVUCUyrhXB2Y_M8wE2JzhXxP_ZMjWp%2DuE3HSHzHjKUvLZU4pph8QxNNVbjxU9LjWnKA9P7v_gZ%2DAyDd8Axkj1dTHmDf6YrAj0K8KMxq85t9rldItQN37hJwk55ISquQiKKqIR9gojW_g7jFTDUGbU%2Du3nqsJwtPxJRl9YqXTzD%2DPDbIgw%26u%3DaHR0cHMlM2ElMmYlMmZ1ZHlvZ3N1dmlkaGFrZW5kcmEuaW4lMmZzdGFydHVwLWluZGlhLXJlZ2lzdHJhdGlvbiUzZm1zY2xraWQlM2Q0Y2MwN2FkMDJmMWQxZGVjZGNjMDEyOGY0NTU5ZTk0OA%26rlid%3D4cc07ad02f1d1decdcc0128f4559e948&vqd=4-99351163356123648088406255317405533005&iurl=%7B1%7DIG%3D08425940C5884D84996C844257E333F5%26CID%3D315C89D4E4AA6121031F9FCDE55260B9%26ID%3DDevEx%2C5048.1', 'content': \"Startup India Registration 2025 Get your Startup Certificate Support Timing: 10:30 AM to 06:00 PM, Monday To Saturday hello@udyogsuvidhakendra.in Business Proprietorship Partnership Nidhi Company Trust Registration Producer Company MCA Name Approval Section 8 Company One Person Company Private Limited Company Limited Liability Partnership Proprietor to LLP Company Proprietor to One Person Company Proprietor to Pvt Ltd Company Partnership to LLP Company Partnership to Pvt Ltd Company Registration GeM Registration Food Registration Udyam Registration ISO Registration PF Registration Barcode Registration Darpan Registration ZED Certification DSC Registration BIS Registration GST Registration ESI Registration FCRA Registration RCMC Registration APEDA Registration Gumasta Registration DOT OSP ISP LICENSE Startup India Registration Fire Licence Only 12A Registration ICEGATE Registration Only 80G Registration 12A and 80G Registration Tax Exemption Certificate Import-Export Registration RERA Registration for Agents Professional Tax Registration MCA Services ADT-1 Filing LLP Compliance OPC Compliance DIN eKYC Filing DIN Reactivation Director Change Share Transfer Demat of Shares PF Return Filing Business Plan DPT-3 Filing Remove Director ESI Return Filing LLP Form 11 Filing MOA Amendment AOA Amendment Dormant Status Filing Company Compliance FLA Return Filing Winding Up - LLP Winding Up-Company Partnership Compliance Registered Office Change Name Change - Company Proprietorship Compliance Authorized Capital Increase Professional Tax Return Filing IT & GST GST Nil Return GST Return Filing Composition Return GST Cancellation ITR-1 (Only Salary) ITR-2 (Salary & Other Income) ITR-3 Return Filing ITR-4 Return Filing Skill India NSDC Affiliation Consultation SSC Affiliation Consultation TP Registration Consultation TC Registration Consultation ToT / ToA / NIESBUD Consultation Skill India Registration Consultation Startup India Registration 2025 Get your Startup Certificate Startup India is a flagship initiative of the GoI, intended to catalyse startup culture and build a strong and inclusive ecosystem for innovation in India. At Udyog Suvidha Kendra, We assist and promote businesses by helping them obtain DPIIT recognition by doing. Startup Certificate Registration Benefits of Startup India Certificate Tax Exemptions: Enjoy income tax relief for 3 years. Funding Support: Access to government equity funding. Simplified Compliance: Self-certify under labor and environmental laws. IPR Benefits: Fast-track patent and trademark applications. Government Tenders: Bid on tenders without prior experience. Incubator Support: Get help from govt-approved incubators. We are India's fastest growing online business services platform dedicated to helping people to start and grow their business, at an affordable cost. Our aim is to help the entrepreneur with regulatory requirements, and offering support at every stage to ensure the business remains compliant and continually growing. We are Private Organization and providing services and assistance for Business Benefits who require consultation. Application for Startup India Registration 2025 Name of Startup* Enter name of your Business Startup Type of Organisation* Select Type of Business One Person Pvt Ltd Company (Not Proprietor) Private Limited Company Limited Liability Partnership Partnership Firm HUF Please select type of business. Company Pan Number* Please enter pan number. E-Mail ID* Please enter your email id. Mobile No.* Please enter your mobile number. Name of Authorized Person* Please enter name of authorized person. Personal Pan Number* Please enter pan number. Address of Business* Please enter your address. City* Please enter city. State* Select State ANDAMAN AND NICOBAR ISLANDS ANDHRA PRADESH ARUNACHAL PRADESH ASSAM BIHAR CHANDIGARH CHHATTISGARH DADRA AND NAGAR HAVELI DAMAN AND DIU DELHI GOA GUJARAT HARYANA HIMACHAL PRADESH JAMMU AND KASHMIR JHARKHAND KARNATAKA KERALA Ladakh LAKSHADWEEP MADHYA PRADESH MAHARASHTRA MANIPUR MEGHALAYA MIZORAM NAGALAND ODISHA PUDUCHERRY PUNJAB RAJASTHAN SIKKIM TAMIL NADU TELANGANA TRIPURA UTTAR PRADESH UTTARAKHAND WEST BENGAL Please select state. Pincode* Please enter pincode. Do your Company Have GST Number?* Yes No Company GST Number Please enter GST Number. I, THE APPLICANT (OWNER OF AADHAAR NUMBER USED IN APPLICATION) AGREE TO SHARE DETAILS / PASSCODES ETC AS & WHEN REQUIRED FOR THE PURPOSE OF STARTUP INDIA REGISTRATION AND ITS RELATED SERVICES. [UPDATED] You Must agree both Terms before Submitting the Form. I ACCEPT Terms & Conditions , Privacy Policies & Refund Policies AND PROVIDE MY CONSENT TO REGISTER US ON GOVERNMENT PORTAL. I AGREE THAT FEES COLLECTED ARE FOR PROFESSIONAL CHARGES OF A PRIVATE CONSULTING FIRM AND DO NOT INCLUDE ANY GOVERNMENT FEES. You Must agree both Terms before Submitting the Form. Submit & Review Form Home Certificate Registration Startup India Registration 2025 Startup India Registration 2025 4.8 4355 customers Process of Startup India Registration 2025 DAY 1 Fill Online Application Form & Make Payment Get Call for Further Information, Documents & Advice Creation of Login Credentials for the Company DAY 2 - 4 Review and Verification of Documents Received Creation of Digital Signature of the Company DAY 5 - 7 Review Information of Starup & PitchDeck Profile Completion on National Single Window DAY 8 - 9 Filing of an Application using the Credentials Government Processing Time DAY 10 - 15 Resolution of Queries if any, Raised via Authorities Disptach of Company DSC with Token Issuance of Startup Certificate on email ERROR Close STARTUP INDIA CERTIFICATE BENEFITS The Startup India Registration 2025 process on Udyog Suvidha Kendra starts with filling out an online application and payment. followed by a call for additional information and document submission. After verification, a digital signature for the company is created, and the startup profile is completed on the National Single Window platform. The application is then filed, processed by the government, and any raised queries are resolved. Upon approval, the Digital Signature Certificate (DSC) and token are issued, and the final Startup Certificate is sent via email, completing the registration. Tax Exemption The entity registered under the Startup India Scheme can apply for an exemption of income tax under section 80 IAC of the Income Tax Act. Such an entity can avail tax exemption for 3 consecutive financial years out of first 10 years from the date of incorporation provided following conditions are fulfilled: (1) An entity shall be a Private Limited Company or (2) Limited Liability Partnership. (3) It shall be incorporated between 01st April 2016 to 01st April 2021. Angel Tax Exemption The Startup India recognized entity can avail tax exemption benefit from the funds received as angel investment. The exemption is only granted if the total amount of paid-up share capital and share premium does not exceed Rs. 25 Crore after the proposed issue of share. To avail this exemption the entity need to fulfil some conditions for investing in certain assets. Rebate in Trademark and Patent Fees* All the startups registered under this scheme can claim a rebate on the government fees for filing a trademark application. And up to 80% rebate in Patent applications and can avail the benefit of fast track patent application. Entire fees of Facilitators for any number of Patents, Trademarks or Designs a Startup may file, shall be borne by the Government. Hence Startups will have to bear the cost of Statutory Fees only. Self Certification Startups can self certify the compliance under 6 Labour Laws and 3 Environmental Laws for 5 years from the date of incorporation. Government Tenders Registering an entity under the DIPP recognition scheme enable Startups to apply for Government tenders. One of the requirements of having minimum prior experience/turnover for filing the government tender by the companies is not applicabl\", 'rank': 1}, {'url': 'https://techcrunch.com/2025/06/25/indian-drone-startup-raphe-mphibr-raises-100m-as-military-uav-demand-soars/', 'content': 'Indian drone startup Raphe mPhibr raises $100M as military UAV demand soars | TechCrunch Indian drone startup Raphe mPhibr raises $100M as military UAV demand soars | TechCrunch TechCrunch Desktop Logo TechCrunch Mobile Logo Latest Startups Venture Apple Security AI Apps Events Podcasts Newsletters Search Submit Site Search Toggle Mega Menu Toggle Topics Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture More from TechCrunch Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us Image Credits: Raphe mPhibr Transportation Indian drone startup Raphe mPhibr raises $100M as military UAV demand soars Jagmeet Singh 7:00 PM PDT June 25, 2025 Indian drone startup Raphe mPhibr has raised $100 million in an all-equity Series B round led by General Catalyst, as the startup aims to boost its R&D and local production capabilities amid growing demand for drones in battlefields and for border surveillance. Drones are becoming increasingly ubiquitous in global military operations. In recent and ongoing conflicts, countries have turned to drones for rapid infiltration and high-impact strikes . The recent India-Pakistan war is a prime example, with both militaries deploying drones at scale despite having advanced fighter jets and missile systems. The conflict spurred New Delhi to triple its drone spending to $470 million over the next 12 to 14 months, according to the Drone Federation of India, an association representing over 550 companies. While China remains the dominant force in global drone manufacturing, Raphe mPhibr aims to strengthen Indias indigenous drone capabilities. Co-founded by siblings Vikash Mishra (chairman) and Vivek Mishra (CEO) in 2017, the Noida-based startup currently offers nine different drones with payloads ranging from 4.4 pounds to 441 pounds, covering an average distance of between 12 and 124 miles. These drones include the mR10 operational drone swarm, the mR20 for high-altitude logistics resupply, the X8 compact platform for maritime patrol and situational awareness at sea, and the Bharat lightweight man-carried drone for quick surveillance in complex terrain. The startup has more than 10 customers, all of which are Indian government agencies, including the Indian Army, Navy, and Air Force, as well as armed police forces such as the Border Security Force, Central Reserve Police Force, and the Indo-Tibetan Border Police. The Mishra brothers conceptualized Raphe mPhibr in 2016 while Vikash was studying at the Massachusetts Institute of Technology and Vivek was at the Georgia Institute of Technology. For the initial three to four years, the co-founders focused on understanding the operational needs of the defense forces, along with other requirements, such as environmental and terrain considerations. Then they began building multicopters to meet the needs of the Indian troops, gradually expanding to fixed-wing and vertical takeoff and landing (VTOL) aircraft. In the process, we understood that since the need is new and the area is niche, we focused on both research and manufacturing because we didnt want to be constrained by what [already existed], Vivek said in an interview. Techcrunch event Save $450 on your TechCrunch All Stage pass Build smarter. Scale faster. Connect deeper. Join visionaries from Precursor Ventures, NEA, Index Ventures, Underscore VC, and beyond for a day packed with strategies, workshops, and meaningful connections. Save $200+ on your TechCrunch All Stage pass Build smarter. Scale faster. Connect deeper. Join visionaries from Precursor Ventures, NEA, Index Ventures, Underscore VC, and beyond for a day packed with strategies, workshops, and meaningful connections. Boston, MA | July 15 REGISTER NOW The startup began its journey with a 2,000-square-foot research facility in 2017 but expanded to a 100,000-square-foot combined research and manufacturing facility. This has now been expanded to a 650,000-square-foot facility as a result of the fresh capital infusion, which also saw the participation of its existing investor Think Investments. From day one, we have been against the transfer of technology, Vivek told TechCrunch. Raphes Surface Mount Technology (SMT) Line in Noida. Image Credits: Raphe mPhibr Raphe mPhibr domestically produces its flight controllers, batteries, and all components and materials required to build drone structures, including subtractive metals, thermoplastics, carbon fiber composites, and even wire harnesses. It also develops proprietary autopilots and inertial navigation systems at its facility. However, the startup imports radars and high-end cameras, which it also plans to manufacture in-house within 18 months. Vivek told TechCrunch that the startup does not rely on China for any of the components it uses, thereby avoiding some supply chain challenges. The biggest challenge was setting up the facility and doing research, he said. Because doing research in India is slightly more expensive compared to the U.S., just because the infrastructure is quite well set up there getting the machinery is a challenge, installation, and commissioning is a challenge, and then operating it, again, is a challenge because finding the people who can operate these is hard. Raphe mPhibr has addressed some of these hurdles by focusing on training and developing its employees from its early days, he added. The startup also utilizes AI on its drones for object detection in surveillance scenarios, automatically switching between frequency bands to adapt to electronic warfare and employing operational UAV swarm intelligence to make decentralized decisions using AI. In recent months, Raphe mPhibr has partnered with Germanys Hensoldt and Frances Safran to collaborate on developing new sensors, as well as with Frances Dassault Systmes for software simulation requirements. Raphe mPhibr also plans to expand beyond India and enter new markets. To this end, it has already participated in defense air shows, including those in Dubai and Paris. Vivek told TechCrunch that the startup already has some export licenses and is seeking more but declined to share specifics. There are very advanced talks happening with a few government agencies across the world, and very soon, hopefully, this year, we will start delivering there as well, he said. In the past 12 months, Raphe mPhibr has sold over 300 drones and has experienced up to 4x revenue growth over the last four years, Vivek said, without disclosing specific numbers. He also stated that the startup has been profitable for each of the last four years and is projected to go public within the next two to five years. Raphe mPhibr has around 600 employees, with 150 dedicated to research and over 250 to production. To date, the startup has secured a total of $145 million in equity funding. Topics General Catalyst , India , military drone , Raphe , Raphe mPhibr , Startups , Think Investments , Transportation , uav Jagmeet Singh Reporter Jagmeet covers startups, tech policy-related updates, and all other major tech-centric developments from India for TechCrunch. He previously worked as a principal correspondent at NDTV. You can reach out to him at mail[at]journalistjagmeet[dot]com. View Bio July 15, 2025 Boston, MA From seed to Series C and beyond founders and VCs of all stages are heading to Boston. Be part of the conversation. Save up to $425 now and tap into powerful takeaways, peer insights, and game-changing connections. Register Now Most Popular Meta hires key OpenAI researcher to work on AI reasoning models Maxwell Zeff Sam Altman comes out swinging at The New York Times Maxwell Zeff iPhone customers upset by Apple Wallet ad pushing F1 movie Sarah Perez Apples Liqu', 'rank': 2}, {'url': 'https://www.ndtv.com/india-news/after-operation-sindoor-success-indian-drone-startup-raphe-mphibr-raises-massive-100-million-8770940', 'content': 'After Operation Sindoor Success, Indian Drone Startup Raphe mPhibr Raises Massive $100 Million arrow-down comments printer search bell top-nav right-arrow NDTV World Profit MOVIES Cricket FOOD LIFESTYLE HEALTH TECH Games SHOPPING APPS Rajasthan MPCG Marathi Advertisement Live TV Latest India India All India News India Global Diaspora South Latest \"What An Achievement\": Gautam Adani Praises India\\'s No. 1 Praggnanandhaa Passenger Train Derails In Tamil Nadu, No Casualties Reported Man Kills Father Over Front Seat Dispute In Tempo: Delhi Cops July 5 March Against Hindi \"Imposition\": Sharad Pawar\\'s NCP Extends Support Anti-Lock Braking System Mandatory For All 2-Wheelers Made After Jan 2026 World Videos Opinion Cities Metros Bengaluru Chennai Delhi Mumbai Other Cities Ahmedabad Allahabad Amritsar Bhopal Bhubaneshwar Chandigarh Ghaziabad Goa Gurgaon Guwahati Hyderabad Jaipur Kanpur Kolkata Lucknow Noida Patna Pune Srinagar Thiruvananthapuram Auto Web Stories Education Education Exams School Campus Study Abroad Web Stories Latest How To Apply To Harvard: Everything You Need To Know Telangana EAMCET 2025 Counselling Schedule Released, Check Important Dates Uniraj Bachelor Of Arts Part 2, 3 2025 Results Declared, Direct Link Here Telangana Class 10 2025 Supplementary Result Declared, Check Result Here \"Regular Mock Practice...\": Law Exam Toppers Share Tips For Aspirants Podcast Auto Lifestyle Entertainment Offbeat Web Stories Science Trends Photos Feature People TV Schedule India@AI Login Switch To Dark/Light Mode Trending Tags Latest News World News PNR Status Education News Business News Sports News MP Chhattisgarh News Rajasthan News Latest Mobile Phones Trending Committed To Closer Ties With India, Says Justin Trudeau Amid Row In Avoiding Repeat Of Telangana, BJP Pays Price In Tamil Nadu Man Complains Of Stomach Pain For Years, Doctors Find This Inside His Body \"They Can Speak For...\": US On India\\'s Response On Canada\\'s Allegations After Op Sindoor Success, Indian Drone Startup Raises Massive $100 Million facebook twitter WhatsApp comments Settings Change Font Size A A Focus on Story Edition INDIA World Search here Get App for Better Experience Get it on Google Play Download on the App Store choose your destination Hindi Marathi MPCG Rajasthan News Updates Live TV India Latest Video Podcast Profit Movies News Updates Cricket Cities Notifications Opinion Web Stories Trends Featured Feature Offbeat Science People South Education Tech Food Sports Health Lifestyle Photos TV Schedule Toolbox Follow Us On Facebook Twitter Instagram LinkedIn YouTube search olympic crypto_icon News India News After Op Sindoor Success, Indian Drone Startup Raises Massive $100 Million After Op Sindoor Success, Indian Drone Startup Raises Massive $100 Million UAV manufacturing startup Raphe mPhibr has so far raised $145 million (over Rs 1,200 crore) in the biggest ever fundraise by an Indian aerospace manufacturing firm Reported by: Shiv Aroor Edited by: Debanish Achom India News Jun 27, 2025 00:16 am IST Published On Jun 27, 2025 00:09 am IST Last Updated On Jun 27, 2025 00:16 am IST Read Time: 4 mins Share Twitter WhatsApp Facebook Reddit Email NDTV\\'s Shiv Aroor and Raphe mPhibr CEO Vivek Mishra discuss drone tech in India Show Quick Read Summary is AI-generated, newsroom-reviewed The Noida-based drone manufacturing startup has so far raised $145 million (over Rs 1,200 crore) Raphe mPhibr\\'s drones fired missiles during Operation Sindoor against Pakistani targets Indian Army ordered 450 suicide drones from a competitor and plans to get more from Raphe mPhibr Did our AI summary help? Let us know. New Delhi: UAV manufacturing startup Raphe mPhibr, whose drones participated in Operation Sindoor, has raised $100 million in a funding round led by General Catalyst. The Noida-based startup has so far raised $145 million (over Rs 1,200 crore) in the biggest ever fundraise by an Indian aerospace manufacturing firm. Raphe mPhibr Chief Executive Vivek Mishra told NDTV the key to beating China in drone technology and market is to build \"a very strong ecosystem for design, development, and manufacturing.\" Giving an example from his own startup\\'s experience, Mr Mishra said they needed an internal combustion engine for one of their long-endurance drones, but they could not find an ideal one, so they ended up building one that perfectly matched their needs. \"For one of our long-endurance drones, we needed an internal combustion engine. Anything existing in the market would be either too expensive or too heavy or would not meet performance [parameters]. So we decided that we would design and manufacture the internal combustion engine here,\" Mr Mishra said. \"And we were able to do it. This was India\\'s first design of an internal combustion engine. The goal was not to recreate anything, but to reduce size, weight, increase performance, and attune it to the requirement for the UAV and hence the user,\" Mr Mishra said, referring to unmanned aerial vehicles. He added that a lot of companies in India can focus on research and manufacturing. \"We can then come up with unique products for the unique requirements of India.\" Raphe mPhibr proved its mettle during Operation Sindoor, when India launched strikes against Pakistan in response to the terror attack in Jammu and Kashmir\\'s Pahalgam that killed 26 tourists. Their drones fired missiles at Pakistani targets. Since then there has been a huge surge in the Indian military\\'s interest in acquiring more of these systems from domestic firms. The Indian Army, for instance, just ordered 450 suicide drones from a competitor and is all set to order hundreds more from the Noida-based startup. With enough resources, Raphe mPhibr is expected to innovate and deliver more capable drones to the military. \"This was our Series B round where we raised $100 million, led by General Catalyst. A lot of our existing investors like Amal Parekh and Think Investment also pitched in this round as well. We$100 started almost a decade ago and this was a major [funding] round that we did to support the increase in capacity for our research and manufacturing,\" Mr Mishra told NDTV. On the huge interest in Raphe mPhibr\\'s products following Operation Sindoor, Mr Mishra said their vision from Day 1 of operations was to develop a strong research and manufacturing capability in India. \"We have been silently working for around a decade to develop the capacity where we are able to not only do research on the system level, but also do research and manufacturing on a subsystem level, where in each and every part of the drone, be it the structures, be it composites, be it electronics, wire harnesses, or even software - are designed and manufactured here,\" Mr Mishra said. \"We have a unique manufacturing capability where state-of-the-art manufacturing techniques along with research are under one roof. For us, it\\'s the same old vision. The value has increased wherein we are raising a larger amount compared to the last round, but this is towards the same vision that we have to be able to do more deep research into every field and focus on manufacturing and indigenous capabilities,\" the Raphe mPhibr CEO said. He expressed optimism that Indian engineers who leave the country to look for opportunities abroad would return in large numbers to work in the exciting field of drone tech. He said they have been seeing a trend where hundreds of scientists who have been working in the US for up to 15 years and even young scientists showing excitement in getting opportunities to work in drone tech and related fields in India. \"The primary thing is that if you give people the kind of work that becomes an enjoyment, especially for engineers and scientists, they would definitely want to come. We are seeing this. A lot of Indians who have returned from the US and Europe are working with us. And not only Indians, we are proud to welcome other people as well who want to contribute in this sector,\" Mr Mishra said. Show', 'rank': 3}, {'url': 'https://www.globenewswire.com/news-release/2025/06/26/3105526/0/en/Raphe-mPhibr-Secures-100M-to-Expand-Aircraft-Design-and-Manufacturing-in-India.html', 'content': 'Raphe mPhibr Secures $100M to Expand Aircraft Design and Accessibility: Skip TopNav Raphe mPhibr Secures $100M to Expand Aircraft Design and Manufacturing in India June 25, 2025 22:00 ET | Source: Raphe mPhibr Raphe mPhibr NEW DELHI, June 26, 2025 (GLOBE NEWSWIRE) -- Raphe mPhibr (  ), Indias most innovative aircraft manufacturing company, announced today that it has raised $100 million in a round led by General Catalyst, with participation from existing investors, including Amal Parikh, Think Investments, and other prominent high-net-worth family offices. This is the largest round of private funding raised by an Indian company in this industry to date and takes Raphe mPhibrs total capital raised to $145 million. We are proud to join forces with Raphe mPhibr on their transformative journey to redefine engineering-led manufacturing across a spectrum of critical applications, said Neeraj Arora, Managing Director at General Catalyst. What sets this team apart is their unwavering, mission-driven ethos, coupled with an expansive vision and formidable technological depth. The products emerging from Raphe mPhibr are already making a tangible impact on the ground, signalling what we believe will be a monumental shift. Their work is not only accelerating Indias path to strategic self-reliance but also embodies the essence of our Global Resilience thesis at General Catalystbuilding for a future that is secure, sovereign, and sustainable. Raphe mPhibr is uniquely positioned to develop cutting-edge aircrafts and UAVs given their robust, end-to-end design, engineering, and manufacturing capabilities, shared Shashin Shah, Managing Partner, Think Investments. We are excited to deepen our partnership with the Raphe mPhibr team, and this investment underscores our conviction that it will emerge as one of the foremost aerospace companies in India. Built with Purpose Founded nearly a decade ago, Raphe mPhibr grew alongside Indias national vision of Aatmanirbhar Bharat and Make in India. These policies laid the foundation for building essential technologies within the country, especially in defence, where the needs of security forces continue to evolve in a complex and fast-changing world. Raphe mPhibr was born to serve that mission: to design and build solutions in India for those who protect it. Inspired by Nature Raphe mPhibrs engineering has always drawn from a timeless source: nature. As Aryabhata wrote, nature operates through laws and patterns that reveal themselves through observation and analysis. That philosophy shapes how the company builds and organises itself. Raphe mPhibr is built around strong engineering and science departments, with dedicated teams in aerodynamics, materials science, structural mechanics, vibrations, thermodynamics, electromagnetics, and more. Not just to model the world, but to build systems that move with its logic, not against it. Turning observations into working solutions demanded more than insight; it required capability. To deliver technology that Indias forces could rely on in mountains, deserts, oceans, and beyond, Raphe mPhibr had to create Indias most advanced, end-to-end aerospace manufacturing campus. Building End-to-End India has single-handedly developed its technology [] without spying or stealing the knowledge from other countries. Dr. R. Chidambaram, in his Science Popularisation Lecture at the 2019 Goa Science Film Festival. That belief in building with integrity and technical depth continues at Raphe mPhibr. The company didnt set out to assemble parts, it set out to engineer solutions end-to-end. And to do so, Raphe mPhibr created a campus where design, simulation, manufacturing, and testing all work together, under one roof. As a result, the headquarters houses Indias most advanced metal processing, composite manufacturing, engine design and testing, and military-grade electronics facility. Every manufacturing centre was designed with a single goal: to deliver systems our security forces can rely on. Many of these systems are already in the field: mR10: The worlds first operational drone swarm. mR20: The worlds first high-altitude logistics platform for resupply in remote forward areas. Bharat: A lightweight man-carried drone for rapid surveillance in complex terrain. X8: A compact platform for maritime patrol and situational awareness at sea. They help teams move faster, see further, and stay safer. Other products are in the making too, currently in the final stages of validation. And their echoes are now being heard far beyond India, in Paris, Dubai, and London, where Raphe mPhibrs engineering is increasingly shaping the global discourse. The companys motto, We innovate for a better society, guides how the company works and the partners it chooses. Raphe mPhibr partners with national institutions, in line with the mission laid out by Indias Prime Minister: Make in India, innovate in India, and become truly Aatmanirbhar. It also works with international partners such as Dassault Systmes, HENSOLDT, and Safran. \"Raphe mPhibrs implementation of our 3DEXPERIENCE platform shows how virtual worlds help innovators achieve speed and sovereignty by accelerating the entire product lifecycle from concept to certification,\" noted Olivier Sappin, CEO, CATIA, Dassault Systmes (France). \"Weve worked closely with Raphe mPhibrs teams and seen first-hand their ability to deliver advanced mil-grade electronics and mechanical systems, stated Oliver Drre, CEO, HENSOLDT (Germany). \"Raphe mPhibr is a technological and industrial adventure the likes of which can only be found in India. Were proud of the partnership we are building with this company which could become one of the worlds major players in the drone industry,\" shared Alexandre Ziegler, Executive Vice President, Defense GBU, Safran Electronics & Defense (France) via LinkedIn. People First A musician must make music, an artist must paint, a poet must write, if he is to be ultimately at peace with himself. Abraham Maslow, founder of humanistic psychology and one of the most influential psychologists of the 20th century. All strong philosophies, whether scientific, strategic, or national, ultimately rest on people. And for people to do exceptional work, they must feel safe, supported, and fulfilled. Thats why Raphe mPhibr is committed to building not just technology, but culture. A culture that is psychologically safe, emotionally grounded, organically grown, and quietly rigorous. One that helps people become not just better engineers, but better versions of themselves. As the Raphe mPhibr team often says: If we eat well, we innovate well. Its a simple truth that makes Drongans feel good and when people feel good, they build what others think is impossible. Making It in India The world is looking at India with new eyes, and it\\'s time we matched our vision with capability. Prime Minister Narendra Modi, during an annual Independence Day address to the nation. This funding is not just capital; it is a commitment. A commitment to build in India what the country cannot afford to depend on others for. To turn policy into product. To make Aatmanirbhar Bharat not just a campaign, but a living, flying ecosystem. About Raphe mPhibr Raphe mPhibr is Indias most innovative aircraft manufacturer.Conceptualised in 2016, the company has logged over 1 million kilometres of flight, delivered the worlds first operational drone swarm, and developed Indias first indigenous state-of-the-art military grade autopilot, and lightweight internal combustion engine. From metals to composites and electronics, Raphe mPhibr designs and builds everything under one roof. With 600+ team members, over 100 unique IPs, and world-class design and manufacturing facilities, Raphe mPhibr innovates for a better society. Raphe mPhibr Aman Chhabra President General +91 84477 43095 president.general@mphibr.com A photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/d487f', 'rank': 4}, {'url': 'https://techstory.in/raphe-mphibr-raises-100-mn-in-record-breaking-aerospace-funding-round/', 'content': 'Raphe mPhibr Raises $100 Mn in Record-Breaking Aerospace Funding Round - TechStory Send Us A Tip Calling all Tech Writers Advertise Saturday, June 28, 2025 Login Register News Crypto Gadgets Memes Gaming Cars AI Startups Markets How to No Result View All Result News Crypto Gadgets Memes Gaming Cars AI Startups Markets How to No Result View All Result No Result View All Result Home Business Raphe mPhibr Raises $100 Mn in Record-Breaking Aerospace Funding Round by Ishaan Negi June 26, 2025 in Business , Markets , News , Tech , Trending , World Reading Time: 4 mins read 0 Credits: The Economic Times Twitter Whatsapp Linkedin In a landmark moment for Indias growing private aerospace and defence-tech sector, Noida-based startup Raphe mPhibr has raised $100 million in a funding round led by General Catalyst . This is the largest-ever private capital infusion in Indias aerospace manufacturing space, signaling a new era of innovation, indigenous capability, and investor confidence in deep-tech defence ventures. You might also like Mexico Considers Legal Action Against SpaceX Over Rocket Debris and Environmental Damage Xiaomi Challenges Tesla With Blockbuster YU7 Launch: 289,000 Orders in Just an Hour Xbox Layoffs Loom: Up to 2,000 Jobs at Risk as Microsoft Restructures ItsGamingDivision In this article, we will delve into Raphe mPhibrs record-breaking $100 million funding round, its cutting-edge UAV technologies, and how the startups rise reflects Indias growing ambitions in the aerospace and defence manufacturing ecosystem. Credits: Tech Funding News Investor Confidence in a High-Stakes Sector Alongside General Catalyst, the funding round saw participation from Think Investments , Amal Parikh , and a consortium of prominent family offices . With this fresh injection, Raphe mPhibrs total capital raised now stands at $145 million , placing it in a league of elite defence startups on the global stage. The timing is no coincidence. The investment comes amid escalating geopolitical tensions and increased reliance on unmanned aerial vehicles (UAVs) in modern warfare. The recent India-Pakistan skirmishes have underlined how critical drone technology is becoming to military strategy and border surveillance. From Family-Led Venture to Strategic Defence Partner Raphe mPhibr was founded nearly a decade ago by sibling duo Vivek Mishra (CEO) and Vikash Mishra (Chairman) . What began as an ambitious R&D-led venture has matured into one of Indias most significant UAV manufacturers. Their product line reads like the future of modern combat: mR10 : A sophisticated drone swarm platform designed for coordinated autonomous missions. mR20 : A high-altitude logistics drone capable of operating in challenging terrain. Bharat : A compact, man-portable surveillance drone tailored for field operations. X8 : A nimble maritime patrol UAV system meant for naval deployments. According to the company, several of these systems are already being actively deployed by Indian defence forces, with others in advanced stages of validation. Raphe mPhibrs growing role in national defence has made it a standout among a wave of new-age defence tech startups. A Vertically Integrated Powerhouse What truly sets Raphe mPhibr apartand what convinced investorsis its vertically integrated model . The company has built a dedicated aerospace campus where it develops everything in-house: from aerodynamics and thermodynamics to material science and embedded systems . This full-stack approach eliminates reliance on foreign suppliers, ensuring supply chain security and speedcritical factors in defence tech manufacturing. Neeraj Arora, Managing Director at General Catalyst, emphasized this in a statement: We are proud to join forces with Raphe mPhibr on their transformative journey to redefine engineering-led manufacturing across a spectrum of critical applications The products emerging from Raphe mPhibr are already making a tangible impact on the ground. Riding the Wave of Indias Defence Reforms The mega funding round also aligns seamlessly with Indias policy thrust to privatize and energize its aerospace and defence sectors . Initiatives such as iDEX (Innovations for Defence Excellence) and the recent transfer of satellite launch technology to HAL are designed to make room for agile, innovation-led private players. Raphe mPhibrs success is being seen as a proof point that these reforms are workingand that Indian startups can play on the global stage in sectors traditionally dominated by state-run enterprises and foreign OEMs. Credits: Moneycontrol Conclusion: Indias Drone Champion Takes Flight With $100 million in fresh capital, a cutting-edge UAV portfolio, and government endorsement, Raphe mPhibr is now uniquely positioned to become a global leader in tactical drone solutions . The startup embodies the promise of Indian deep-tech: indigenous innovation, strategic relevance, and scalability. As defence needs evolve rapidly in a volatile world, the companys rise could well mark a new chapter for Indias aerospace ambitions one where homegrown startups dont just support defence capabilities but lead them . Tags: #General_Catalyst #Raphe_mPhibr Aerospace Defence funding startup Tweet 54 Send Share 15 Previous Post Microsoft Sued by Authors Over AI Book Training Next Post Cricket Meets Commerce: Rohit Sharma Bets on Prozos Logistics Tech Ishaan Negi Ishaan is a student at Sri Venkateswara College, University of Delhi, where he combines his academic pursuits with a deep passion for technology and storytelling. Ever since his school days, Ishaan has been an avid reader, a thoughtful writer, and an articulate speaker. These interests have naturally evolved into a strong inclination towards journalism, especially in the fast-paced world of tech.\\r \\r Known for his balanced approach, Ishaan is committed to presenting unbiased viewpoints and ensuring every story he tells is rooted in facts and multiple perspectives. Whether hes reporting on emerging startups, corporate developments, or ethical issues in the tech space, he brings a sharp analytical lens and a curiosity-driven mindset to his work.\\r \\r With a strong foundation in research and communication, Ishaan strives to make complex topics accessible to readers while maintaining depth and nuance. His goal is not just to inform but also to spark thoughtful conversations around the ever-evolving tech landscape. Recommended For You Mexico Considers Legal Action Against SpaceX Over Rocket Debris and Environmental Damage by Harikrishnan A June 28, 2025 0 Mexico is preparing to take a firm stance against SpaceX following growing concerns that debris and environmental fallout from its rocket launches in Texas are affecting Mexican territory.... Read more Xiaomi Challenges Tesla With Blockbuster YU7 Launch: 289,000 Orders in Just an Hour by Samir Gautam June 27, 2025 0 Chinese tech giant Xiaomi is making waves in the electric vehicle (EV) world once again. Just minutes after unveiling its second EV, the YU7, in Beijing, the company... Read more Xbox Layoffs Loom: Up to 2,000 Jobs at Risk as Microsoft Restructures ItsGamingDivision by Samir Gautam June 27, 2025 0 The Xbox community is holding its breath. A fresh wave of layoffs is reportedly on the way, and this one could be the most brutal yet. According to... Read more Next Post Cricket Meets Commerce: Rohit Sharma Bets on Prozos Logistics Tech Please login to join discussion Techstory Tech and Business News from around the world. Follow along for latest in the world of Tech, AI, Crypto, EVs, Business Personalities and more. reach us at [emailprotected] Advertise With Us Reach out at - [emailprotected] BROWSE BY TAG #Crypto #howto 2024 acquisition AI amazon Apple bitcoin Business China cryptocurrency e-commerce electric vehicles Elon Musk Ethereum facebook flipkart funding Gaming Google India Instagram Investment ios iPhone IPO Market Markets Meta Microsoft News NFT samsung Social Media SpaceX startup startups tech technology', 'rank': 5}, {'url': 'https://www.outlookbusiness.com/start-up/investors/raphe-mphibr-bags-100-mn-in-indias-biggest-defence-tech-start-up-funding-round', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://www.cnbctv18.com/business/startup/from-drone-swarms-to-combat-platforms-raphe-mphibr-secures-100-million-to-scale-indigenous-aerospace-19627630.htm', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://defence.capital/2025/06/26/taking-flight-raphe-mphibr-raises-100-million-to-supercharge-aircraft-innovation-in-india/', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
      "annotations": null
    }
  ],
  "crunchbase_data_T002": [
    {
      "type": "text",
      "text": "[{'url': 'https://www.crunchbase.com/organization/raphe-mphibr', 'content': 'Attention Required! | Cloudflare Please enable cookies. Sorry, you have been blocked You are unable to access crunchbase.com Why have I been blocked? This website is using a security service to protect itself from online attacks. The action you just performed triggered the security solution. There are several actions that could trigger this block including submitting a certain word or phrase, a SQL command or malformed data. What can I do to resolve this? You can email the site owner to let them know you were blocked. Please include what you were doing when this page came up and the Cloudflare Ray ID found at the bottom of this page. Cloudflare Ray ID: 956a50034e597f6b Your IP: Click to reveal 49.206.26.171 Performance & security by Cloudflare', 'rank': 1}, {'url': 'https://tracxn.com/d/companies/raphe/__9x7PDTYJ-2vzu-u7mq1O7Vk2NBg3GoR79phwK5J1nEk', 'content': \"Raphe - 2025 Company Profile, Team, Funding, Competitors & Financials - Tracxn JavaScript is disabled in your browser. enable it to enjoy the full features of Tracxn. Your browser was unable to load all of Tracxn resources. They may have been blocked by your firewall, proxy or browser configuration. Press Ctrl+F5 or Ctrl+Shift+R to have your browser try again and if that doesn't work, click here to retry or mail us at hi@tracxn.com Internal Server Error Toggle navigation Customers Investment Industry Venture Capital Funds Private Equity Funds Accelerators & Incubators Investment Banks Corporates and Startups Corp Dev and M&A Teams Corporate Innovation Startup Founders Sales Team Ecosystem Journalists and Publications Universities View All Customers Contact Us Offerings Rich Data Sets Companies Investors Funding Acquisitions Financials Cap Tables Employee Count Deep Dives Company deep-dive Investor deep-dive Activity by Corporates Sector Coverage Workflow Solutions Sourcing new deals Tracking Market Updates Portfolio Management Deal Flow CRM LiveDeals And Much More... Data Solutions Reports by Tracxn Enterprise Grade Support Sector Coverage Apps & Extensions View All Offerings Contact Us Try our premium features for FREE - no threads attached! Learn More Get Started. Its FREE Company Our Investors Media & Newsroom Careers Contact Us Pricing Login Get Started. It's FREE! Discover > Companies > Raphe Navigate to Overview About the company Legal Entities Funding and Investors Founders and Board of Directors Competitors and Alternates Latest Cap tables and Shareholding Investments and Acquisitions Reports News Funding & Investors Latest Shareholding Competitors Landscape Comparables Historical Cap Tables Historical Financials Who's likely to Invest? All Related Reports Most viewed in 2019 Unlock full details of this profile with our free Lite plan! Sign Up and Get Free Access Raphe - Company Profile soonicorn Last updated: June 28, 2025 Claim Profile Suggest Edits Linkedin Twitter Facebook Email Copy Url Request page removal Raphe - About the company Raphe is a series B company based in Noida (India), founded in 2017 by Nitin Katiyar and Vivek Mishra . It operates as a Manufacturer of carbon fiber composite products and unmanned aerial vehicles . Raphe has raised $140M in funding from investors like Think Investments , Ascent Capital and General Catalyst , with a current valuation of 7,160Cr . The company has 719 active competitors, including 112 funded and 41 that have exited . Its top competitor s include companies like DJI , ideaForge and Shield AI . Company Details Manufacturer of carbon fiber composite products and unmanned aerial vehicles. It focuses on research and development, utilizing technologies for the aerospace industry. It has infrastructure for additive, subtractive, PCB A, and composite manufacturing. The company emphasizes product and process innovation through end-to-end manufacturing. Website www.raphe.com/ Social Email ID *****@mphibr.com Phone Number +91 ********** Key Metrics Founded Year 2017 Location Noida, India Stage Series B Total Funding $140M in 4 rounds Latest Funding Round Series B, Jun 25, 2025 , $100M Post Money Valuation 7,160Cr as on Mar 28, 2025 Investors Think Investments & 37 more Ranked 19 th among 719 active competitors Annual Revenue 86.1Cr as on Mar 31, 2024 Employee Count 499 as on May 31, 2025 Similar Companies DJI & 880 more Legal entities associated with Raphe Raphe is associated with 1 legal entit y given below: Legal Entity Name Date of Incorporation Revenue Latest Employee Count Documents Raphe Mphibr Private Limited CIN: U26990UP2017PTC095246 India , Active Jul 20, 2017 $10.4M (as on Mar 31, 2024) 499 (as on May 31, 2025) Buy Now Get your free copy of Raphe 's company profile Get Company Profile Raphe's funding and investors Filter this list Raphe has raised a total funding of $140M over 4 round s . Its first funding round was on Aug 02, 2022 . Its latest funding round was a Series B round on Jun 25, 2025 for $100M . 3 investor s participated in its latest round, lead by General Catalyst . Raphe has 14 institutional investor s including Think Investments , Ascent Capital and General Catalyst . Think Investments is the largest institutional investor in Raphe . Vivek Gupta and 23 other s are Angel Investors in Raphe . Here is the list of recent funding rounds of Raphe : Date of funding Funding Amount Round Name Post money valuation Revenue multiple Investors Jun 25, 2025 $100M Series B 2676005 1691767 General Catalyst , Think Investments , and 1 more Mar 13, 2024 $7.25M Series B 1675297 4262342 Think Investments Apr 06, 2023 $17.6M Series B 8215182 8771793 Think Investments , Dovetail Capital , and 28 more Access funding benchmarks and valuations. Sign up today! View details of Raphe 's funding rounds and investors Raphe's founders and board of directors Founder? Claim Profile The founders of Raphe are Nitin Katiyar and Vivek Mishra . Vivek Mishra is the CEO of Raphe . Here are the details of Raphe's key team members: Nitin Katiyar : Co-Founder of Raphe and founder of 1 other compan y . They serve on the board of 1 compan y . Vivek Mishra : Co-Founder & CEO of Raphe and founder of 3 other compan ies , goSporto , Instasports and The SportsWave . View details of Raphe 's Founder profiles and Board Members Raphe's employee count trend Raphe has 499 employees as of May 25. The total employee count is 43.0% more than what it was in May 24. Here is Raphe 's employee count trend over the years: Uncover Raphe's growth story! Sign up today! Access Tracxn on any website Our Google Chrome extension lets you view company details while browsing their websites Install Tracxn Extension Raphe's Competitors and alternates Top competitor s of Raphe include DJI , ideaForge and Shield AI . Here is the list of Top 10 competitors of Raphe , ranked by Tracxn score: Overall Rank Company Details Short Description Total Funding Investors Tracxn Score 1st DJI 2006 , Shenzhen ( China ) , Series B Developer of multi-utility drones $105M Kleiner Perkins , GIC & 23 others 79/100 2nd ideaForge 2007 , Mumbai ( India ) , Public Manufacturer of indigenous unmanned aerial vehicles $53.8M Qualcomm Ventures , Qualcomm & 53 others 76/100 3rd Shield AI 2015 , San Diego ( United States ) , Series F Developer of AI fighter jet pilot and manufacturer of autonomous drones for surveillance and patrolling $1.17B Hercules Capital , SVB & 26 others 71/100 4th Skydio 2014 , Redwood City ( United States ) , Series E Provider of AI and cloud-based autonomous drones $715M Hercules Capital , IVP & 26 others 71/100 5th Garuda Aerospace 2015 , Chennai ( India ) , Series B Manufacturer of agri and consumer drone $49.3M Narotam Sekhsaria Family Office , Ocgrow Group of Companies & 168 others 69/100 6th Quantum Systems 2015 , Gilching ( Germany ) , Series C Platform develops multi-sensor unmanned aerial systems $410M European Investment Bank , Omnes Capital & 25 others 67/100 7th H3 Dynamics 2015 , Singapore ( Singapore ) , Series B Provides aerial inspection services using drones $39M EDBI , Sumitomo Mitsui Banking Corporation & 13 others 65/100 8th Vantage Robotics 2013 , San Francisco ( United States ) , Series B Creates unmanned aircraft systems $8.94M Hone Capital , CSC Upshot Ventures & 6 others 64/100 9th Aurora 1989 , Manassas ( United States ) , Acquired Develops unmanned and manned aerial vehicles and payloads $6.85M Global Environment Fund , CYwP Funds & 2 others 62/100 10th Airobotics 2014 , Scottsdale ( United States ) , Acquired Provider of designing and developing solutions for industrial drones $101M CRV , Generation Ventures & 12 others 58/100 19th Raphe 2017 , Noida ( India ) , Series B Manufacturer of carbon fiber composite products and unmanned aerial vehicles $140M Ascent Capital , General Catalyst & 36 others 53/100 Get insights and benchmarks for competitors of 2M+ companies! Sign up today! Looking for more details on Raphe 's competitors\", 'rank': 2}, {'url': 'https://www.zaubacorp.com/RAPHE-MPHIBR-PRIVATE-LIMITED-U26990UP2017PTC095246', 'content': \"My Cart Sign In Sign Up Company Director Trademark Address Submit Browse Companies by Activity, Age and Location Company Information  Directors  Contact Information  Legal Check  Financial Reports  Investors RAPHE MPHIBR PRIVATE LIMITED As on: 2025-03-22 RAPHE MPHIBR PRIVATE LIMITED (CIN: U26990UP2017PTC095246) is a Private company incorporated on 21 Dec 2017. It is classified as Non-government company and is registered at Registrar of Companies, Kanpur. Its authorized share capital is Rs. 10000000.00 and its paid up capital is Rs. 7329570.00. RAPHE MPHIBR PRIVATE LIMITED's Annual General Meeting (AGM) was last held on 30 Dec 2024. and as per records from Ministry of Corporate Affairs (MCA), its balance sheet was last filed on 2024-03-31.RAPHE MPHIBR PRIVATE LIMITED's NIC code is 2699 (which is part of its CIN). As per the NIC code, it is inolved in Manufacture of other non-metallic mineral products n.e.c.. Directors of RAPHE MPHIBR PRIVATE LIMITED are VIVEK INDER GUPTA, VARUN GARG, NITIN KATIYAR, VINITA JHA, AMAL PARIKH, VIKASH KUMAR MISHRA, and VIVEK KUMAR MISHRA. RAPHE MPHIBR PRIVATE LIMITED's Corporate Identification Number (CIN) is U26990UP2017PTC095246 and its registration number is 95246. Users may contact RAPHE MPHIBR PRIVATE LIMITED on its Email address - vp_software@mphibr.com. Registered address of RAPHE MPHIBR PRIVATE LIMITED is B- 200 Sector 81, Phase II, , Noida, Uttar Pradesh, India - 201305. Current status of RAPHE MPHIBR PRIVATE LIMITED is - Active. Basic Information CIN\\tU26990UP2017PTC095246 Name\\tRAPHE MPHIBR PRIVATE LIMITED Listed on Stock Exchange\\tUnlisted Company Status\\tActive ROC\\tROC Kanpur Registration Number\\t95246 Company Category\\tCompany limited by shares Company Sub Category\\tNon-government company Class of Company\\tPrivate Date of Incorporation\\t2017-07-21 Age of Company\\t7 years, 10 months, 25 days Activity\\t NIC Code: 2699 NIC Description: Manufacture of other non-metallic mineral products n.e.c. Number of Members\\t0 Annual Compliance Status Date of Last Annual General Meeting\\t2024-09-30 Date of Last Filed Balance Sheet\\t2024-03-31 Key Numbers Authorised Share Capital\\t 10,000,000.00 Paid-up Share Capital\\t 7,329,570.00 Total Assets\\t Revenue\\t Profit\\t Salaries & Other Employee Benefit Expenses\\t Previous Names RAPHE MPHIBR PRIVATE LIMITED Previous CINs U26990UP2017PTC095246 Regulatory Filings of RAPHE MPHIBR  All companies in India are required to file various documents like financials, loan agreements, list of shareholders, details of directors, details of funding rounds and a lot more. These documents are credible and offer incredible insights about a company. However, understanding a company by viewing its documents is an extremely difficult and time consuming process. Our reports are designed to save you significant time by surfacing key information easily and structuring it in a way that helps in your research. Understanding the key findings and information in our reports can be crucial if you're a customer, vendor, investor, partner or even a potential employee of RAPHE MPHIBR Purchase full report of RAPHE MPHIBR Add to Cart Litigation Search Report of RAPHE MPHIBR  Get a list of all litigations RAPHE MPHIBR is contesting or have contested in the past. Litigation search report is crucial if you are a potential vendor, employee or a customer of RAPHE MPHIBR. This report helps you understand the risk associated in dealing with RAPHE MPHIBR and its Directors better.  Our litigation search covers both civil and criminal cases and spans 670+ Courts and Organisations like the Supreme Court, High Courts, District Courts, Tribunals and much more. Click here to see our complete coverage. Purchase Litigation Search Report of RAPHE MPHIBR Add to Cart View Sample Report Outstanding Payments to Micro & Small Enterprises Companies are required to file half yearly returns showing payments due to Micro & Small Enterprises that have been delayed more than 45 days. This information is crucial to understand if RAPHE MPHIBR pays its vendors promptly. When seen over a period of time, this information could show if the company has slowed down in making payments to its small vendors. This information is available only if the company has filed its half yearly returns with the registrar of companies. Filing Type\\tAs On\\tAmount Due to MSME\\tCurrent Liabilities\\tRatio to Current Liabilities\\tReasons for Delay \\t\\t\\t\\t\\t \\t\\t\\t\\t\\t \\t\\t\\t\\t\\t Investor Complaints & Serious Complaints About RAPHE MPHIBR  This section contains details of investor complaints or serious complaints filed with the registrar of companies. This information can surface potential red flags about a company. Director Complaints Date\\tDIN\\tCessation Date\\tCessation Reason\\tComplaint \\t\\t\\t\\t \\t\\t\\t\\t \\t\\t\\t\\t Serious Complaints Date\\tComplaint\\tOther Details \\t\\t \\t\\t \\t\\t Investor Complaints & Other Complaints Date\\tComplaint Type\\tComplaint Sub Type\\tParticulars of Secutiries\\tPeriod\\tComplaint\\tOther Details \\t\\t\\t\\t\\t\\t \\t\\t\\t\\t\\t\\t \\t\\t\\t\\t\\t\\t Directors & Key Managerial Personnel of RAPHE MPHIBR Current Directors & Key Managerial Personnel of RAPHE MPHIBR DIN\\tDirector Name\\tDesignation\\tAppointment Date 00027546\\tVIVEK INDER GUPTA\\tDirector\\t2022-11-03 00245970\\tVARUN GARG\\tDirector\\t2020-12-18 07874981\\tNITIN KATIYAR\\tDirector\\t2017-07-21 08395714\\tVINITA JHA\\tDirector\\t2023-07-14 00983244\\tAMAL PARIKH\\tDirector\\t2022-11-03 07551114\\tVIKASH KUMAR MISHRA\\tDirector\\t2017-07-21 07551119\\tVIVEK KUMAR MISHRA\\tDirector\\t2017-07-21 Past Directors & Key Managerial Personnel of RAPHE MPHIBR DIN\\tDirector Name\\tDesignation\\tAppointment Date\\tCessation 08464725\\tSUJEET JHA\\tAdditional Director\\t-\\t2019-09-19 08464725\\tSUJEET JHA\\tDirector\\t-\\t2022-03-26 00027546\\tVIVEK INDER GUPTA\\tAdditional Director\\t-\\t2023-09-22 00245970\\tVARUN GARG\\tAdditional Director\\t-\\t2020-12-18 03472458\\tANUJ SOMANI\\tAdditional Director\\t-\\t2019-02-19 07379537\\tROHAN SETH\\tAdditional Director\\t-\\t2020-12-27 08319108\\tKARAN GARG\\tAdditional Director\\t-\\t2019-09-19 08319108\\tKARAN GARG\\tDirector\\t-\\t2022-06-21 08395714\\tVINITA JHA\\tAdditional Director\\t-\\t2023-09-22 00983244\\tAMAL PARIKH\\tAdditional Director\\t-\\t2023-09-22 06527441\\tKAVERI GARG\\tAdditional Director\\t-\\t2020-12-18 06527441\\tKAVERI GARG\\tDirector\\t-\\t2022-01-07 08850696\\tSAHIL SADHNA\\tAdditional Director\\t-\\t2022-09-30 Other Directorships of SUJEET JHA Company Name\\tCIN\\tDesignation\\tAppointment Date\\tCessation KANTARA MLIFETECH PRIVATE LIMITED\\tU24230HR2019PTC081247\\tDirector\\t2019-07-02\\tOngoing Other Directorships of VIVEK INDER GUPTA Company Name\\tCIN\\tDesignation\\tAppointment Date\\tCessation GEPL POWER PRIVATE LIMITED\\tU40300MH2012PTC230586\\tDirector\\t2012-05-03\\tOngoing J V GOKAL AND COMPANY PRIVATE LIMITED\\tU51900MH1950PTC008051\\tAdditional Director\\t-\\t2023-12-29 J V GOKAL AND COMPANY PRIVATE LIMITED\\tU51900MH1950PTC008051\\tDirector\\t-\\t2024-09-23 GEPL FINANCE PRIVATE LIMITED\\tU65190MH2007PTC174181\\tDirector\\t2007-09-17\\tOngoing GEPL CAPITAL PRIVATE LIMITED\\tU67120MH1997PTC110941\\tDirector\\t1997-09-26\\tOngoing GEPL INSURANCE BROKING PRIVATE LIMITED\\tU67120MH1999PTC123100\\tDirector\\t1999-12-15\\tOngoing GEPL COMMODITIES PRIVATE LIMITED\\tU67190MH1998PTC115790\\tDirector\\t1998-07-15\\tOngoing GEPL INVESTMENT ADVISORS PRIVATE LIMITED\\tU67190MH2014PTC253758\\tDirector\\t2014-03-03\\tOngoing THOUGHT MACHINE (INDIA) PRIVATE LIMITED\\tU72900MH2023FTC397858\\tDirector\\t2023-01-19\\tOngoing AGRAWAL METAL WORKS PRIVATE LIMITED\\tU74899DL1945PTC000835\\tDirector\\t2005-09-05\\tOngoing READ TO INDIA FOUNDATION\\tU85300MH2021NPL368708\\tDirector\\t2021-10-01\\tOngoing Other Directorships of VARUN GARG Company Name\\tCIN\\tDesignation\\tAppointment Date\\tCessation PREM BROTHERS INFRASTRUCTURE LLP\\tAAB-2111\\tDesignated Partner\\t-\\t2013-01-01 JPG REALCON LLP\\tAAD-9500\\tDesignated Partner\\t2015-05-15\\tOngoing PROGRESSIVE INFRASTRUCTURE LLP\\tAAG-8475\\tDesignated Partner\\t2016-07-05\\tOngoing KARYAN GLOBAL LLP\\tAAH-0928\\tDesignated Partner\\t2016-08-04\\tOngoing KARYAN INFRACOM LLP\\tAAH-0929\\tDesignated Partner\\t-\\t2023-04-09 KARYAN INFRACOM LLP\\tAAH-0929\\tPartner\\t2020-08-01\\tOngoing KARYATECH INTERNATIONAL LLP\\tAAH-0930\\tDesignated Partner\\t2016-08-04\\tOngoing KARYAN INTERNATIONAL LLP\", 'rank': 3}, {'url': 'https://pitchbook.com/profiles/company/538163-65', 'content': 'Products Solutions Data News & Analysis About Blog Log in Request a free trial Raphe This is a profile preview from the PitchBook Platform. Request a free trial Overview Timeline Valuation & Funding Cap Table VC Exit Predictor Comparisons Competitors Research & Analysis Related News Patents Service Providers Signals Investors Lead Partners on Deals Acquisitions Exits Affiliates FAQs Data Transparency Raphe Overview Update this profile Year Founded 2017 Status Private Employees 600 Latest Deal Type Series B Latest Deal Amount $100M Investors 3 Raphe General Information Description Operator of a high-tech aerospace manufacturing company intended for drones. The company specializes in customized comprehensive UAV (Unmanned Aerial Vehicle) solutions and have spurred a revolution in combat drone by developing and manufacturing every subsystem that is used in a UAV, enabling customers and defense systems to access variety of drones with payloads ranging from 4.4 pounds to 441 pounds, covering an average distance of between 12 and 124 miles. Contact Information Website www.raphe.com Ownership Status Privately Held (backing) Financing Status Venture Capital-Backed Primary Industry Aerospace and Defense Other Industries Machinery (B2B) Vertical(s) Robotics and Drones, Artificial Intelligence & Machine Learning Corporate Office B 200, Block B, Phase-2 Noida, Uttar Pradesh 210305 India  Want detailed data on 3M+ companies? What you see here scratches the surface Request a free trial Want to dig into this profile? Well help you find what you need Learn more Raphe Valuation & Funding Deal Type\\tDate\\tAmount\\tRaised to Date\\tPost-Val\\tStatus\\tStage 2. Later Stage VC (Series B)\\t25-Jun-2025\\t$100M\\t\\t\\tCompleted\\tGenerating Revenue 1. Early Stage VC\\t\\t\\t\\t\\tCompleted\\tGenerating Revenue To view Raphes complete valuation and funding history, request access VC Exit Predictor See how our proprietary methodology utilizes historical data sets to synthesize the likelihood of an acquisition, IPO, or no exit event. Get a detailed look at the calculations behind our predictions. Opportunity Score Calculated using Exit Type probabilities, the companys stage, and PitchBooks historical returns data. Exit Type Evaluates the likelihood of a successful exit for investors, and the most likely exit type. Request a free trial Raphe Related Research & Analysis Explore institutional-grade private market research from our team of analysts. Verticals Artificial Intelligence & Machine Learning Robotics and Drones AI & ML VC Trends February 27, 2025 Artificial Intelligence & Machine Learning Report February 25, 2022 Raphe Signals Growth Rate Weekly Growth Weekly Growth Size Multiple Median Size Multiple Key Data Points Similarweb Unique Visitors Majestic Referring Domains PitchBooks non-financial metrics help you gauge a companys traction and growth using web presence and social reach. Request a free trial Raphe Investors (3) Investor Name\\tInvestor Type\\tHolding\\tInvestor Since\\tParticipating Rounds \\tAngel (individual)\\tMinority\\t\\t General Catalyst\\tVenture Capital\\tMinority\\t\\t Think Investments\\tFamily Office\\t\\t\\t To view Raphes complete investors history, request access Ready to get started? Request a free trial Raphe FAQs When was Raphe founded? Raphe was founded in 2017. Where is Raphe headquartered? Raphe is headquartered in Noida, India. What is the size of Raphe? Raphe has 600 total employees. What industry is Raphe in? Raphes primary industry is Aerospace and Defense. Is Raphe a private or public company? Raphe is a Private company. What is Raphes current revenue? The current revenue for Raphe is . How much funding has Raphe raised over time? Raphe has raised $145M. Who are Raphes investors?  , General Catalyst, and Think Investments have invested in Raphe. Data Transparency Meet our data hygiene team Discover how our experts ensure youre getting the most accurate financial data in the industry. Read blog  How PitchBook sources data Our data operations team has logged over 3.5 million hours researching, organizing, and integrating the information you need most. Discover our process Products Chrome Extension CRM Integration Direct Data Excel and Powerpoint Plugins Morningstar Institutional Equity Research PitchBook Credit PitchBook Desktop PitchBook Institutional Research PitchBook Mobile Product Releases PitchBook for Hedge Funds Private Equity Private Market Valuations Startups Venture Capital Profile Previews Solutions Asset Allocation Benchmarking Business Development Deal Execution Deal Sourcing Due Diligence Fundraising Networking Private Market Intel Blog Webinars Video Library Data Advisors Companies Data Operations Deals Debt Financials Funds Investors Lenders Limited Partners M&A Professionals News & Analysis Advertise LCD News & Research News Archive News Team Newsletter Report Methodologies Reports Research & Analysis Team About Careers Customer Success Partnerships Press Inquiries How PitchBook Compares Case Studies Customer Testimonials PitchBook vs. Competitors Pricing What Sets Us Apart US Headquarters +1 (206) 623.1986 901 Fifth Avenue Suite 1200 Seattle, WA 98164 European Headquarters +44 (0) 20 8037.2308 1st Floor Saffron House 6-10 Kirby Street London EC1N 8TS United Kingdom Asia-Pacific Headquarters 80 Raffles Place #41-01 UOB Plaza 1 Singapore 048624 Contact Us info@pitchbook.com Request Research Profile Request Deal Submission Follow us     2025 PitchBook. Win whats next. All rights reserved. Terms of Use Privacy Policy California Consumer: Do Not Sell My Info By clicking Accept All Cookies, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts. Accept All Cookies Reject All Cookies Settings', 'rank': 4}, {'url': 'https://rocketreach.co/raphe-mphibr-private-limited-management_b45d4344fc61fa6c', 'content': \"Toggle navigation Log In Sign Up Company Information Management Technology Stack Competitors Raphe mPhibr Private Limited Management Raphe mPhibr Private Limited employs 53 employees.            The Raphe mPhibr Private Limited management team includes Prakash Aery (Senior Software Engineer Research Development) , Ayush Mishra (Drone Pilot) , and Riya Gupta (Hardware Design Engineer) . Get Contact Info for All Departments Looking for a particular Raphe mPhibr Private Limited employee's phone or email? Find Info Top Raphe mPhibr Private Limited Management Employees Prakash Aery Senior Software Engineer Research Development     at Raphe mPhibr Private Limited Noida, UP, IN View Ayush Mishra Drone Pilot     at Raphe mPhibr Private Limited Noida, UP, IN View Riya Gupta Hardware Design Engineer     at Raphe mPhibr Private Limited Noida, UP, IN View 1 mphibr.com Akash Srivastava Assistant Engineer Electronic     at Raphe mPhibr Private Limited Gurugram, HR, IN View 1 gmail.com Aravindh Rameshmurthy Senior Mechanical Technician     at Raphe mPhibr Private Limited Chennai, TN, IN View 1 gmail.com Mani Ojha Information Technology Manager     at Raphe mPhibr Private Limited Noida, Uttar Pradesh, India View 2 hcentive.com mphibr.com Dev Nagar Company Driver     at Raphe mPhibr Private Limited Delhi, DL, IN View 1 gmail.com Rakesh Kumar Electrical Engineer     at Raphe mPhibr Private Limited Delhi, India View Rajeshwar Aggarwal Account Manager     at Raphe mPhibr Private Limited Ghaziabad, UP, IN View Nikita Singh Electrical Trainee     at Raphe mPhibr Private Limited Kakori, UP, IN View View Similar People Related Companies River Engineering Pvt Ltd 304 $44.1m Learn More How It Works Get a Free Account Sign up for a free account. No credit card required. Up to 5 free lookups / month. Search the #1 Contact Database Get contact details of over 700M profiles across 60M companies all with industry-leading accuracy.                   Sales and Recruiter users, try out our Email Finder Extension . Use our AI-Powered Email Finder Find business and personal emails and mobile phone numbers with exclusive coverage across niche job titles, industries, and more for unparalleled targeting.                   Also available via our Contact Data API . Sign Up For Free G2Crowd Trusted 300K+ Plugin Users Start Team Plan Custom Plan Speak to Sales Company About Us Careers Blog Contact Us 2025 RocketReach.co\", 'rank': 5}, {'url': 'https://www.raphe.com/', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://www.outlookbusiness.com/start-up/investors/raphe-mphibr-bags-100-mn-in-indias-biggest-defence-tech-start-up-funding-round', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://founderlodge.com/round/Raphe-mPhibr-raises-100000000-Unknown-2025-06-27-Vivek-Mishra-MjMzODM', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
      "annotations": null
    }
  ],
  "linkedin_data_T003": [
    {
      "type": "text",
      "text": "[{'url': 'https://in.linkedin.com/company/raphe-mphibr', 'content': 'Raphe mPhibr | LinkedIn Skip to main content LinkedIn Articles People Learning Jobs Games Join now Sign in Raphe mPhibr Aviation and Aerospace Component Manufacturing Noida, Uttar Pradesh 45,379 followers India\\'s leading R&D-driven indigenous UAVs: world-class design & manufacturing, 500-1000 staff, 1M+ km flown since 2017 See jobs Follow Discover all 372 employees Report this company About us Raphe mPhibr, Raphe in short, is a hi-tech aerospace company designing and manufacturing comprehensive & customised UAV (Unmanned Aerial Vehicle) solutions, tested across terrains and weather conditions, with a million+ km traveled across India since 2017. With 400+ employees, world-class research & manufacturing facilities, and bright young minds trained at MIT, Georgia Tech, IITs, NITs and more, our philosophy is to design and manufacture end-to-end solutions in-house, and across engineering fields, including Aerodynamics, Mechanical, Materials, Electronics, Software & AI. Our vision is to innovate in-house to become self reliant in hi-tech manufacturing, and we have spurred a revolution in India by indigenously developing and manufacturing every subsystem used in a UAV.  Our products range from light-weight agile surveillance drones to high-endurance heavy-lift logistics drones. These are not white paper dreams: they have been flying for months and years, across terrains and seasons in India, for a total of over a million of kilometres! Recognized for our growth and inclusive culture, we are proud to be among LinkedIn\\'s Top 10 Startups and a recipient of the FICCI Women\\'s Empowerment Award.  Follow us, and come innovate together for a better society! Website https://www.raphe.com/ External link for Raphe mPhibr Industry Aviation and Aerospace Component Manufacturing Company size 201-500 employees Headquarters Noida, Uttar Pradesh Type Privately Held Founded 2017 Specialties UAV, Swarm, Logistics Drones, Intelligence Drones, Electronics R&D, Materials R&D, Software & AI R&D, Manufacturing, 3D Additive Manufacturing, CNC, and Ground Station Systems Locations Primary B -200, Sector 81 Phase II Noida, Uttar Pradesh 2013012, IN Get directions Employees at Raphe mPhibr Arun Agrawal Senior Mathematician Raphe mPhibr/ fracture mechanics, aerospace, data analysis/ IITD alum / IIT KGP alum Ashish Kumar ELECTRONICS ENGINEERING LEADER | SOLUTIONIST | MENTOR | EMBEDDED SYSTEM ARCHITECT | PRODUCT DEVELOPER | STRATEGIST| SENIOR VICE PRESIDENT Rishi Raj Bhati Aerospace Veteran || Mentor || Product Development || Operations Management || Program Management || Strategy and R&D || RPAS Instructor || AeMBA Dr. Roma Kumar Senior Consultant Psychologist | Sir Ganga Ram Hospital | Max Hospital | SAKSHAM- Mental Health Clinic See all employees Updates Raphe mPhibr 45,379 followers 2d Edited Report this post Were excited to announce that we have raised $100M. This is the largest round of private funding raised by an Indian company in this industry, ever, led by General Catalyst , with continued support from Amal Parikh, Think Investments , and Indias leading family offices. This funding is more than capital. It is a commitment; one weve upheld for nearly a decade now. A commitment to: -Innovate and build solutions in India, for those who protect it, and beyond. -Turn policy into product. -Make Aatmanirbhar Bharat not just a campaign, but a living, flying ecosystem.  Thank you to our investors, our partners, and our 600+ Drongans who believe in this mission. Together, we innovate for a better society. As we enter this next chapter, we are hiring. Follow us and join our journey. Full story from TechCrunch linked in the comments. 623 50 Comments Like Comment Share Raphe mPhibr 45,379 followers 1mo Report this post PhDs at ICRA Its the last day to join Raphes Innovation Challenge! Visit us at Booth 224 and scan the QR code to participate Winners will be announced this afternoon and awarded with an iPhone! IEEE International Conference on Robotics and Automation (ICRA) #ICRA2025 #RapheInnovationChallenge more 212 1 Comment Like Comment Share Raphe mPhibr 45,379 followers 1mo Report this post Georgia Tech Students Join our CEO and alumnus, Vivek Mishra, for an afternoon of conversations about the future of aerospace innovation. Stop by our pop-up booth to know more today, Wednesday, May 21, from 4 to 5 PM EST at the Weber Building. Georgia Tech Career Center Vivek Mishra 261 14 Comments Like Comment Share Raphe mPhibr reposted this Alex Guion, PhD COO at Raphe: we innovate for a better society | 600-strong: India\\'s most innovative aircraft manufacturer | 1M+ km flown since 2017 | Hiring globally | LinkedIn Rank #4 Startup in Delhi | Supelec MIT Raphe 2mo Report this post Raphe mPhibr wins SME of the Year at the 2025 Indo-French Business Awards presented by H.E. Mr. Thierry Mathou, Ambassador of France to India. \"The award honours companies that have demonstrated exceptional performance, innovation, and growth across all aspects of their organization during the financial year.\"  \"It celebrates businesses that have not only achieved operational excellence but have also contributed meaningfully to strengthening Indo-French economic collaboration through impactful partnerships, forward-thinking strategies, and a commitment to sustainable, inclusive growth.\" Thank you to Indo-French Chamber of Commerce & Industry (IFCCI) , Business France , and the French Embassy in India / Ambassade de France en Inde for this honour and recognition! -- Payal S. Kanwar , Estelle David , benoit gauthier , Petros Sourmelis , Claude SARRE , Mathieu Jouve-Villard , Sumeet Anand , Ravin MIRCHANDANI , Dr. Neelesh Gupta , Jean Touboul , Benoit RENARD , Rishika Roy , Aarushi Gautam, Akshay Thakur , Shiveti Verma , Tavishi Taneja , Anuja Sharma , HERVE MILLEQUANT , Clmentine Gallet , Franck Saudo , Alexandre ZIEGLER , Martin KLOTZ , Charlotte Coste , Pascal Daloz , Olivier Sappin , Frederic Besson , Oscar S. , Johanna Fiafialoto-Ferron , Marie Khater . CentraleSuplec & CentraleSuplec Alumni - Association , romain soubeyran , Olivier Gicquel , Adriano REBOULET COTTA , Laurence Pgorier , Foundation for Excellence . 415 83 Comments Like Comment Share Raphe mPhibr reposted this Foundation for Excellence 38,301 followers 3mo Edited Report this post We held our first Donor-Scholar meet for the FFE-Fraternit France India Scholarship Program on March 12th! This initiative is proudly supported by Raphe mPhibr India Private Limited and their COO, Mr. Alex Guion, PhD . As one of Indias most innovative tech companies, Raphe is revolutionizing industries with cutting-edge R&D in drones and engines. FFE Scholars had the unique opportunity to gain invaluable insights from Mr. Alexandres personal journey, leaving the session inspired and motivated to pursue their dreams.  We are grateful to have Raphe mPhibr as our partner in this mission and look forward to creating many more impactful opportunities for our scholars in the future. #FFE #FoundationForExcellence #GuidingFutureLeaders #Raphe Raphe mPhibr Alex Guion, PhD Prabhu Goel Minoo Gupta SUDHA KIDAO Ram Kolavennu Chandreyee Gupta Tanvi Rawat Bahuguna 162 2 Comments Like Comment Share Raphe mPhibr 45,379 followers 4mo Report this post How is closed-loop innovation a game changer for our UAVs?  Our COO, Alex Guion, PhD , explains in this conversation with Life of Soldiers . more 288 9 Comments Like Comment Share Raphe mPhibr 45,379 followers 4mo Report this post Republic Day may have passed, but its spirit continues to inspire us every day. As we push forward in our journey of innovation and national progress, we carry this energy with us. Heres a look back at a day that reminds us why we do what we do. #Indegenisation #MakeInIndia #Innovation more 293 5 Comments Like Comment Share Raphe mPhibr 45,379 followers 4mo Report this post Raphe x HENSOLDT : Pioneering Advanced MIMO Technology Were excited to partner with HENSOLDT to co-develop MIMO-based landin', 'rank': 1}, {'url': 'https://tracxn.com/d/companies/raphe/__9x7PDTYJ-2vzu-u7mq1O7Vk2NBg3GoR79phwK5J1nEk', 'content': \"Raphe - 2025 Company Profile, Team, Funding, Competitors & Financials - Tracxn JavaScript is disabled in your browser. enable it to enjoy the full features of Tracxn. Your browser was unable to load all of Tracxn resources. They may have been blocked by your firewall, proxy or browser configuration. Press Ctrl+F5 or Ctrl+Shift+R to have your browser try again and if that doesn't work, click here to retry or mail us at hi@tracxn.com Internal Server Error Toggle navigation Customers Investment Industry Venture Capital Funds Private Equity Funds Accelerators & Incubators Investment Banks Corporates and Startups Corp Dev and M&A Teams Corporate Innovation Startup Founders Sales Team Ecosystem Journalists and Publications Universities View All Customers Contact Us Offerings Rich Data Sets Companies Investors Funding Acquisitions Financials Cap Tables Employee Count Deep Dives Company deep-dive Investor deep-dive Activity by Corporates Sector Coverage Workflow Solutions Sourcing new deals Tracking Market Updates Portfolio Management Deal Flow CRM LiveDeals And Much More... Data Solutions Reports by Tracxn Enterprise Grade Support Sector Coverage Apps & Extensions View All Offerings Contact Us Try our premium features for FREE - no threads attached! Learn More Get Started. Its FREE Company Our Investors Media & Newsroom Careers Contact Us Pricing Login Get Started. It's FREE! Discover > Companies > Raphe Navigate to Overview About the company Legal Entities Funding and Investors Founders and Board of Directors Competitors and Alternates Latest Cap tables and Shareholding Investments and Acquisitions Reports News Funding & Investors Latest Shareholding Competitors Landscape Comparables Historical Cap Tables Historical Financials Who's likely to Invest? All Related Reports Unlock full details of this profile with our free Lite plan! Sign Up and Get Free Access Raphe - Company Profile soonicorn Last updated: June 28, 2025 Claim Profile Suggest Edits Linkedin Twitter Facebook Email Copy Url Request page removal Raphe - About the company Raphe is a series B company based in Noida (India), founded in 2017 by Nitin Katiyar and Vivek Mishra . It operates as a Manufacturer of carbon fiber composite products and unmanned aerial vehicles . Raphe has raised $140M in funding from investors like Think Investments , Ascent Capital and General Catalyst , with a current valuation of 7,160Cr . The company has 719 active competitors, including 112 funded and 41 that have exited . Its top competitor s include companies like DJI , ideaForge and Shield AI . Company Details Manufacturer of carbon fiber composite products and unmanned aerial vehicles. It focuses on research and development, utilizing technologies for the aerospace industry. It has infrastructure for additive, subtractive, PCB A, and composite manufacturing. The company emphasizes product and process innovation through end-to-end manufacturing. Website www.raphe.com/ Social Email ID *****@mphibr.com Phone Number +91 ********** Key Metrics Founded Year 2017 Location Noida, India Stage Series B Total Funding $140M in 4 rounds Latest Funding Round Series B, Jun 25, 2025 , $100M Post Money Valuation 7,160Cr as on Mar 28, 2025 Investors Think Investments & 37 more Ranked 19 th among 719 active competitors Annual Revenue 86.1Cr as on Mar 31, 2024 Employee Count 499 as on May 31, 2025 Similar Companies DJI & 880 more Legal entities associated with Raphe Raphe is associated with 1 legal entit y given below: Legal Entity Name Date of Incorporation Revenue Latest Employee Count Documents Raphe Mphibr Private Limited CIN: U26990UP2017PTC095246 India , Active Jul 20, 2017 $10.4M (as on Mar 31, 2024) 499 (as on May 31, 2025) Buy Now Get your free copy of Raphe 's company profile Get Company Profile Raphe's funding and investors Filter this list Raphe has raised a total funding of $140M over 4 round s . Its first funding round was on Aug 02, 2022 . Its latest funding round was a Series B round on Jun 25, 2025 for $100M . 3 investor s participated in its latest round, lead by General Catalyst . Raphe has 14 institutional investor s including Think Investments , Ascent Capital and General Catalyst . Think Investments is the largest institutional investor in Raphe . Vivek Gupta and 23 other s are Angel Investors in Raphe . Here is the list of recent funding rounds of Raphe : Date of funding Funding Amount Round Name Post money valuation Revenue multiple Investors Jun 25, 2025 $100M Series B 6068352 9589350 General Catalyst , Think Investments , and 1 more Mar 13, 2024 $7.25M Series B 6238990 9966984 Think Investments Apr 06, 2023 $17.6M Series B 4456199 8997342 Think Investments , Dovetail Capital , and 28 more Access funding benchmarks and valuations. Sign up today! View details of Raphe 's funding rounds and investors Raphe's founders and board of directors Founder? Claim Profile The founders of Raphe are Nitin Katiyar and Vivek Mishra . Vivek Mishra is the CEO of Raphe . Here are the details of Raphe's key team members: Nitin Katiyar : Co-Founder of Raphe and founder of 1 other compan y . They serve on the board of 1 compan y . Vivek Mishra : Co-Founder & CEO of Raphe and founder of 3 other compan ies , goSporto , Instasports and The SportsWave . View details of Raphe 's Founder profiles and Board Members Raphe's employee count trend Raphe has 499 employees as of May 25. The total employee count is 43.0% more than what it was in May 24. Here is Raphe 's employee count trend over the years: Uncover Raphe's growth story! Sign up today! Access Tracxn on any website Our Google Chrome extension lets you view company details while browsing their websites Install Tracxn Extension Raphe's Competitors and alternates Top competitor s of Raphe include DJI , ideaForge and Shield AI . Here is the list of Top 10 competitors of Raphe , ranked by Tracxn score: Overall Rank Company Details Short Description Total Funding Investors Tracxn Score 1st DJI 2006 , Shenzhen ( China ) , Series B Developer of multi-utility drones $105M Kleiner Perkins , GIC & 23 others 79/100 2nd ideaForge 2007 , Mumbai ( India ) , Public Manufacturer of indigenous unmanned aerial vehicles $53.8M Qualcomm Ventures , Qualcomm & 53 others 76/100 3rd Shield AI 2015 , San Diego ( United States ) , Series F Developer of AI fighter jet pilot and manufacturer of autonomous drones for surveillance and patrolling $1.17B Hercules Capital , SVB & 26 others 71/100 4th Skydio 2014 , Redwood City ( United States ) , Series E Provider of AI and cloud-based autonomous drones $715M Hercules Capital , IVP & 26 others 71/100 5th Garuda Aerospace 2015 , Chennai ( India ) , Series B Manufacturer of agri and consumer drone $49.3M Narotam Sekhsaria Family Office , Ocgrow Group of Companies & 168 others 69/100 6th Quantum Systems 2015 , Gilching ( Germany ) , Series C Platform develops multi-sensor unmanned aerial systems $410M European Investment Bank , Omnes Capital & 25 others 67/100 7th H3 Dynamics 2015 , Singapore ( Singapore ) , Series B Provides aerial inspection services using drones $39M EDBI , Sumitomo Mitsui Banking Corporation & 13 others 65/100 8th Vantage Robotics 2013 , San Francisco ( United States ) , Series B Creates unmanned aircraft systems $8.94M Hone Capital , CSC Upshot Ventures & 6 others 64/100 9th Aurora 1989 , Manassas ( United States ) , Acquired Develops unmanned and manned aerial vehicles and payloads $6.85M Global Environment Fund , CYwP Funds & 2 others 62/100 10th Airobotics 2014 , Scottsdale ( United States ) , Acquired Provider of designing and developing solutions for industrial drones $101M CRV , Generation Ventures & 12 others 58/100 19th Raphe 2017 , Noida ( India ) , Series B Manufacturer of carbon fiber composite products and unmanned aerial vehicles $140M Ascent Capital , General Catalyst & 36 others 53/100 Get insights and benchmarks for competitors of 2M+ companies! Sign up today! Looking for more details on Raphe 's competitors? Click here to see\", 'rank': 2}, {'url': 'https://techcrunch.com/2025/06/25/indian-drone-startup-raphe-mphibr-raises-100m-as-military-uav-demand-soars/', 'content': 'Indian drone startup Raphe mPhibr raises $100M as military UAV demand soars | TechCrunch Indian drone startup Raphe mPhibr raises $100M as military UAV demand soars | TechCrunch TechCrunch Desktop Logo TechCrunch Mobile Logo Latest Startups Venture Apple Security AI Apps Events Podcasts Newsletters Search Submit Site Search Toggle Mega Menu Toggle Topics Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture More from TechCrunch Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us Image Credits: Raphe mPhibr Transportation Indian drone startup Raphe mPhibr raises $100M as military UAV demand soars Jagmeet Singh 7:00 PM PDT June 25, 2025 Indian drone startup Raphe mPhibr has raised $100 million in an all-equity Series B round led by General Catalyst, as the startup aims to boost its R&D and local production capabilities amid growing demand for drones in battlefields and for border surveillance. Drones are becoming increasingly ubiquitous in global military operations. In recent and ongoing conflicts, countries have turned to drones for rapid infiltration and high-impact strikes . The recent India-Pakistan war is a prime example, with both militaries deploying drones at scale despite having advanced fighter jets and missile systems. The conflict spurred New Delhi to triple its drone spending to $470 million over the next 12 to 14 months, according to the Drone Federation of India, an association representing over 550 companies. While China remains the dominant force in global drone manufacturing, Raphe mPhibr aims to strengthen Indias indigenous drone capabilities. Co-founded by siblings Vikash Mishra (chairman) and Vivek Mishra (CEO) in 2017, the Noida-based startup currently offers nine different drones with payloads ranging from 4.4 pounds to 441 pounds, covering an average distance of between 12 and 124 miles. These drones include the mR10 operational drone swarm, the mR20 for high-altitude logistics resupply, the X8 compact platform for maritime patrol and situational awareness at sea, and the Bharat lightweight man-carried drone for quick surveillance in complex terrain. The startup has more than 10 customers, all of which are Indian government agencies, including the Indian Army, Navy, and Air Force, as well as armed police forces such as the Border Security Force, Central Reserve Police Force, and the Indo-Tibetan Border Police. The Mishra brothers conceptualized Raphe mPhibr in 2016 while Vikash was studying at the Massachusetts Institute of Technology and Vivek was at the Georgia Institute of Technology. For the initial three to four years, the co-founders focused on understanding the operational needs of the defense forces, along with other requirements, such as environmental and terrain considerations. Then they began building multicopters to meet the needs of the Indian troops, gradually expanding to fixed-wing and vertical takeoff and landing (VTOL) aircraft. In the process, we understood that since the need is new and the area is niche, we focused on both research and manufacturing because we didnt want to be constrained by what [already existed], Vivek said in an interview. Techcrunch event Save $450 on your TechCrunch All Stage pass Build smarter. Scale faster. Connect deeper. Join visionaries from Precursor Ventures, NEA, Index Ventures, Underscore VC, and beyond for a day packed with strategies, workshops, and meaningful connections. Save $200+ on your TechCrunch All Stage pass Build smarter. Scale faster. Connect deeper. Join visionaries from Precursor Ventures, NEA, Index Ventures, Underscore VC, and beyond for a day packed with strategies, workshops, and meaningful connections. Boston, MA | July 15 REGISTER NOW The startup began its journey with a 2,000-square-foot research facility in 2017 but expanded to a 100,000-square-foot combined research and manufacturing facility. This has now been expanded to a 650,000-square-foot facility as a result of the fresh capital infusion, which also saw the participation of its existing investor Think Investments. From day one, we have been against the transfer of technology, Vivek told TechCrunch. Raphes Surface Mount Technology (SMT) Line in Noida. Image Credits: Raphe mPhibr Raphe mPhibr domestically produces its flight controllers, batteries, and all components and materials required to build drone structures, including subtractive metals, thermoplastics, carbon fiber composites, and even wire harnesses. It also develops proprietary autopilots and inertial navigation systems at its facility. However, the startup imports radars and high-end cameras, which it also plans to manufacture in-house within 18 months. Vivek told TechCrunch that the startup does not rely on China for any of the components it uses, thereby avoiding some supply chain challenges. The biggest challenge was setting up the facility and doing research, he said. Because doing research in India is slightly more expensive compared to the U.S., just because the infrastructure is quite well set up there getting the machinery is a challenge, installation, and commissioning is a challenge, and then operating it, again, is a challenge because finding the people who can operate these is hard. Raphe mPhibr has addressed some of these hurdles by focusing on training and developing its employees from its early days, he added. The startup also utilizes AI on its drones for object detection in surveillance scenarios, automatically switching between frequency bands to adapt to electronic warfare and employing operational UAV swarm intelligence to make decentralized decisions using AI. In recent months, Raphe mPhibr has partnered with Germanys Hensoldt and Frances Safran to collaborate on developing new sensors, as well as with Frances Dassault Systmes for software simulation requirements. Raphe mPhibr also plans to expand beyond India and enter new markets. To this end, it has already participated in defense air shows, including those in Dubai and Paris. Vivek told TechCrunch that the startup already has some export licenses and is seeking more but declined to share specifics. There are very advanced talks happening with a few government agencies across the world, and very soon, hopefully, this year, we will start delivering there as well, he said. In the past 12 months, Raphe mPhibr has sold over 300 drones and has experienced up to 4x revenue growth over the last four years, Vivek said, without disclosing specific numbers. He also stated that the startup has been profitable for each of the last four years and is projected to go public within the next two to five years. Raphe mPhibr has around 600 employees, with 150 dedicated to research and over 250 to production. To date, the startup has secured a total of $145 million in equity funding. Topics General Catalyst , India , military drone , Raphe , Raphe mPhibr , Startups , Think Investments , Transportation , uav Jagmeet Singh Reporter Jagmeet covers startups, tech policy-related updates, and all other major tech-centric developments from India for TechCrunch. He previously worked as a principal correspondent at NDTV. You can reach out to him at mail[at]journalistjagmeet[dot]com. View Bio July 15, 2025 Boston, MA From seed to Series C and beyond founders and VCs of all stages are heading to Boston. Be part of the conversation. Save up to $425 now and tap into powerful takeaways, peer insights, and game-changing connections. Register Now Most Popular Rob Biederman will help founders rethink how to scale at TechCrunch All Stage 2025 TechCrunch Events Congress might block state AI laws for a decade. Heres what it means. Rebecca Bellan Maxwell Zeff As job losses loom, Anthr', 'rank': 3}, {'url': 'https://www.linkedin.com/posts/raphe-mphibr_welcome-newcmo-innovation-activity-7216773808647520256-LQgV', 'content': \"We are thrilled to welcome Mili to the Raphe mPhibr team as our new Chief Marketing Officer! | Raphe mPhibr Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIns User Agreement , Privacy Policy , and Cookie Policy . Skip to main content LinkedIn Articles People Learning Jobs Games Join now Sign in Raphe mPhibrs Post Raphe mPhibr 45,379 followers 11mo Report this post We are thrilled to welcome Mili to the Raphe mPhibr team as our new Chief Marketing Officer!  With an impressive background in finance and marketing from NYU and MIT Sloan, and previous experience as a Global Marketing Director at Twitter and Head of Marketing at Travelzoo, Mili brings a wealth of knowledge and passion to our company. Were excited about the incredible opportunities ahead as we continue to expand our global presence and push the boundaries of aerospace technology. We are proud to have her join us during this pivotal time for Raphe. Check out Milis announcement to learn more about her story and vision for Raphe mPhibr. Welcome aboard, Mili! Together, we will innovate for a better society. #Welcome #NewCMO #Innovation #TeamRaphe Mili Shah 11mo Beyond excited to share that Ive joined Raphe mPhibr as their Chief Marketing Officer! Raphe designs and manufactures drones and subsystems. Theyre at the forefront of aerospace technology. I first met Raphes founder, Vikash Mishra , and COO, Alex Guion, PhD , at MIT. Together, we led MIT GSW 2016, a startup conference in India. Supporting innovative businesses in India was one of the most fulfilling experiences of my career. Little did I know that 8 years later, I would be joining them again. This is an incredible time for growth at Raphe. Our drones have flown over 1,000,000 kilometers with unmatched precision across the harshest terrains. With over 400 employees, our team excels in design, prototyping, and advanced manufacturing. My mission will be to build on this momentum and expand Raphes presence in the global market. Thank you to Vikash, Alex, Vivek, Nitin, and Aman for bringing me onboard. The irony isnt lost on me. My parents came to the US to ensure career opportunities for me, and now Im joining a company based in India. India is the new land of opportunity with its groundbreaking innovation and rapid growth.  By the way, were hiring! If youre passionate about innovation and making a difference, join us. We innovate for a better society, together. 53 1 Comment Like Comment Share Copy LinkedIn Facebook Twitter HARSH KHANDELWAL UAV Design Intern focused on UAV design and aerodynamics. 11mo Report this comment Is there any intern opportunities available Like Reply 1Reaction To view or add a comment, sign in More Relevant Posts Riya Deo Brand partnership Attended Indian Institute of Technology, Patna 10mo Report this post Excited to share insights on our marketing strategy for the Mahindra XUV800 Electric Vehicle! This post is designed to be engaging, informative, and aligned with current digital marketing trends, while also emphasizing the sustainability aspect of the vehicle. As part of my classes through Internshala Trainings Internshala Ive been diving into the world of **marketing strategy** for the Mahindra XUV800, their latest electric vehicle. This experience has been incredibly rewarding, allowing me to apply my skills in real-world scenarios and collaborate with a forward-thinking team. From researching consumer trends to crafting targeted campaigns, I've gained valuable insights into the evolving EV market. Im particularly proud of the strategies were developing to position the XUV800 as a leader in sustainability and innovation. As we continue to push the boundaries in the EV market, our focus is on creating a campaign that not only highlights the XUV800's cutting-edge technology but also its sustainable impact on the environment. Key elements of our strategy: 1. Customer-Centric Approach:Understanding the needs of our target audience and emphasizing the convenience, efficiency, and eco-friendly benefits of switching to electric. 2.Digital -First Marketing:Leveraging social media, influencer collaborations, and targeted online ads to create buzz and reach a tech-savvy audience. 3. Interactive Experiences:Offering virtual test drives, immersive VR experiences, and engaging content that allows potential buyers to explore the XUV800's features from the comfort of their homes. 4. Sustainability Storytelling:Communicating our commitment to a greener future by showcasing the XUV800's role in reducing carbon footprints and promoting clean energy. The Mahindra XUV800 isn't just a vehicleit's a step towards a sustainable future. Let's drive the change together! #MahindraXUV800 #ElectricVehicle #Sustainability #MarketingStrategy #Innovation Looking forward to sharing more updates as we continue to drive change in the automotive industry! 8 1 Comment Like Comment Share Copy LinkedIn Facebook Twitter To view or add a comment, sign in Pushpendra Dwivedi Founder of Barrownz Group of Companies. 1y Report this post Meet Harshal Nakshane , the visionary behind Indias first AI car!  Harshal, hailing from Yavatmal, Maharashtra, is the founder of Nakshane AiCars , a groundbreaking startup pioneering hydrogen-based vehicles with artificial intelligence. His journey began in a humble and tiny garage, where he and his dedicated team spent 18 months making a remarkable prototype model. Their hard work paid off when they pitched their creation on Shark Tank India Season 3. The judges were astounded by the innovation, as the AI Car boasted a quick 5-minute refueling time and an impressive range of over 1,000 kilometers.  During the episode, three of the judges, Anupam Mittal , Vineeta Singh , and Namita Thapar , took a test drive with the AI Car and were thoroughly impressed. The prototype, resembling a sleek sports car, showcased the fusion of cutting-edge AI technology with automotive engineering. Harshal asked for 2 Crore for 4% equity in his company, but unfortunately, he did not secure a deal. Despite this setback, his determination and passion for innovation remain unwavering.  Harshal's journey serves as an inspiration to aspiring entrepreneurs across India. His dedication to creating sustainable transportation solutions highlights the importance of combining technology and environmental consciousness in the automotive industry. #ai #future #car #innovation #automotive #technology #highlights #industry 3 Like Comment Share Copy LinkedIn Facebook Twitter To view or add a comment, sign in Rajat Hegde Founder at VOZI 1y Edited Report this post In FY 23-24, our first year of full fledged operations was a great learning experience for me and Bharath Ramaswamy . We experimented with different operational models and explored various sectors within our service domain while we got to work with some of the very leading organisations in the mobility space . Through hands-on experimentation by running operations and services on the ground, we were able to generate revenue exceeding 4 crore INR. Each month brought improvements in different areas which helped out survive through burn. Moving into FY 24-25, our focus remains on improvement: 1. Fleet Efficiency: 96.3% - Driver per Vehicle - Vehicle on Road - Charging Optimisation 2. Average Revenue per Vehicle : 1.25L This number is a dream for any EV fleet operator considering the above pointers + demand(The hardest point to keep it constant) by constantly trying to reduce the dry run and which in turn improves your revenue/km. We are actively working to solve two major problems with tech - Consistency and predictability in demand - Tools for efficient fleet management at scale Excited for the year ahead at Vozi , as we look to leverage our experience from running more than 2L+ trips with our EV fleets to develop tech products that benefit not only existing fleet operators but also promote more entrepreneurs looking to build and grow\", 'rank': 4}, {'url': 'https://www.entrepreneur.com/en-in/news-and-trends/raphe-mphibr-raises-usd-100-mn-funding-to-scale/493886', 'content': 'Raphe mPhibr Raises USD 100 Mn Funding to Scale Defence-Tech Manufacturing | Entrepreneur Skip to content Menu Close Menu Sign In Subscribe Search Search Close Menu Subscribe to Entrepreneur Starting Up Growing a Business Franchise Inspiration For Subscribers Write for Entrepreneur Bookstore Ask an Expert Tips White Papers Podcasts Video Entrepreneur TV Webinars Entrepreneur Store Spotlight Entrepreneur Authorities Entrepreneur Authorities Magazine Subscription Edition Plus Minus United States Spanish Georgia India Asia Pacific Middle East United Kingdom Europe Facebook X LinkedIn YouTube Instagram RSS Copyright 2025 Entrepreneur Media, LLC All rights reserved. Entrepreneur and its related marks are registered trademarks of Entrepreneur Media LLC Home Home Breadcrumb Arrow News and Trends Raphe mPhibr Raises USD 100 Mn Funding to Scale Defence-Tech Manufacturing The round was led by General Catalyst, with participation from Think Investments, Amal Parikh, and several family offices. By Entrepreneur Staff Jun 27, 2025 Share Copy You\\'re reading Entrepreneur India, an international franchise of Entrepreneur Media. Vikash Mishra, Co-founder & CEO, Raphe mPhibr|LinkedIn Indian aerospace and defence-tech startup Raphe mPhibr has raised USD 100 million in a funding round led by General Catalyst, with participation from Think Investments, Amal Parikh, and several family offices. This marks the largest private capital raise in India\\'s aerospace manufacturing sector to date, bringing the company\\'s total funding to USD 145 million. The freshly raised capital will be deployed to scale manufacturing capacity, accelerate R&D, and deepen strategic partnerships, both in India and globally. The company aims to strengthen its footprint in the global aerospace supply chain, while supporting India\\'s defence self-reliance goals. \"We are proud to join forces with Raphe mPhibr on their transformative journey to redefine engineering-led manufacturing across a spectrum of critical applications,\" said Neeraj Arora, Managing Director at General Catalyst. \"The products emerging from Raphe mPhibr are already making a tangible impact on the ground.\" Founded in 2016 by Vikash Mishra, Vivek Mishra, and Nitin Katiyar, Raphe mPhibr operates out of Noida and specialises in designing and manufacturing advanced unmanned aerial vehicles (UAVs) and military-grade avionics. Its offerings include: mR10 : Operational drone swarm platform mR20 : High-altitude logistics drone Bharat : Man-portable surveillance drone X8 : Compact maritime patrol UAV Several of these systems are already deployed by the Indian defence forces, with others nearing final validation. Raphe mPhibr runs a vertically integrated aerospace campus, with in-house teams working across aerodynamics, thermodynamics, materials science, engine development, and electronics. The company has also built India\\'s first indigenous military-grade autopilot and a lightweight internal combustion engine for UAVs, reflecting a commitment to sovereign technology innovation. The startup partners with global defence majors such as Dassault Systmes, HENSOLDT, and Safran Electronics & Defense, and uses platforms like Dassault\\'s 3DEXPERIENCE to drive end-to-end system integration. With over 600 employees and 100+ unique IPs, Raphe mPhibr aligns closely with national initiatives like Aatmanirbhar Bharat and Make in India, which aim to reduce reliance on imported defence systems. The company\\'s solutions are also gaining interest in international markets, including Paris, Dubai, and London. The funding arrives amid India\\'s broader efforts to boost its private aerospace ecosystem, including recent government moves to commercialise launch vehicle technologies and promote innovation through programs like iDEX (Innovations for Defence Excellence). Wavy Line Wavy Line Entrepreneur Staff Entrepreneur Staff Editor For more than 30 years, Entrepreneur has set the course for success for millions of entrepreneurs and small business owners. We\\'ll teach you the secrets of the winners and give you exactly what you need to lay the groundwork for success. Most Popular Red Arrow See all Chevron Right Business Ideas 70 Small Business Ideas to Start in 2025 We put together a list of the best, most profitable small business ideas for entrepreneurs to pursue in 2025. By    Eve Gumpel Business News Getting a Wharton MBA Was \\'a Waste of Time,\\' According to a Global Bank CEO. Here\\'s the Degree He Recommends Instead. Bill Winters is the CEO of the 160-year-old international bank, Standard Chartered. By    Sherin Shibu Growth Strategies The Micro, Small, and Mighty: MSME Day 2025 The story of India\\'s MSMEs is far from over. Their future will be shaped not only by how well they adopt new technologies but also by how inclusively they grow, how strategically they invest, and how sustainably they operate. By    Aditya Pran Mahanta News and Trends 5 Key Lessons from Mukesh Ambani\\'s Leadership Playbook Drawing from decades of experience, Ambani\\'s remarks offer practical insight into risk-taking, innovation, institutional culture, and building for the long term By    Entrepreneur Staff Leadership I\\'ve Managed 260 Employees Here\\'s How to Tell If Your Leadership Style Is Actually Working These six clues always predict whether or not there\\'s strong leadership nearby. If you don\\'t see these six things, poor leadership isn\\'t far. By    Amy M Chambers Business News Kickstarter Campaign Raises Record $44 Million With 3D UV Printer Designed for Entrepreneurs: \\'Overwhelming Support\\' The Kickstarter campaign is the most funded project in the history of the crowdfunding site, with pledges from 17,220 individual backers. By    Sherin Shibu Success Successfully copied link Terms of Use Privacy Policy Cookies Policy Accessibility Statement Site Map Contact Support Advertise Cookie Management Sign up for our free Daily newsletter We\\'ll be in your inbox every morning Monday-Saturday with all the days top business news, inspiring stories, best advice and exclusive reporting from Entrepreneur. We are a proud American independent media company that has never taken a dime of USAID taxpayer money Facebook X LinkedIn YouTube Instagram RSS Copyright 2025 Entrepreneur Media, LLC All rights reserved. Entrepreneur and its related marks are registered trademarks of Entrepreneur Media LLC', 'rank': 5}]",
      "annotations": null
    }
  ],
  "competitor_urls_1A": [
    "https://duckduckgo.com/y.js?ad_domain=aerogcs.com&ad_provider=bingv7aa&ad_type=txad&click_metadata=UJzlFZOsjULS0Aj_PquLKZBW8S9%2DmkdkjkZS3GqogqWk%2DmCGKjL6YuXLmgJD_CojczhiaxIjxBYryX8FqF4Rxy60PJ%2DocPxMuDymd_fa5GEN4MkfgVyXkt_shQZke_pL.egYOOTZIoNitg5CSkWfCCw&rut=fb803119f9098d39926a4c8e1aa1dc7de663e176c17bb408143c71ccbac62941&u3=https%3A%2F%2Fwww.bing.com%2Faclick%3Fld%3De8n4A_dU6Nrt5QwL5c6gtu6zVUCUyLPuyv5b40hUOO%2DIRcZeqjCWk4tuhXNpDxmnoQ9uIk%2Dge7QC7KD2K_WZHny7fsxwnLLX6P0WYLHMw5Vosd1xabRUhz9pwDmpH0myRbjV6LDJr4pj79f0DQcxrUepp6TRmdNhR9OHcceF5zpOC7G8PrcsO0CYPIojRHn5i8ZO5q9g%26u%3DaHR0cHMlM2ElMmYlMmZhZXJvZ2NzLmNvbSUyZmFnLWZsaWdodC1jb250cm9sbGVyJTJmJTNmbXNjbGtpZCUzZDliNWU2NWI2NTY3NjFmZDExZjQyMGRlOTNjZTYwODk5%26rlid%3D9b5e65b656761fd11f420de93ce60899&vqd=4-65788557266799913912934206016763680254&iurl=%7B1%7DIG%3DCAE8567BE0D64BB8B4C35F62B17124C3%26CID%3D22DD70F51E94631E3AC866EC1F3C6283%26ID%3DDevEx%2C5046.1",
    "https://techcrunch.com/2025/06/25/indian-drone-startup-raphe-mphibr-raises-100m-as-military-uav-demand-soars/",
    "https://www.sutrahr.com/best-drone-startups-in-india/",
    "https://inc42.com/startups/16-defence-tech-startups-fuelling-the-make-in-india-drive-in-defence/",
    "https://www.indiandefensenews.in/2025/01/25-major-defence-tech-start-ups.html",
    "https://www.ceovine.com/10-defense-tech-startups-championing-indias-military-self-sufficiency/",
    "https://bwdefence.com/article/india-makes-a-leap-into-advanced-warfare-with-uav-robotics-startups-key-growth-drivers-in-2025-543150",
    "https://ipocentral.in/top-defence-tech-startups-in-india/",
    "https://www.khaleejtimes.com/business/indias-defence-startups-show-strong-promise-in-homegrown-tech",
    "https://www.timesnownews.com/business-economy/industry/noida-based-drone-startup-secures-100-million-after-op-sindoor-eyes-strategic-growth-in-indian-defence-sector-article-152162886"
  ],
  "competitor_data_T010": [
    {
      "url": "https://duckduckgo.com/y.js?ad_domain=aerogcs.com&ad_provider=bingv7aa&ad_type=txad&click_metadata=UJzlFZOsjULS0Aj_PquLKZBW8S9%2DmkdkjkZS3GqogqWk%2DmCGKjL6YuXLmgJD_CojczhiaxIjxBYryX8FqF4Rxy60PJ%2DocPxMuDymd_fa5GEN4MkfgVyXkt_shQZke_pL.egYOOTZIoNitg5CSkWfCCw&rut=fb803119f9098d39926a4c8e1aa1dc7de663e176c17bb408143c71ccbac62941&u3=https%3A%2F%2Fwww.bing.com%2Faclick%3Fld%3De8n4A_dU6Nrt5QwL5c6gtu6zVUCUyLPuyv5b40hUOO%2DIRcZeqjCWk4tuhXNpDxmnoQ9uIk%2Dge7QC7KD2K_WZHny7fsxwnLLX6P0WYLHMw5Vosd1xabRUhz9pwDmpH0myRbjV6LDJr4pj79f0DQcxrUepp6TRmdNhR9OHcceF5zpOC7G8PrcsO0CYPIojRHn5i8ZO5q9g%26u%3DaHR0cHMlM2ElMmYlMmZhZXJvZ2NzLmNvbSUyZmFnLWZsaWdodC1jb250cm9sbGVyJTJmJTNmbXNjbGtpZCUzZDliNWU2NWI2NTY3NjFmZDExZjQyMGRlOTNjZTYwODk5%26rlid%3D9b5e65b656761fd11f420de93ce60899&vqd=4-65788557266799913912934206016763680254&iurl=%7B1%7DIG%3DCAE8567BE0D64BB8B4C35F62B17124C3%26CID%3D22DD70F51E94631E3AC866EC1F3C6283%26ID%3DDevEx%2C5046.1",
      "content": [
        {
          "type": "text",
          "text": "[trafilatura] rediscover the Brilliance that flies\nAeroFC Ag++\nA powerful, plug-and-play agriculture drone flight controller designed to deliver\nunmatched performance and precision for modern farming operations.\nSUPERIOR PROCESSING POWER\nAg++ Flight Controller is powered by a high-performance main processor built on a 32-bit\narchitecture, running at high speed. It operates alongside an efficient I/O processor to\nmanage input and output seamlessly.\nAg++ Flight Controller is powered by a high-performance main processor built on a 32-bit architecture, running at high speed. It operates alongside an efficient I/O processor to manage input and output seamlessly.\n32 bit\narchitecture\nI/O processor\nto manage input & output\nADVANCED EXTERNAL\nSENSOR SUPPORT\nAg++ Flight Controller supports CAN-based front and back\nobstacle avoidance radars, allowing your drone to navigate\ncomplex environments with ease. Additionally, the CAN-based\naltimeter provides precise terrain - following capabilities, ensuring\nstable and accurate flights even in rugged or varied landscapes.\nAg++ Flight Controller supports CAN-based front and back obstacle avoidance radars, allowing your drone to navigate complex environments with ease. Additionally, the CAN-based altimeter provides precise terrain - following capabilities, ensuring stable and accurate flights even in rugged or varied landscapes.\nCAN-Based Front And Back Obstacle\nAvoidance Radars\nCAN-Based Front And Back Obstacle\nAvoidance Radars\nProvides Precise Terrain-Following Capabilities\nBROADER CONNECTIVITY FOR FLEXIBILITY\nAg++ Flight Controller offers 8 PWM outputs for motors, 4 auxiliary PWM/GPIO outputs, and 2 CAN buses, 3 UART ports for complex configurations and seamless connectivity. The dedicated R/C inputs for PPM and S. Bus signals ensure compatibility with a wide range of external systems, giving you ultimate exibility in customizing your drone setup.\nAg++ Flight Controller offers 8 PWM outputs for motors, 4 auxiliary PWM/GPIO outputs, and 2 CAN buses, 3 UART ports for complex configurations and seamless connectivity. The dedicated R/C inputs for PPM and S. Bus signals ensure compatibility with a wide range of external systems, giving you ultimate exibility in customizing your drone setup.\n01 Ag++ offers 8 PWM outputs for motors\n02 4 auxiliary PWM/GPIO outputs\n03 2 CAN buses, 3 UART ports\n04 Dedicated R/C inputs for PPM and S\n- 01. Ag++ offers 8 PWM outputs for motors\n- 02. 4 auxiliary PWM/GPIO outputs\n- 03. 2 CAN buses, 3 UART ports\n- 04. Dedicated R/C inputs for PPM and S\nENHANCED SENSORS\nFOR PRECISION\nAg++ Flight Controller features a highly advanced sensor suite with precision accelerometers, gyroscopes, a magnetometer, and dual barometers, ensuring exceptional accuracy in motion detection, altitude, and orientation measurements.\nENHANCED SENSORS\nFOR PRECISION\nAg++ features a highly advanced sensor suite with precision accelerometers, gyroscopes, a magnetometer, and dual barometers, ensuring exceptional accuracy in motion detection, altitude, and orientation measurements.\nFUTURE-READY DESIGN\nAg++ Flight Controller is built to handle the growing needs of precision agriculture and advanced drone operations. Its compact design makes it lightweight and easy to integrate into a variety of drone systems.\nAg++ Flight Controller is built to handle the growing needs of precision agriculture and advanced drone operations. Its compact design makes it lightweight and easy to integrate into a variety of drone systems.\nPACKAGE INCLUDES:\nAeroGCS Config\nAeroGCS Config is specialized software in the AeroGCS suite, designed for manufacturers. It offers settings to customize drone configuration, allowing manufacturers to configure parameters for specific operational and performance requirements.\nConfigurations Include\nAeroGCS GREEN Software\nAeroGCS GREEN, Indias first IV&V-certified precision spraying software, ensures uniform spraying, simplifies mission planning, and boosts efficiency with features like obstacle avoidance, spray flow monitoring, and detailed reporting.\nKey Features\nAeroGCS Enterprise\nAeroGCS Enterprise SaaS platform enables real-time drone tracking, detailed logging, and seamless fleet management. AeroGCS GREEN can be seamlessly integrated with AeroGCS Enterprise for efficient data synchronization.\nKey Features\nA Plug and Play Flight Controller\nfor Agriculture Drones\nA Plug and Play Flight Controller for Agriculture Drones\n-\nHEAD QUARTER:\n6th Floor, Royale Arc Avenue, ITI Signal,\nNear Indian Oil Petrol Pump, Nashik - 422007\nMob. +(91) 77700 13322\n-\nPRODUCT DEVELOPMENT CENTRE:\nPropeller 1:\n7th Floor, Royale Arc Avenue, ITI Signal,\nNear Indian Oil Petrol Pump, Nashik - 422007\nMob. +(91) 77700 13322\n-\nREGIONAL OFFICE:\nNo.6, 3rd Floor, 1st A Cross, Dr. Shivaramkaranth\nNagar, MCECHS Layout, R.K. Nagar, Bengaluru-560077\n-\nHEAD QUARTER:\n6th Floor, Royale Arc Avenue, ITI Signal,\nNear Indian Oil Petrol Pump, Nashik - 422007\nMob. +(91) 77700 13322\n-\nPRODUCT DEVELOPMENT CENTRE:\nPropeller 1:\n7th Floor, Royale Arc Avenue, ITI Signal,\nNear Indian Oil Petrol Pump, Nashik - 422007\nMob. +(91) 77700 13322\n-\nREGIONAL OFFICE:\nNo.6, 3rd Floor, 1st A Cross, Dr. Shivaramkaranth\nNagar, MCECHS Layout, R.K. Nagar, Bengaluru-560077",
          "annotations": null
        }
      ]
    },
    {
      "url": "https://techcrunch.com/2025/06/25/indian-drone-startup-raphe-mphibr-raises-100m-as-military-uav-demand-soars/",
      "content": [
        {
          "type": "text",
          "text": "[visible] Indian drone startup Raphe mPhibr raises $100M as military UAV demand soars | TechCrunch\nIndian drone startup Raphe mPhibr raises $100M as military UAV demand soars | TechCrunch\nTechCrunch Desktop Logo\nTechCrunch Mobile Logo\nLatest\nStartups\nVenture\nApple\nSecurity\nAI\nApps\nEvents\nPodcasts\nNewsletters\nSearch\nSubmit\nSite Search Toggle\nMega Menu Toggle\nTopics\nLatest\nAI\nAmazon\nApps\nBiotech & Health\nClimate\nCloud Computing\nCommerce\nCrypto\nEnterprise\nEVs\nFintech\nFundraising\nGadgets\nGaming\nGoogle\nGovernment & Policy\nHardware\nInstagram\nLayoffs\nMedia & Entertainment\nMeta\nMicrosoft\nPrivacy\nRobotics\nSecurity\nSocial\nSpace\nStartups\nTikTok\nTransportation\nVenture\nMore from TechCrunch\nEvents\nStartup Battlefield\nStrictlyVC\nNewsletters\nPodcasts\nVideos\nPartner Content\nTechCrunch Brand Studio\nCrunchboard\nContact Us\nImage Credits:\nRaphe mPhibr\nTransportation\nIndian drone startup Raphe mPhibr raises $100M as military UAV demand soars\nJagmeet Singh\n7:00 PM PDT  June 25, 2025\nIndian drone startup\nRaphe mPhibr\nhas raised $100 million in an all-equity Series B round led by General Catalyst, as the startup aims to boost its R&D and local production capabilities amid growing demand for drones in battlefields and for border surveillance.\nDrones are becoming increasingly ubiquitous in global military operations. In recent and ongoing conflicts, countries have turned to drones\nfor rapid infiltration\nand\nhigh-impact strikes\n. The recent India-Pakistan war is a prime example, with both militaries\ndeploying drones at scale\ndespite having advanced fighter jets and missile systems. The conflict spurred New Delhi to triple its drone spending to $470 million over the next 12 to 14 months,\naccording\nto the Drone Federation of India, an association representing over 550 companies.\nWhile China\nremains the dominant force\nin global drone manufacturing, Raphe mPhibr aims to strengthen Indias indigenous drone capabilities.\nCo-founded by siblings Vikash Mishra (chairman) and Vivek Mishra (CEO) in 2017, the Noida-based startup currently offers nine different drones with payloads ranging from 4.4 pounds to 441 pounds, covering an average distance of between 12 and 124 miles. These drones include the mR10 operational drone swarm, the mR20 for high-altitude logistics resupply, the X8 compact platform for maritime patrol and situational awareness at sea, and the Bharat lightweight man-carried drone for quick surveillance in complex terrain.\nThe startup has more than 10 customers, all of which are Indian government agencies, including the Indian Army, Navy, and Air Force, as well as armed police forces such as the Border Security Force, Central Reserve Police Force, and the Indo-Tibetan Border Police.\nThe Mishra brothers conceptualized Raphe mPhibr in 2016 while Vikash was studying at the Massachusetts Institute of Technology and Vivek was at the Georgia Institute of Technology. For the initial three to four years, the co-founders focused on understanding the operational needs of the defense forces, along with other requirements, such as environmental and terrain considerations. Then they began building multicopters to meet the needs of the Indian troops, gradually expanding to fixed-wing and vertical takeoff and landing (VTOL) aircraft.\nIn the process, we understood that since the need is new and the area is niche, we focused on both research and manufacturing because we didnt want to be constrained by what [already existed], Vivek said in an interview.\nTechcrunch event\nSave $450 on your TechCrunch All Stage pass\nBuild smarter. Scale faster. Connect deeper. Join visionaries from Precursor Ventures, NEA, Index Ventures, Underscore VC, and beyond for a day packed with strategies, workshops, and meaningful connections.\nSave $200+ on your TechCrunch All Stage pass\nBuild smarter. Scale faster. Connect deeper. Join visionaries from Precursor Ventures, NEA, Index Ventures, Underscore VC, and beyond for a day packed with strategies, workshops, and meaningful connections.\nBoston, MA\n|\nJuly 15\nREGISTER NOW\nThe startup began its journey with a 2,000-square-foot research facility in 2017 but expanded to a 100,000-square-foot combined research and manufacturing facility. This has now been expanded to a 650,000-square-foot facility as a result of the fresh capital infusion, which also saw the participation of its existing investor Think Investments.\nFrom day one, we have been against the transfer of technology, Vivek told TechCrunch.\nRaphes Surface Mount Technology (SMT) Line in Noida.\nImage Credits:\nRaphe mPhibr\nRaphe mPhibr domestically produces its flight controllers, batteries, and all components and materials required to build drone structures, including subtractive metals, thermoplastics, carbon fiber composites, and even wire harnesses. It also develops proprietary autopilots and inertial navigation systems at its facility. However, the startup imports radars and high-end cameras, which it also plans to manufacture in-house within 18 months.\nVivek told TechCrunch that the startup does not rely on China for any of the components it uses, thereby avoiding some supply chain challenges.\nThe biggest challenge was setting up the facility and doing research, he said. Because doing research in India is slightly more expensive compared to the U.S., just because the infrastructure is quite well set up there getting the machinery is a challenge, installation, and commissioning is a challenge, and then operating it, again, is a challenge because finding the people who can operate these is hard.\nRaphe mPhibr has addressed some of these hurdles by focusing on training and developing its employees from its early days, he added.\nThe startup also utilizes AI on its drones for object detection in surveillance scenarios, automatically switching between frequency bands to adapt to electronic warfare and employing operational UAV swarm intelligence to make decentralized decisions using AI.\nIn recent months, Raphe mPhibr has partnered with Germanys Hensoldt and Frances Safran to collaborate on developing new sensors, as well as with Frances Dassault Systmes for software simulation requirements.\nRaphe mPhibr also plans to expand beyond India and enter new markets. To this end, it has already participated in defense air shows, including those in Dubai and Paris.\nVivek told TechCrunch that the startup already has some export licenses and is seeking more but declined to share specifics.\nThere are very advanced talks happening with a few government agencies across the world, and very soon, hopefully, this year, we will start delivering there as well, he said.\nIn the past 12 months, Raphe mPhibr has sold over 300 drones and has experienced up to 4x revenue growth over the last four years, Vivek said, without disclosing specific numbers. He also stated that the startup has been profitable for each of the last four years and is projected to go public within the next two to five years.\nRaphe mPhibr has around 600 employees, with 150 dedicated to research and over 250 to production. To date, the startup has secured a total of $145 million in equity funding.\nTopics\nGeneral Catalyst\n,\nIndia\n,\nmilitary drone\n,\nRaphe\n,\nRaphe mPhibr\n,\nStartups\n,\nThink Investments\n,\nTransportation\n,\nuav\nJagmeet Singh\nReporter\nJagmeet covers startups, tech policy-related updates, and all other major tech-centric developments from India for TechCrunch. He previously worked as a principal correspondent at NDTV. You can reach out to him at mail[at]journalistjagmeet[dot]com.\nView Bio\nJuly 15, 2025\nBoston, MA\nFrom seed to Series C and beyond  founders and VCs of all stages are heading to Boston. Be part of the conversation. Save up to $425 now and tap into powerful takeaways, peer insights, and game-changing connections.\nRegister Now\nMost Popular\nRob Biederman will help founders rethink how to scale at TechCrunch All Stage 2025\nTechCrunch Events\nCongress might block state AI laws for a decade. Heres what it means.\nRebecca Bellan\nMaxwell Zeff\nAs job losses loom, Anthr",
          "annotations": null
        }
      ]
    },
    {
      "url": "https://www.sutrahr.com/best-drone-startups-in-india/",
      "content": [
        {
          "type": "text",
          "text": "[visible] 13 Drone Startups in India: Aatmanirbhar in Defence Technology\nSkip to content\nDedicated Resource Model\nIndustry\nTech Recruitment Agency in India\nFinTech Recruitment\nEcommerce Recruitment\nIT Recruitment Agency in Mumbai\nDigital Media Recruitment\nResource\nCONTACT US\nAbout us\nHR Tool Kit\nCase Studies\nBlog\nExplore HR Software\nSearch for:\n20\nApr\nadmin\nTop Startups in India\nDrone startups in India has grown significantly, with a 34.4% surge in the number of startups in this space between August 2021 and February 2022. Moreover, as per industry reports, the annual sales turnover of the drone manufacturing industry in India is expected to increase from INR 60 crore in FY21 to over INR 900 crore in FY24, showcasing the sectors enormous potential.\nFollowing the liberalization of the drone policy by the Indian government in July 2021,\nmany startups\nand companies have ventured into the drone industry. Thus, it is worth examining some of\nInnovative Drone Startups in India 2023:\nAarav Unmanned Systems\nAarav Unmanned Systems (AUS) is a prominent drone technology company that provides comprehensive drone solutions for enterprise applications in Mining, Infrastructure, Urban Planning, Irrigation, Energy, and Agriculture.\nAUS was shortlisted by the Indian government to map Indias 600,000 villages. In July 2022, AUS partnered with Tata Steel to offer innovative and efficient integrated drone solutions for open-cast mining operations. AUS also secured a lease financial deal worth INR 3.75 Cr with Grip, highlighting its commitment to innovation and growth in the\nIndian drone technology market\n.\nTheir design innovation, data analytics, and data democratization efforts continually set world-class tech benchmarks, making them the leader in Indias commercial drone industry. AUS has already mapped over 5.5 million acres of land for various projects in India, including 200+ mines, 35+ cities, and 25,000+ villages.\nWebsite\n:\nhttps://aus.co.in/\nFounding Year:\n2013\nFounder Detail:\nVipul Singh, Suhas Banshiwala\nFunding:\n$748K in funding to date\nAero360\nAero360 is a drone solutions provider based in India. Their services include mapping and surveying, 3D modeling, inspection and monitoring, and more. They offer customized solutions for industries such as agriculture, mining, construction, and infrastructure. Aero360 also\nprovides training programs\nfor drone pilots and data analysts. They claim to use advanced drone technology and software for data processing and analysis. They have clientele like Vedanta, Indus Power, Tata Communication & many more.\nWebsite:\nhttps://aero360.co.in/\nFounding Year:\n2017\nFounder Detail:\nPragadish Santhosh\nFunding:\nUndisclosed Funding to date\nDeTect Technologies\nDeTect Technologies, headquartered in Chennai, is an Indian company focused on developing pipeline integrity and management solutions. The company develops products that support predictive maintenance of oil and gas pipelines and leak prediction.\nThe companys flagship product, GUMPS, is a fully automated continuous condition monitoring system for channels that can operate in extreme temperatures. With a vision to make industries safe and efficient, their team works to develop intelligent and affordable technology.\nSince its inception in 2016, Detect has penetrated 80% of the market in Indias oil and gas sector and is also present in other processing industries such as steel, electricity, chemicals and fertilizers.\nSome of their clients include Nayara Energy, Jindal Steel & Power, Indian Oil, Coromandel, NTPC, Adani, Cipla, Vedanta, and many more.\nWebsite\n:\nhttps://detecttechnologies.com/\nFounding Year:\n2016\nFounder Details:\nDaniel Raj David, Harikrishnan A.S., & Tarun Mishra\nFunding:\nUndisclosed Amount\nDhaksha Unmanned Systems\nDUMS (Drone User Management System) is a leading end-to-end unmanned aerial systems (UAS) technology solutions provider. With our domain expertise, They offer a complete range of services to build a world-class technology company that meets the growing demands of the UAS/UAV technology market.\nThe company focuses on developing Smart Drones (SD) to cater to the future demands of homeland security and civil and commercial market segments. They provide UAS technology solutions for various industries, including Agriculture, Forestry, Transportation, Mining & Energy, Remote Sensing, Tourism, Hazardous Material Handling, and Smart City applications.\nWebsite:\nhttps://www.teamdhaksha.com/\nFounding Year:\n2019\nFounder Detail:\nRamanathan Narayanan\nFunding:\nUndisclosed Amount funding to date\nDroneAcharya Aerial\nDroneAcharya is a leading drone-based solutions provider for diverse industries such as Oil & Gas, Mining, Infrastructure, and Agriculture. Along with enterprise solutions, the company offers comprehensive training in drone control, construction, data processing, and other industrial drone applications.\nIn December 2022, DroneAcharya secured pre-IPO funding of Cr INR 9.66 from renowned investors such as Aegis Investment Fund, India Maven Fund, Nav Capital Fund VCC-NAV Capital, and Zinnia Global Fund.\nThe companys innovative solutions enable businesses to access Live Views, Inspection, and 3D Modeling of their assets underwater or on the ground. Additionally, DroneAcharya provides DGCA Certified Drone Pilot Training and Geospatial Training Courses to equip professionals with the required skills and certification to excel in the field.\nWebsite Link:\nhttps://droneacharya.com\nFounding Year:\n2017\nFounder Details:\nPrateek Srivastava\nFunding:\nUndisclosed Amount\nDrones TechLab\nDrone Tech Lab, headquartered in Kolkata, West Bengal, is a provider of customized geospatial solutions using unmanned systems. The company is committed to delivering speed, precision, innovation, and a flexible service ethic. Their surveillance solutions encompass hardware, software, and data analysis systems.\nDrone Tech Lab offers a wide range of drones, including Agricultural Drones, Pesticide Spraying Drones, Crop Monitoring Drones, Surveillance Drones, Camera Drones, Magnetic Control Helicopters luxury (RC), Swarm Drones, Anti-Drone Systems, Water Heaters, and Photography Drones. They also act as an importer and have established a relationship with DJI Drone company, offering a range of products for both beginners and expert users.\nDrone Tech Lab has a reputable and accredited customer base, including DIAT (under\nDRDO\n), Merlin Corporation, and the Indian Army.\nWebsite Link:\nhttps://www.dronestechlabs.com/\nFounding Year:\n2014\nFounder Details:\nBiswajit Dey & Ritesh Kanu\nFunding:\nUndisclosed Amount\nEndure Air Systems\nEndure Air Systems specializes in providing customized drone solutions for various applications, including logistics, border monitoring, and aerial mapping.\nC has already developed over 10 products with a strong focus on innovation and holds five patents in landing technology and vertical takeoff segments. The startup has partnered with several government agencies, including the Uttar Pradesh Police, DRDO, HAL, and NDRF, to provide cutting-edge drone technology for various projects.\nTheir drone is a unique design for logistics and delivery.\nIt has a compact biplane design, high speed, precision landing, and multi-redundant actuators. It doesnt need a runway, catapult, or parachute, making it highly flexible.\nWebsite Link:\nhttps://endureair.tech/\nFounding Year:\n2019\nFounder Details:\nDr. Abhishek, Rama Krishna, Chirag Jain, Dr. Mangal Kothari\nFunding:\nINR 13.5 Cr in funding to date, pulvinar dapibus leo.\nGaruda Aerospace\nGaruda Aerospaces successful drone startup in India & focuses on innovation and technology. The companys team of experts is constantly developing new and improved drone solutions for Agriculture, Disaster Management, Anti-Drone Systems, Delivery, and Traffic Monitoring.\nOne of its flagship offerings is the Kisan Agri drone, explicitly designed for agricultural use. With advanced sensors and cameras, this drone can capture high-quality images of crops and farmlands. The company ha",
          "annotations": null
        }
      ]
    },
    {
      "url": "https://inc42.com/startups/16-defence-tech-startups-fuelling-the-make-in-india-drive-in-defence/",
      "content": [
        {
          "type": "text",
          "text": "[visible] 16 Defence Tech Startups Fuelling The Make In India Drive\nSkip to content\nMEDIA\nDATALABS\nREPORTS\nEVENTS\nCOURSES\nINC42 COURSES\nD2CX\nD2CX by Inc42 is a 12-week hands-on program to help you level up your D2C game. Learn from India's top 1% D2C founders and experts through actionable insights, proven strategies and tactics on how to 10X your D2C brand.\nview\nManagementX\nManagementX by Inc42  Indias first Startup Management Program is a 6-month hands-on program that will take you on an intense journey that shatters the outdated employee mindset and equips you with the leader mindset.\nview\nD2CX Foundations\nD2CX Foundations by Inc42 is a 6 week hands-on program to help you launch your D2C brand successfully and profitably. Learn from Indias top 1% of D2C founders & experts through actionable insights, proven strategies and tactics on how to launch a successful D2C Brand in 6 weeks.\nview\nBRANDLABS\nABOUT\nThe D2C & Retail Summit 2025\nNEWS\nIN-DEPTH\nSTARTUPS\nNEWSLETTERS\nPODCAST\nINDUSTRY\nINDUSTRY\nStay ahead with the latest news, funding, startup financials, & governments policies on the hottest tech industries in the Indian startup ecosystem.\nFintech\nTravel Tech\nElectric Vehicle\nHealth Tech\nEdtech\nIT\nLogistics\nRetail\nEcommerce\nStartup Ecosystem\nEnterprise Tech\nClean Tech\nConsumer Internet\nAgritech\nMORE\nMORE ON INC42\nGet featured, partner or work with India's #1 startup media & intelligence platform and explore what else Inc42 has to offer.\nPARTNER WITH INC42\nStartup Spotlight\nGuest Posts\nAdvertise\nABOUT INC42\nAbout\nEthics\nCareers\nContact Us\nGLOSSARY\nRESOURCES\nLogin\nJOIN INC42 PLUS\nNEWS\nIN-DEPTH\nSTARTUPS\nNEWSLETTERS\nPODCAST\nINDUSTRY\nINDUSTRY\nStay ahead with the latest news, funding, startup financials, & governments policies on the hottest tech industries in the Indian startup ecosystem.\nFintech\nTravel Tech\nElectric Vehicle\nHealth Tech\nEdtech\nIT\nLogistics\nRetail\nEcommerce\nStartup Ecosystem\nEnterprise Tech\nClean Tech\nConsumer Internet\nAgritech\nMORE\nMORE ON INC42\nGet featured, partner or work with India's #1 startup media & intelligence platform and explore what else Inc42 has to offer.\nPARTNER WITH INC42\nStartup Spotlight\nGuest Posts\nAdvertise\nABOUT INC42\nAbout\nEthics\nCareers\nContact Us\nGLOSSARY\nRESOURCES\nSIGN IN\nJOIN INC42 PLUS NOW\nMEDIA\nDATALABS\nREPORTS\nEVENTS\nCOURSES\nINC42 COURSES\nD2CX\nD2CX by Inc42 is a 12-week hands-on program to help you level up your D2C game. Learn from India's top 1% D2C founders and experts through actionable insights, proven strategies and tactics on how to 10X your D2C brand.\nview\nManagementX\nManagementX by Inc42  Indias first Startup Management Program is a 6-month hands-on program that will take you on an intense journey that shatters the outdated employee mindset and equips you with the leader mindset.\nview\nD2CX Foundations\nD2CX Foundations by Inc42 is a 6 week hands-on program to help you launch your D2C brand successfully and profitably. Learn from Indias top 1% of D2C founders & experts through actionable insights, proven strategies and tactics on how to launch a successful D2C Brand in 6 weeks.\nview\nBRANDLABS\nABOUT\nThe D2C & Retail Summit 2025\nFOLLOW INC42\n16 Defence Tech Startups Fuelling The Make In India Drive In Defence\nSHARE\nShare on Facebook\nShare on Twitter\nShare on Whatsapp\nShare on LinkedIn\nShare on Email\nCopy Link\nShare story\n[mashshare networks=\"facebook,twitter,linkedin\" services=\"3\"]\nStartup Stories\n16 Defence Tech Startups Fuelling The Make In India Drive In Defence\n28 Jan'25\n| By\nTeam Inc42\n&\nAnanya Upadhyaya\nSUMMARY\nThe Indian defence tech sector has made unprecedented strides in areas like unmanned aerial vehicles, surveillance technologies, and AI-powered defence systems, supporting the nation's defence ambitions\nThe government's Make in India initiative has sparked a rise in homegrown startups within the defence sector, creating advanced solutions to strengthen military capabilities\nInc42 has compiled a list of startups working to strengthen national security, reduce import dependency, and equip the nation to tackle modern security challenges\nFOLLOW US\nFOLLOW US\nAdded to Saved Stories in Login\nVIEW SAVED STORIES\nIndia holds the title of the worlds largest importer of arms and reportedly accounted for a significant 9.8% of the total global arms imports between 2019 and 2023. Can homegrown defence tech startups change this dependency?\nThis overdependence on imports is known to be a strategic gap in the countrys defence procurement, and Indian startups are increasingly stepping up to the occasion to fill this chasm and cut the reliance on imports.\nAs the country eyes self-reliance in defence capabilities, a new wave of new-age tech companies is emerging to drive innovation in the military using technologies such as artificial intelligence (AI), unmanned systems, and advanced surveillance. And policy push has only catalysed this innovation in the defence tech space.\nInitiatives like\ndefence ministrys\niDEX (Innovations for Defence Excellence) and Technology Development Fund (TDF) are empowering defence startups by\noffering grants\nand collaboration avenues to cater to the militarys evolving needs.\nParallely, policy mandates such as the liberalisation of the foreign direct investment (FDI) regime, awarding contracts to local players and rising defence budget have catalysed partnerships between local ventures and international players.\nAs a result, homegrown defence tech startups are indigenously building cutting-edge technologies to cater to the booming local demand.\nOn the back of these developments, the burgeoning sector is not only reshaping the landscape of Indian innovation but is also attracting significant interest and investment.\nSuch has been the allure of the sector that former defence secretary Ajay Kumars\nINR 250 Cr VC fund\n, focussed on early stage startups in the defence, aerospace and deeptech sectors, marked its first close within days of its launch last year.\nNot just this, another defence tech startup\nBig Bang Boom raised $30 Mn in September last year\n, giving a major impetus to the homegrown defence sector.\nWhile India still has a long way to go before making a mark on the global defence landscape, we thought it would be prudent to collate a list of Indian defence tech startups laying the groundwork for just that.\nDefence Tech Startups Fuelling The Make In India Drive In Defence\nThe list below is not meant to be a ranking of any kind. The Indian defence tech startups have been listed in alphabetical order.\nAGNIT Semiconductors\nFounded In:\n2017\nFounders:\nDigbijoy Neelim Nath, Hareesh Chandrasekar, Madhusudan Atre, Mayank Shrivastava\nHeadquarters:\nBengaluru, India\nAGNIT designs and develops next-generation wireless transmitters for defence applications using GaN technology.\nIts technology supports radar systems, communication equipment, and electronic warfare applications, enhancing the capabilities of defence electronics.\nThe company is also targeting to expand to the consumer electronics and electric two-wheeler markets, to deepen its focus on addressing fast-charging needs to sell 1 Lakh chips this year.\nAGNIT Semiconductors secured $3.5 Mn (INR 29.4 Cr) in a seed funding round co-led by 3one4 Capital and Zephyr Peacock in October 2024.\nThe chipmaker claims to have raised $4.87 Mn (nearly INR 41 Cr) so far.\nAjnaLens\nFounded In:\n2014\nFounders:\nPankaj Raut, Abhishek Tomar, Abhijit Patil\nHeadquarters:\nMumbai, India\nAjnaLens provides mixed reality-based defence solutions, including head-mounted displays for training soldiers and tactical decision-making.\nIts solutions enhance situational awareness for troops through augmented and virtual reality, assisting in mission planning, simulation, and real-time information overlays in combat.\nAjnaLens is also upgrading Indias existing MANPAD (man-portable air-defence system) by providing operators with an enhanced vision to effectively engage the target, said the startup.\nIt has filed for more than 15 national and international patents in augmented reality and",
          "annotations": null
        }
      ]
    },
    {
      "url": "https://www.indiandefensenews.in/2025/01/25-major-defence-tech-start-ups.html",
      "content": [
        {
          "type": "text",
          "text": "[visible] 25 Major Defence Tech Start-Ups Spearheading Make In India Drive In The Defence Sector | Indian Defence News\nHome\nIndia\nAll Indian Defence News\nArmy\nAir Force\nNavy\nChief of Defence Staff\nAgnipath Scheme\nAid By India\nAksai Chin\nArtificial Intelligence\nAnti-Satellite Missile\nAnti-Terrorist Squad\nArticle 370-35A\nArmed Forces Surgical Strikes\nArmed Forces Welfare-OROP\nAero India 2023\nAccidents\nAcademia-Industry Partnership\nBilateral Relationship\nBallistic Defense\nBiological Warfare\nBhabha Atomic Research Centre\nBharat Dynamics Limited\nBIMSTEC\nBRICS\nBorder Issues: Kashmir And China\nCitizenship Amendment Act\nCentral Bureau of Investigation\nCivil Aviation\nCultural Diplomacy\nCoast Guard\nCommunication Related\nCyber Crime / Cyber Warfare\nCorruption\nCoronaVirus Pandemic\nCross Border Firing\nDefExpo News\nDefence Communication\nDefence Exports\nDefence Manufacturing\nDefence Acquisition\nDefence Partnership\nDefence Preparedness\nDefence Strategy\nDeep-Sea Submersible\nDirected Energy Weapons\nDigital India\nDoklam Standoff\nDRDO\nDrones\nEconomy\nEducation Sector\nEnergy Security\nElectronics Ecosystem\nEspionage\nEnforcement Directorate\nEnvironment Related Solutions\nElectric Mobility\nFake News\nFree Trade Agreement-Economy\nG20 Summit\nGlobal South Summit\nHigh Speed Rail Project-Bullet Train\nHealth Sector\nPak/China/B'desh Human Rights Issue\nIndian Mujahidden\nInformation Tech Sector\nInternational Solar Alliance\nSemi-Conductor Industry\nIndian Ocean Region\nForeign Policy\nHAL-ADA Related\nHi-Technology\nHumanitarian Aid\nHypersonic Missile\nIndia-Middle East-Eu Economic Corridor\nInfrastructure Related\nISRO\nISRO - Gaganyaan Mission\nISRO - Bharatiya Antariksha Station\nISRO - Chandrayaan Mission\nISRO - Aditya Mission\nISRO - Shukrayaan Mission\nSpace Start-Up Policy\nDefence Space Agency\nKhalistani Terrorism\nPrivate Space Industry\nMachine Learning\nMedia Related\nMissile Technology Control Regime\nMissile/Weapons Proliferation\nNavIC Constellation\nNaxal Terrorism\nNational Investigation Agency - NIA\nNational Security\nNationalist Socialist Council Nagaland\nNuclear Related\nNuclear Suppliers Group\nQuantum Computing\nSupercomputers\nQUAD - Quadrilateral Alliance\nOrdnance Factory Board\nPrivate Defence Industry\nRaisina Dialogue\nResearch And Development\nResearch & Analysis Wing - RAW\nRescue Operations\nSAARC\nSagar Mala Project\nStudents Islamic Movement-SIMI\nStart-Up Ecosystem\nSpecial Forces\nStrategic Relations\nStrategic Power\nEconomic Tariffs\nSupply Chain Management\nSpace Weapons\nTheatre Command\nTerrorism\nTrade And Commerce\nUnited Nations\nUN Convention On The Law of The Sea\nUnited Liberation Front of Assam\nWorld Bank\nWar & War Scenarios\nWorld Health Organisation\nNeighbours\nAfghanistan\nAl-Qaeda\nBangladesh\nBaluchistan\nChina\nPakistan-China Human Rights Atrocities\nHong Kong Crisis\nArunachal Pradhesh Chinese Claim\nComprehensive Economic Partnership Agreement\nChina-Pakistan Economic Corridor - CPEC\nChinese Border Incursions\nChinese Debt Trap\nChina National Space Administration\nEast Turkistan Islamic Movement\nGilgit-Baltistan\nFinancial Action Task Force [FATF]\nGenocide\nGazwat uL Hind\nHaqqani Network\nHizb-ul-Mujahideen\nIllegal Immigrants\nISI-Inter-Services Intelligence\nJaye Sindh Freedom Movement\nJaish-e-Mohammed\nJamaat-ud-Dawa\nJamaat-Ul Mujahideen Bangladesh\nMilitary Junta Related\nLashkar-e-Taiba\nMaldives\nMyanmar\nNarcotics Smuggling\nNepal\nOBOR\nPakistan\nPeople's Anti-Fascist Front\nPashtunistan Liberation Army\nPakistan Occupied Kashmir\nSri Lanka\nSeychelles\nTehrik-e Taliban Pakistan (TTP)\nTaliban\nTibet\nUyghur Separatists-China\nAllies\nUnited States\nFBI\nRussia\nIsrael\nBhutan\nIndia-America-Israel-UAE Quad\nN.S.America\nAmerican Sanctions\nArgentina\nBrazil\nBolivia\nCanada\nC I A\nCuba\nEcuador\nGuyana\nNATO Air Strikes\nNATO Related\nNASA\nBlue Origin Space\nSpaceX Technologies\nPanama\nPeru\nSuriname\nVenezuela\nAsia-Pacific\nAssociation of Southeast Asian Nations\nAUKUS Security Pact\nAustralia\nBelarus\nBrunei\nCambodia\nIndo-Pacific\nIndonesia\nJapan\nJAXA - Japanese Space Agency\nInvasion\nKazakhstan\nKyrgyzstan\nLatvia\nLithuania\nMalaysia\nMoldova\nNew Zealand\nMongolia\nNorth Korea\nPapua New Guinea\nPhilippines\nRCEP\nShanghai Cooperation Organisation\nSingapore\nSouth Korea\nSouth China Sea Dispute\nTaiwan\nTajikistan\nTurkmenistan\nUkraine\nUzbekistan\nVietnam\nMiddle-East-Africa\nAfrican Continent Related\nAbu Dhabi\nAlgeria\nAngola\nBahrain\nBoko Haram Terrorists\nBotswana\nAl-Qaeda\nCameroon\nDjibouti\nDubai\nEgypt\nGhana\nGulf Cooperation Council Countries\nHamas Terrorsts\nHouthi Terrorsts\nHezbollah Terrorists\nIran\nIraq\nISIS\nJordan\nKenya\nKuwait\nLebanon\nLibya\nMorocco\nMozambique\nNamibia\nNigeria\nPalestine\nQatar\nRed Sea Attacks\nSomalia\nSaudi Arabia\nSouth Africa\nSudan\nSyria\nAir Strikes\nTanzania\nTunisia\nUnited Arab Emirates\nYemen\nZimbabwe\nEurope\nArmenia\nAzerbaijan\nBulgaria\nCroatia\nCzech Republic\nDenmark\nEU\nEuropean Space Agency\nFrance\nFrench Space Agency\nFinland\nGermany\nHungary\nIceland\nINTERPOL\nItaly\nLuxembourg\nNetherlands\nNorway\nPoland\nRomania\nRoscosmos\nSlovakia\nSpain\nSwitzerland\nSweden\nTurkey\nUnited Kingdom\nIDN Take\nWrite for IDN\nAbout Us\nx\nTuesday, January 28, 2025\n25 Major Defence Tech Start-Ups Spearheading Make In India Drive In The Defence Sector\n25 Major Defence Tech Start-Ups Spearheading Make In India Drive In The Defence Sector\nTuesday, January 28, 2025\nby\nIndian Defence News\nThe Indian defence sector is witnessing a surge in innovation and self-reliance through a new wave of start-ups that are contributing significantly to the 'Make in India' initiative. This movement aims to reduce the country's reliance on imported defence technology and enhance indigenous capabilities. Here are 16 notable defence tech start-ups that are playing a crucial role in this transformation:\nList of Start-ups\n1. Aero360\nFocus: Drones for reconnaissance, surveillance, and delivery in military operations.\n2. AGNIT Semiconductors\nFounded: 2017\nHeadquarters: Bangalore\nSpecialization: Next-generation wireless transmitters for defence applications using GaN technology.\n3. Big Bang Boom\nFunding: Raised $30 million in September 2024, focusing on innovative defence solutions.\n4. Garuda Aerospace\nFocus: Drones and UAVs for agricultural and military applications.\n5. IdeaForge Technology\nSpecialisation: Unmanned aerial vehicles (UAVs) used for border security and military operations.\n6. NRT\nFocus: Advanced robotics and automation solutions for defence applications.\n7. Optimised Electrotech\nSpecialization: Innovative technologies for modern battlefield demands.\n8. Tonbo Imaging\nInnovation: High-resolution imaging systems for surveillance and targeting.\n9. Zen Technologies\nSpecialization: Simulation, training, and anti-drone technology to enhance military capabilities.\n10. Aarav Unmanned Systems\nFocus: Drone-based solutions for various applications including defence.\n11. Swaasa Technologies\nSpecialization: Advanced communication systems for military use.\n12. Defence Innovation Organisation (DIO) Start-ups\nVarious start-ups supported under the iDEX initiative focusing on indigenous technology development.\n13. High Energy Batteries (India) Limited\nEngaged in manufacturing batteries for defence applications.\n14. Constelli\nFounded In: 2017\nHeadquarters: Hyderabad\nConstelli specialises in developing digital signal processing solutions for the defence sector.\nThe defence-focused start-ups offers products including a drone-based telemetry receiver (for acquiring critical data from remote areas), a range of electronic warfare testing tools (to simulate realistic operational scenarios), and a radar target echo simulator, among others.\n16. Mahindra Defence Systems\nOffers a wide range of defence products including armoured vehicles and naval systems.\n17. EyeROV\nFounded In: 2016\nHeadquarters: Kochi, India\nEyeROV develops underwater drones (ROVs) used for naval inspections, mine detection, and underwater surveillance.\nIts remote-operated vehicles provide real-time underwater intelligence, aiding the operator in maritime operations and underwater inspections. It is currently used by DRDO and Indian coast guards.\nThe ma",
          "annotations": null
        }
      ]
    }
  ]
}