{
  "directed": true,
  "multigraph": false,
  "graph": {
    "session_id": "52843058",
    "original_query": "I want to know the details of features for Mahindra XUV 3XO, use a single step for Retriever Agent but use multiple iterations in a single step to fetch detailed information, In the final iteration of the Retriever Agent combine outputs from previous iterations as final step output and then create a report.",
    "file_manifest": [],
    "created_at": "2025-07-18T12:50:58.854870",
    "status": "running",
    "output_chain": {
      "T001": {
        "iterations": [
          {
            "iteration": 1,
            "output": {
              "engine": [
                {
                  "type": "text",
                  "text": "[{'url': 'https://www.cardekho.com/mahindra/xuv-3xo/specs', 'content': \"Mahindra XUV 3XO Specifications - Dimensions, Configurations, Features, Engine cc All New Used Ad English Login / Register NEW CARS Explore New Cars Electric Cars Mahindra BE 6 Mahindra XEV 9e Tata Harrier EV MG Windsor EV Tesla Model Y Tata Nexon EV All Electric Cars Popular Cars Hyundai Creta Defender Mahindra XUV 3XO Mahindra Thar ROXX Mahindra Scorpio Tata Nexon All Popular Cars Upcoming Cars New Launches Car Insurance Ad Popular Brands Maruti Cars Tata Cars Kia Cars Toyota Cars Hyundai Cars Mahindra Cars Compare Cars New Car Offers & Discounts Find Car Dealers Find EV Charging Stations Find Fuel Stations Check Fuel Prices Used cars Buy Used Cars Used Cars In Your City Ahmedabad Bangalore Chennai Delhi NCR Hyderabad Jaipur Kolkata Mumbai Pune More Cities Sell My Car Used Car Valuation Dealership Near Me News & Reviews News & Top stories Car Expert Reviews User Reviews Car Collection Tips & Advice Videos Video Reviews Visual Stories Select City Ad XUV 3XO Price Compare Offers Images Specs User Reviews 360 View Variants More Videos Mileage Colours XUV 3XO News FAQs Dealers Service Center Brochure XUV 3XO EMI Loan Second Hand XUV 3XO Mahindra XUV 3XO Specifications The Mahindra XUV 3XO has 1 Diesel Engine and 1 Petrol Engine on offer. The Diesel engine is 1498 cc while the Petrol engine is 1197 cc . It is available with Manual & Automatic transmission.Depending upon the variant and fuel type the XUV 3XO has a mileage of 17.96 to 20.6 kmpl. The XUV 3XO is a 5 seater 3 cylinder car and has length of 3990 mm, width of 1821 mm and a wheelbase of 2600. Read More 4.6 303 Reviews Shortlist Rs. 7.99 - 15.80 Lakh * EMI starts @ 21,545 View July Offers Ad Standout features of Mahindra XUV 3XO Soft touch material on dashboard and door pads. Panoramic sunroof - largest in the segment. Level 2 ADAS with features such as forward collision warning, adaptive cruise control. 1.2-litre turbo-petrol engine makes 130PS/230Nm most powerful in its class. Key specifications of Mahindra XUV 3XO ARAI Mileage 18.2 kmpl Fuel Type Petrol Engine Displacement 1197 cc No. of Cylinders 3 Max Power 128.73bhp@5000rpm Max Torque 230Nm@1500-3750rpm Seating Capacity 5 Transmission Type Automatic Boot Space 364 Litres Fuel Tank Capacity 42 Litres Body Type SUV Key features of Mahindra XUV 3XO Power Steering Yes Power Windows Front Yes Anti-lock Braking System (ABS) Yes Air Conditioner Yes Driver Airbag Yes Passenger Airbag Yes Automatic Climate Control Yes Alloy Wheels Yes Multi-function Steering Wheel Yes Mahindra XUV 3XO specifications Engine & Transmission Engine Type mStallion (TGDi) engine Displacement 1197 cc Max Power 128.73bhp@5000rpm Max Torque 230Nm@1500-3750rpm No. of Cylinders 3 Valves Per Cylinder 4 Turbo Charger Yes Transmission Type Automatic Gearbox 6-Speed AT Drive Type FWD Report Incorrect Specs Don't miss out on the best offers for this Month View July Offers Fuel & Performance Fuel Type Petrol Petrol Mileage ARAI 18.2 kmpl Petrol Fuel Tank Capacity 42 Litres Emission Norm Compliance BS VI 2.0 Report Incorrect Specs Suspension, Steering & Brakes Front Suspension MacPherson Strut suspension Rear Suspension Rear twist beam Steering Type Electric Turning Radius 5.3 m Front Brake Type Disc Rear Brake Type Disc Alloy Wheel Size Front 17 Inch Alloy Wheel Size Rear 17 Inch Report Incorrect Specs Don't miss out on the best offers for this Month View July Offers Dimensions & Capacity Length 3990 mm Width 1821 mm Height 1647 mm Boot Space 364 Litres Seating Capacity 5 Wheel Base 2600 mm No. of Doors 5 Report Incorrect Specs Don't miss out on the best offers for this Month View July Offers Comfort & Convenience Power Steering Air Conditioner Heater Height Adjustable Driver Seat Ventilated Seats Electric Adjustable Seats Automatic Climate Control Accessory Power Outlet Rear Reading Lamp Adjustable Headrest Rear Seat Centre Arm Rest Height Adjustable Front Seat Belts Rear AC Vents Cruise Control Parking Sensors Front & Rear Real-Time Vehicle Tracking\", 'images': [{'url': 'https://stimg.cardekho.com/images/carexteriorimages/630x420/Mahindra/XUV-3XO/10184/1751288551835/front-left-side-47.jpg?tr=w-230', 'alt_text': 'Mahindra XUV 3XO Specifications', 'title': 'Mahindra XUV 3XO Specifications', 'width': '230', 'height': '153', 'loading': 'eager', 'confidence': 0.9999999999999999}, {'url': 'https://stimg.cardekho.com/pwa/img/spacer3x2.png', 'alt_text': 'Mahindra XUV 3XO Soft touch material on dashboard and door pads.', 'title': 'XUV 3XO Soft touch material on dashboard and door pads.', 'height': '175', 'class': 'imageTransition', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://stimg.cardekho.com/pwa/img/spacer3x2.png', 'alt_text': 'Mahindra XUV 3XO Panoramic sunroof - largest in the segment.', 'title': 'XUV 3XO Panoramic sunroof - largest in the segment.', 'height': '175', 'class': 'imageTransition', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://stimg.cardekho.com/pwa/img/spacer3x2.png', 'alt_text': 'Mahindra XUV 3XO Level 2 ADAS with features such as forward collision warning, adaptive cruise control.', 'title': 'XUV 3XO Level 2 ADAS with features such as forward collision warning, adaptive cruise control.', 'height': '175', 'class': 'imageTransition', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://stimg.cardekho.com/pwa/img/spacer3x2.png', 'alt_text': 'Mahindra XUV 3XO \\u20601.2-litre turbo-petrol engine makes 130PS/230Nm — most powerful in its class.', 'title': 'XUV 3XO \\u20601.2-litre turbo-petrol engine makes 130PS/230Nm — most powerful in its class.', 'height': '175', 'class': 'imageTransition', 'loading': 'lazy', 'confidence': 0.7999999999999999}], 'rank': 1}, {'url': 'https://auto.mahindra.com/suv/xuv3xo/X3XO.html', 'content': \"Mahindra XUV 3XO - Price, Specifications, Colors & Images Skip to main content Skip to footer content SUVs THAR ROXX 12.99L - 23.39L Book Now Book Now Explore Explore XUV 3XO 7.99L - 15.79L Book Now Book Now Explore Explore SCORPIO-N 13.99L - 25.62L Book Now Book Now Explore Explore XUV700 14.49L - 25.14L Book Now Book Now Explore Explore THAR 11.50L - 17.62L Book Now Book Now Explore Explore SCORPIO CLASSIC 13.77L - 17.72L Book Now Book Now Explore Explore BOLERO NEO 9.97L - 12.18L Book Now Book Now Explore Explore BOLERO NEO PLUS 11.41L - 14.06L Explore Explore BOLERO 9.81L - 10.93L Book Now Book Now Explore Explore XUV400 17.49L Book Now Book Now Explore Explore MARAZZO 14.59L - 17.00L Book Now Book Now Explore Explore Explore All SUVs Explore All SUVs News Contact Us Menu Build your car Test Drive Buy Buy Book Now Exchange Finance Subscribe a Vehicle Owner's Zone Owner's Zone Owner's Action Owner's Action My Dashboard Service Cost Calculator Locate Service Center Renewals Renewals Roadside Assistance Owner's Manual Care & Maintenance Important Notifications Important Notifications Service Action Adventure Adventure Club Events Expeditions Off-Road Academy Gallery Locate a Dealer Global Markets Language News Contact us Switch theme Dark Light Home XUV 3XO Know More Know More Show more Show less Show more Show less Everything you want & more Book now Book now Show more Show less Register for the latest news and exclusive updates. Stay informed Stay informed For any assistance call us on 1800 209 6006 1800 209 6006 Social links SUVs SUVs Explore All SUVs Thar Roxx Scorpio-N XUV700 XUV 3XO Thar XUV 400 Scorpio Classic Bolero Neo Bolero Bolero Neo Plus Marazzo PIK-UPs PIK-UPs Veero Maxx City Maxx HD Bolero Pik-up Bolero Camper ABOUT ABOUT About us Press Releases Stories Media kit Careers QMS Certificate OWNER OWNER Service Adventure Merchandise & Gear - Eshop Parts and accessories- Eshop Care & Maintenance Owners manual QMS Certificate customer service customer service Contact us FAQs Talk to an expert Dealer Locator Corporate Sales Enquiry Sitemap Sitemap QMS Certificate quick links quick links Vehicle configurator Test Drive Book Online Calculators Exchange Finance Scrappage Subscribe a vehicle Become a Dealer Download the M4U app now! Lets connect on Whatsapp Chat now Chat now Mahindra Corporate Terms & Conditions Our Privacy Policy Copyright 2025 Mahindra & Mahindra Ltd\", 'images': [{'url': 'https://auto.mahindra.com/dw/image/v2/BKRC_PRD/on/demandware.static/-/Sites-mahindra-product-catalog/default/dw95797f68/images/SCRC/large/ScorpioClassic_602x339.png?sw=360&sh=202', 'alt_text': 'SCORPIO CLASSIC', 'class': 'd-block img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://auto.mahindra.com/dw/image/v2/BKRC_PRD/on/demandware.static/-/Sites-mahindra-product-catalog/default/dwc6625064/images/NEOP/large/BoleroNeoPlus_602x339.png?sw=360&sh=202', 'alt_text': 'BOLERO NEO PLUS', 'class': 'd-block img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://auto.mahindra.com/on/demandware.static/Sites-amc-Site/-/default/dwbe1329bd/images/placeholder-image.png', 'alt_text': 'XUO 3XO REVX', 'width': '1400px', 'height': '700px', 'class': 'ITC-image image-fluid common-image-component flexi-height', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://auto.mahindra.com/on/demandware.static/Sites-amc-Site/-/default/dwbe1329bd/images/placeholder-image.png', 'alt_text': 'XUV 3XO Earn 5-Star Bharat-NCAP Rating', 'width': '1400px', 'height': '700px', 'class': 'ITC-image image-fluid common-image-component flexi-height', 'loading': 'lazy', 'confidence': 0.7}], 'rank': 2}, {'url': 'https://www.v3cars.com/mahindra-cars/xuv-3xo/engine-specifications', 'content': \"Mahindra XUV 3XO Specifications - Engine CC, Power, Weight & Configurations Bengaluru Login/Signup New Cars Upcoming Cars Popular Cars Latest Cars Electric Cars News Latest News Auto Expo Press Release Variant Explained Videos Review Videos Compare Videos Variants Explained Videos More Videos Auto Expo Videos V3Cars YouTube Channel Reviews Expert Review Comparison Review Features Explained Car Guide User Review More Car Loan EMI Calculator Fuel Cost Calculator Buy / Renew Car Insurance Fuel Price in India Apply for Car Loan Mileage Calculator Car On-Road Price Sell Used Car Buy Used Cars bengaluru Login to V3Cars Sign Up to V3Cars This is\\r               necessary to personalise results for you Continue with Google Continue with Facebook or Login\\r                       with OTP Don't have\\r                         an account? Sign Up NAME EMAIL MOBILE Sign Up Already have\\r                         an account? Login OTP has been sent to Resend OTP Submit OTP Select City We need your city to customize your experience Select City V3Cars Mahindra 3XO Engine Specification Overview Price Dimensions Specifications 1.2 Turbo Petrol Manual 1.2 Turbo Petrol Automatic 1.5 Diesel Manual 1.5 Diesel Automatic 1.2 Turbo Petrol Manual (131PS) 1.2 Turbo Petrol Automatic (131PS) Mileage Variants Videos Reviews Others Comparison News &\\r                     Top Stories Monthly\\r                     Sales Images Competitiors Service Cost Brochure Colours Pros & Cons FAQs Offers Discounts CSD Price Mahindra 3XO Configurations The Mahindra 3XO is available with multiple engine options: a 1.2L turbo petrol, a 1.2L turbo petrol (131PS) and a 1.5L turbo diesel. 3XO's 1.2L turbo petrol engine is available with a 6-speed MT Manual and a 6-speed TC Automatic transmission that makes 111PS of power at 5000rpm and 200Nm of torque between 1500rpm and 3750rpm. 3XO's 1.2L turbo petrol (131PS) engine gets a 6-speed MT Manual and a 6-speed TC Automatic transmission which churns out 131PS of power at 5000rpm and 230Nm of torque between 1500rpm and 3750rpm. 3XO's 1.5L turbo diesel engine gets a 6-speed MT Manual and a 6-speed AMT Automatic transmission which is rated to deliver 117PS of power at 3750rpm and 300Nm of torque between 1500rpm and 2500rpm. The 3XO is available with following engine-transmission configurations: 1.2L Turbo Petrol with 6-speed MT (7 variants) 1.2L Turbo Petrol with 6-speed TC (4 variants) 1.5L Turbo Diesel with 6-speed MT (7 variants) 1.5L Turbo Diesel with 6-speed AMT (3 variants) 1.2L Turbo Petrol with 6-speed MT (4 variants) 1.2L Turbo Petrol with 6-speed TC (4 variants) Understanding its engine is key! Get all the facts on 2025 Mahindra XUV 3XO's displacement, cylinder, power, torque, mileage and transmission configurations. Additionally, we'll break down the various configurations available with this engine to help you find the XUV 3XO that best suits your needs. Mahindra 3XO Engine Specifications 1.2 Turbo Petrol Manual 1.2 Turbo Petrol Automatic 1.5 Diesel Manual 1.5 Diesel Automatic 1.2 Turbo Petrol Manual (131PS) 1.2 Turbo Petrol Automatic (131PS) Engine Type Turbo Engine Displacement 1.2L Cubic capacity (CC) 1197cc Cylinders 3 Max Power 111PS @ 5000rpm Max Torque 200Nm @ 1500 - 3750rpm Kerb Weight 1350Kg Power:Weight 82.22PS/tonne Torque:Weight 148.15Nm/tonne Gearbox Manual Transmission 6-speed MT Drivetrain FWD Fuel Tank Capacity 42L Claimed Milage (ARAI) 18.89kmpl Real World Milage Click here to check! Find the exact dimensions of Mahindra 3XO in feet, inches, centimeters, and millimeters! Click Here To Explore All The Details Engine Type Turbo Engine Displacement 1.2L Cubic capacity (CC) 1197cc Cylinders 3 Max Power 111PS @ 5000rpm Max Torque 200Nm @ 1500 - 3750rpm Kerb Weight 1350Kg Power:Weight 82.22PS/tonne Torque:Weight 148.15Nm/tonne Gearbox Automatic Transmission 6-speed TC Drivetrain FWD F\", 'images': [{'url': 'https://www.v3cars.com/media/content/370326mahindra-xuv3xo-diesel-variants-explained.webp', 'alt_text': '2024 Mahindra XUV3XO', 'width': '800', 'height': '500', 'confidence': 0.9999999999999999}, {'url': 'https://www.v3cars.com/media/content/982311mahindra-xuv3xo-petrol-variants-explained.webp', 'alt_text': 'Mahindra XUV 3XO', 'width': '800', 'height': '500', 'confidence': 0.9999999999999999}, {'url': 'https://www.v3cars.com/media/content/909191mahindra-xuv-3xo-ground-clearance-boot-space-dimensions.webp', 'alt_text': 'Mahindra XUV 3XO', 'width': '800', 'height': '500', 'loading': 'lazy', 'confidence': 0.9999999999999999}, {'url': 'https://www.v3cars.com/media/videoImages/024741Tata-Nexon-Pure-Plus-S-Vs-Mahindra-XUV-3XO-MX3-Pro.webp', 'alt_text': 'video image', 'width': '800', 'height': '500', 'loading': 'lazy', 'confidence': 0.9999999999999999}, {'url': 'https://www.v3cars.com/media/videoImages/044965Syros-HTK-Vs-XUV-3XO-MX3-Pro.webp', 'alt_text': 'video image', 'width': '800', 'height': '500', 'loading': 'lazy', 'confidence': 0.9999999999999999}], 'rank': 3}, {'url': 'https://www.carfolio.in/mahindra/xuv-3xo/specs', 'content': 'XUV 3XO Specifications | Engine, Dimensions, & Features New Delhi Home Cars Maruti Cars Hyundai Cars News Contact Us XUV 3XO Price Images Specs Variants Mileage Colors XUV 3XO 4.4 1250 Reviews Rs. 7.79 - 15.49 Lakh On Road Price Ex-Showroom price, New Delhi Change City View Offers Key Specifications of XUV 3XO Power 109.96 - 128.73 bhp Torque 200 - 300 Nm Seating Capacity 5 Transmission Automatic / Manual Fuel Petrol / Diesel Global NCAP Safety Rating Star Engine 1197 - 1498 cc Mileage Petrol: 17.96 - 20.10 km/l Key Features of XUV 3XO Automatic Climate Control Cruise Control Height Adjustable Driver Seat Parking Sensors Rear AC Vents Sunroof Detailed Specifications of XUV 3XO AX5 Diesel AMT MX3 Diesel AMT AX5 L Turbo MX2 diesel AX7 L Turbo MX3 Diesel AX5 MX2 Pro Diesel MX3 Pro Diesel MX3 Pro AT Comfort & Convenience Interior Exterior Safety Entertainment & Communication ADAS Feature Advance Internet Feature Engine & Transmission Fuel & Performance Suspension, Steering & Brakes Dimensions & Capacity Power Steering Air Conditioner Heater Height Adjustable Driver Seat Ventilated Seats Not Available Electric Adjustable Seats Not Available Automatic Climate Control Accessory Power Outlet Rear Reading Lamp Adjustable Headrest Rear Seat Centre Arm Rest Height Adjustable Front Seat Belts Rear AC Vents Cruise Control Parking Sensors Rear Real-Time Vehicle Tracking Foldable Rear Seat 60:40 Split KeyLess Entry Engine Start/Stop Button Cooled Glovebox Not Available Paddle Shifters Not Available USB Charger Front &amp; Rear Central Console Armrest With Storage Hands-Free Tailgate Not Available Rear Curtain Not Available Glove Box light Not Available Idle Start-Stop System Rear Window Sunblind No Rear Windscreen Sunblind No Automatic Headlamps Follow Me Home Headlamps Power Windows Front &amp; Rear Cup Holders Front &amp; Rear Additional Features Smart Steering Modes, Auto Wiper XUV 3XO Brochure Download the brochure for detailed information on specs, features, and prices. Download Brochure Want to explore more about XUV 3XO? Before you make any final decision, explore more about this car: Variants Mileage Colors Specs Price Images Related search Recently Updated Mahindra Scorpio Mahindra Bolero Camper Mahindra BOLERO PikUP ExtraStrong View 12 More Popular Cars Mahindra XUV 3XO Mahindra Scorpio N Mahindra Scorpio View 4 More Electric Cars Mahindra XUV400 EV Mahindra BE 6 Mahindra XEV 9e Petrol Cars Mahindra XUV 3XO Mahindra XUV700 Mahindra Thar ROXX View 2 More Terms & Conditions Privacy Policy Contact Us Sitemap', 'images': [], 'rank': 4}, {'url': 'https://ackodrive.com/cars/mahindra-xuv-3xo/specifications/', 'content': 'Mahindra XUV 3XO Specifications - Features, Configuration & More Delhi Overview Mileage Specs and Features Colours Dimensions Variants Images FAQs Mahindra XUV 3XO Specifications Mahindra XUV 3XO SUV 1197 cc,1497 cc 5 Seater 2024,2025 On-road price in Delhi 9.46 L - 18.49 L The Mahindra XUV 3XO has Diesel,Petrol engine option. It has a 1197,1497 cc engine. Transmission options include a Automatic,Manual gearbox. The SUV delivers a mileage in the range of 18.06 km/l to 21.20 km/l.It comes with a 5-seater seating capacity. Standout features of Mahindra XUV 3XO Dashboard Instrument Console/Cluster Infotainment System Gear Lever Sunroof Seats 1 / 6 Key specifications 2024 2025 model 5 Seater SUV Transmission Automatic Manual Engine | Power 1197 cc - 1497 cc 109 bhp - 128 bhp Fuel Diesel Petrol Fuel Tank Capacity 42 Litres Mileage 18.06 - 21.20 kmpl Key features First-in-Segment Dual Zone Climate Control First-in-Segment Electronic Parking Brake with Auto Hold Largest in Segment Skyroof Harman Kardon Audio System with 7 Speaker Twin HD Infotainment & Fully Digital Cluster Infinity Tail Lamps 6 Airbags All specifications 1.2 AX7 TGDi Switch variants Specifications Petrol 1199 Manual SUV 2025 5 Seater More details Mileage 20.09 Km/l Engine 1199 cc Max Power 87@6000 Max Torque 115@3250 Gear Box 5 Speed Power Steering Type Electric Wheel Type Steel Rims with Center Caps Boot 366 Ltrs Power Windows Front Length 3827 mm Width 1742 mm height 1615 mm View less Features Comfort Audio System No Inbuilt Audio System Fm Radio No Bluetooth No Usb Compatibility No Ipod Connectivity No Aux In Compatibility No Infotainment Screen Yes Infotainment Screen Type No Touch Sensitive Cup Holders Count 2 Keyless Entry Yes Keyless Entry Type Remote Navigation System No Ventilation System Yes Ventilation System Type Manual Air conditioning with cooling and heating Rain Sensing Wipers No Automatic Headlamps No Boot Lid Opener Manual Fuel Lid Opener Internal Cruise Control No Cigaratte Lighter No Second Row Ac Vent No Third Row Ac Vent No Adjustable Head Rests Yes Adjustable Head Rest Type Front Row Cooling Glove Box No Paddle Shifters No Interior Power Windows Front Power Steering Yes Power Steering Type Electric Instrument Console Analog Multifunctional Display Yes Adjustable Steering Yes Seating Capacity 5 Seater Power Seats No Power Seat Type General Power Seat Seat Material Fabric Heat Cold Seats No Heat Cold Seat Type Front Seats Seat Height Adjustment Manual Start Stop Button No Rear Center Armrest No Rear Center Armrest Type Cup Holders Clock Yes Clock Type Digital Safety Airbag Yes No Of Airbags 2 Airbag Count D2 Engine Immobilizer Yes Traction Control No Parking Assistance No Child Safety Lock No Door Alarm Warning Yes Central Locking Yes Anti Lock Breaking System Yes Electronic Breakforce Distribution Yes Electronic Stability Program No Electronic Break Assist No Exterior Sunroof No Rear Spoiler Yes Headlights Halogen Front Fog Lights No Tinted Windows No Roof Rails No Rear Wiper No Rear Defogger No Wheels Steel Rims with Center Caps Body SUV Body Color Bumber Yes Adjustable Orvm Internally Foldable Orvm Internally Headlight Washer No Rear Fog Light No Skid Plate No Day Running Lamps No Engine Cylinders Count 0 Valves Per Cylinder 0 Displacement 1199 Max Power Bhp 87 Max Power Rpm 6000 Max Torque Bhp 115 Max Torque Rpm 3250 Turbo Charger No Engine Location Front Fuel System Manual Emission BS6 Emission Norm Automatic Fuel Type Petrol City Mileage 0.00 Highway Mileage 0.00 Arai Mileage 20.09 Dimensions Length 3827 Width 1742 Height 1615 Wheel Base 2445 Ground Clearance 187 Boot Space 366 Fuel Tank Capacity 37 Alt Fuel Tank Capacity 0 Instrumentation Tachometer Analog Odometer Digital Fuel Consumption Average Yes Gear Indicator No Gear Shift Reminder No Distance To Empty Yes Fuel Gauge Digital Engine Malfunction Light Yes Speedometer Digital Key Off Reminder Yes Tyre Pressure Monitoring No Headlight Reminder Yes Low Fuel Warning Yes Fasten Seatbel', 'images': [{'url': 'https://ackodrive.ackoassets.com/next_assets/5fb208d6de0a2bf5ddbd410b73762de9cc636036/_next/static/images/HeroCardBGMobile-6e1ebde5e35595333643880c4a9e7d50.png', 'alt_text': 'HeroCardBG', 'class': 'HeroCard__HeroCardBGWrapper-sc-3efab0dc-2 iOuqAL', 'confidence': 0.7}, {'url': 'https://ackodrive.com/_next/image/?url=https%3A%2F%2Fackodrive-assets.ackodrive.com%2Fmedia%2Ftest_mUga1JU.png&w=640&q=75', 'alt_text': 'Mahindra XUV 3XO CarImage', 'loading': 'lazy', 'confidence': 0.7}, {'url': 'https://ackodrive-assets.ackodrive.com/media/test_gEtupzS.png', 'alt_text': 'Standout features of Mahindra XUV 3XO Dashboard', 'class': 'CarouselWrapper__CarImage-sc-20236eb1-12 cmjgqs', 'confidence': 0.7}, {'url': 'https://ackodrive-assets.ackodrive.com/media/test_NZRtdHh.png', 'alt_text': 'Standout features of Mahindra XUV 3XO Instrument Console/Cluster', 'class': 'CarouselWrapper__CarImage-sc-20236eb1-12 cmjgqs', 'confidence': 0.7}, {'url': 'https://ackodrive-assets.ackodrive.com/media/test_1LCeg1x.png', 'alt_text': 'Standout features of Mahindra XUV 3XO Infotainment System', 'class': 'CarouselWrapper__CarImage-sc-20236eb1-12 cmjgqs', 'confidence': 0.7}], 'rank': 5}]",
                  "annotations": null
                }
              ]
            }
          }
        ],
        "final_output": null,
        "iteration_count": 1
      }
    },
    "validation_results": {
      "is_valid": true,
      "is_dag": true,
      "cycles": [],
      "disconnected_components": [],
      "orphaned_nodes": [],
      "root_nodes": [],
      "leaf_nodes": [
        "T002"
      ],
      "warnings": [],
      "errors": []
    }
  },
  "nodes": [
    {
      "description": "Initial Query",
      "agent": "System",
      "status": "completed",
      "id": "ROOT"
    },
    {
      "id": "T001",
      "description": "Fetch detailed features of Mahindra XUV 3XO using multiple iterations within a single RetrieverAgent step, combining the outputs from previous iterations in the final iteration.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Fetch detailed information on features of Mahindra XUV 3XO. Use multiple iterations to gather information. In the final iteration, combine the outputs from all previous iterations as the final output. Specify the number of iterations for gathering details. Ensure all aspects of the features are covered in detail like Engine, Safety, Comfort, Interior, Exterior, Technology, and Infotainment. The final combined output must contain all of these details exhaustively.",
      "reads": [],
      "writes": [
        "T001"
      ],
      "status": "failed",
      "output": null,
      "error": "'output'",
      "cost": 0.0,
      "start_time": "2025-07-18T12:50:58.863863",
      "end_time": "2025-07-18T12:51:52.574337",
      "execution_time": 53.710474,
      "execution_result": {
        "status": "success",
        "session_id": "52843058",
        "operations": [
          "python_code"
        ],
        "created_files": [],
        "file_results": {},
        "code_results": {
          "status": "success",
          "result": {
            "engine": [
              {
                "type": "text",
                "text": "[{'url': 'https://www.cardekho.com/mahindra/xuv-3xo/specs', 'content': \"Mahindra XUV 3XO Specifications - Dimensions, Configurations, Features, Engine cc All New Used Ad English Login / Register NEW CARS Explore New Cars Electric Cars Mahindra BE 6 Mahindra XEV 9e Tata Harrier EV MG Windsor EV Tesla Model Y Tata Nexon EV All Electric Cars Popular Cars Hyundai Creta Defender Mahindra XUV 3XO Mahindra Thar ROXX Mahindra Scorpio Tata Nexon All Popular Cars Upcoming Cars New Launches Car Insurance Ad Popular Brands Maruti Cars Tata Cars Kia Cars Toyota Cars Hyundai Cars Mahindra Cars Compare Cars New Car Offers & Discounts Find Car Dealers Find EV Charging Stations Find Fuel Stations Check Fuel Prices Used cars Buy Used Cars Used Cars In Your City Ahmedabad Bangalore Chennai Delhi NCR Hyderabad Jaipur Kolkata Mumbai Pune More Cities Sell My Car Used Car Valuation Dealership Near Me News & Reviews News & Top stories Car Expert Reviews User Reviews Car Collection Tips & Advice Videos Video Reviews Visual Stories Select City Ad XUV 3XO Price Compare Offers Images Specs User Reviews 360 View Variants More Videos Mileage Colours XUV 3XO News FAQs Dealers Service Center Brochure XUV 3XO EMI Loan Second Hand XUV 3XO Mahindra XUV 3XO Specifications The Mahindra XUV 3XO has 1 Diesel Engine and 1 Petrol Engine on offer. The Diesel engine is 1498 cc while the Petrol engine is 1197 cc . It is available with Manual & Automatic transmission.Depending upon the variant and fuel type the XUV 3XO has a mileage of 17.96 to 20.6 kmpl. The XUV 3XO is a 5 seater 3 cylinder car and has length of 3990 mm, width of 1821 mm and a wheelbase of 2600. Read More 4.6 303 Reviews Shortlist Rs. 7.99 - 15.80 Lakh * EMI starts @ 21,545 View July Offers Ad Standout features of Mahindra XUV 3XO Soft touch material on dashboard and door pads. Panoramic sunroof - largest in the segment. Level 2 ADAS with features such as forward collision warning, adaptive cruise control. 1.2-litre turbo-petrol engine makes 130PS/230Nm most powerful in its class. Key specifications of Mahindra XUV 3XO ARAI Mileage 18.2 kmpl Fuel Type Petrol Engine Displacement 1197 cc No. of Cylinders 3 Max Power 128.73bhp@5000rpm Max Torque 230Nm@1500-3750rpm Seating Capacity 5 Transmission Type Automatic Boot Space 364 Litres Fuel Tank Capacity 42 Litres Body Type SUV Key features of Mahindra XUV 3XO Power Steering Yes Power Windows Front Yes Anti-lock Braking System (ABS) Yes Air Conditioner Yes Driver Airbag Yes Passenger Airbag Yes Automatic Climate Control Yes Alloy Wheels Yes Multi-function Steering Wheel Yes Mahindra XUV 3XO specifications Engine & Transmission Engine Type mStallion (TGDi) engine Displacement 1197 cc Max Power 128.73bhp@5000rpm Max Torque 230Nm@1500-3750rpm No. of Cylinders 3 Valves Per Cylinder 4 Turbo Charger Yes Transmission Type Automatic Gearbox 6-Speed AT Drive Type FWD Report Incorrect Specs Don't miss out on the best offers for this Month View July Offers Fuel & Performance Fuel Type Petrol Petrol Mileage ARAI 18.2 kmpl Petrol Fuel Tank Capacity 42 Litres Emission Norm Compliance BS VI 2.0 Report Incorrect Specs Suspension, Steering & Brakes Front Suspension MacPherson Strut suspension Rear Suspension Rear twist beam Steering Type Electric Turning Radius 5.3 m Front Brake Type Disc Rear Brake Type Disc Alloy Wheel Size Front 17 Inch Alloy Wheel Size Rear 17 Inch Report Incorrect Specs Don't miss out on the best offers for this Month View July Offers Dimensions & Capacity Length 3990 mm Width 1821 mm Height 1647 mm Boot Space 364 Litres Seating Capacity 5 Wheel Base 2600 mm No. of Doors 5 Report Incorrect Specs Don't miss out on the best offers for this Month View July Offers Comfort & Convenience Power Steering Air Conditioner Heater Height Adjustable Driver Seat Ventilated Seats Electric Adjustable Seats Automatic Climate Control Accessory Power Outlet Rear Reading Lamp Adjustable Headrest Rear Seat Centre Arm Rest Height Adjustable Front Seat Belts Rear AC Vents Cruise Control Parking Sensors Front & Rear Real-Time Vehicle Tracking\", 'images': [{'url': 'https://stimg.cardekho.com/images/carexteriorimages/630x420/Mahindra/XUV-3XO/10184/1751288551835/front-left-side-47.jpg?tr=w-230', 'alt_text': 'Mahindra XUV 3XO Specifications', 'title': 'Mahindra XUV 3XO Specifications', 'width': '230', 'height': '153', 'loading': 'eager', 'confidence': 0.9999999999999999}, {'url': 'https://stimg.cardekho.com/pwa/img/spacer3x2.png', 'alt_text': 'Mahindra XUV 3XO Soft touch material on dashboard and door pads.', 'title': 'XUV 3XO Soft touch material on dashboard and door pads.', 'height': '175', 'class': 'imageTransition', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://stimg.cardekho.com/pwa/img/spacer3x2.png', 'alt_text': 'Mahindra XUV 3XO Panoramic sunroof - largest in the segment.', 'title': 'XUV 3XO Panoramic sunroof - largest in the segment.', 'height': '175', 'class': 'imageTransition', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://stimg.cardekho.com/pwa/img/spacer3x2.png', 'alt_text': 'Mahindra XUV 3XO Level 2 ADAS with features such as forward collision warning, adaptive cruise control.', 'title': 'XUV 3XO Level 2 ADAS with features such as forward collision warning, adaptive cruise control.', 'height': '175', 'class': 'imageTransition', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://stimg.cardekho.com/pwa/img/spacer3x2.png', 'alt_text': 'Mahindra XUV 3XO \\u20601.2-litre turbo-petrol engine makes 130PS/230Nm — most powerful in its class.', 'title': 'XUV 3XO \\u20601.2-litre turbo-petrol engine makes 130PS/230Nm — most powerful in its class.', 'height': '175', 'class': 'imageTransition', 'loading': 'lazy', 'confidence': 0.7999999999999999}], 'rank': 1}, {'url': 'https://auto.mahindra.com/suv/xuv3xo/X3XO.html', 'content': \"Mahindra XUV 3XO - Price, Specifications, Colors & Images Skip to main content Skip to footer content SUVs THAR ROXX 12.99L - 23.39L Book Now Book Now Explore Explore XUV 3XO 7.99L - 15.79L Book Now Book Now Explore Explore SCORPIO-N 13.99L - 25.62L Book Now Book Now Explore Explore XUV700 14.49L - 25.14L Book Now Book Now Explore Explore THAR 11.50L - 17.62L Book Now Book Now Explore Explore SCORPIO CLASSIC 13.77L - 17.72L Book Now Book Now Explore Explore BOLERO NEO 9.97L - 12.18L Book Now Book Now Explore Explore BOLERO NEO PLUS 11.41L - 14.06L Explore Explore BOLERO 9.81L - 10.93L Book Now Book Now Explore Explore XUV400 17.49L Book Now Book Now Explore Explore MARAZZO 14.59L - 17.00L Book Now Book Now Explore Explore Explore All SUVs Explore All SUVs News Contact Us Menu Build your car Test Drive Buy Buy Book Now Exchange Finance Subscribe a Vehicle Owner's Zone Owner's Zone Owner's Action Owner's Action My Dashboard Service Cost Calculator Locate Service Center Renewals Renewals Roadside Assistance Owner's Manual Care & Maintenance Important Notifications Important Notifications Service Action Adventure Adventure Club Events Expeditions Off-Road Academy Gallery Locate a Dealer Global Markets Language News Contact us Switch theme Dark Light Home XUV 3XO Know More Know More Show more Show less Show more Show less Everything you want & more Book now Book now Show more Show less Register for the latest news and exclusive updates. Stay informed Stay informed For any assistance call us on 1800 209 6006 1800 209 6006 Social links SUVs SUVs Explore All SUVs Thar Roxx Scorpio-N XUV700 XUV 3XO Thar XUV 400 Scorpio Classic Bolero Neo Bolero Bolero Neo Plus Marazzo PIK-UPs PIK-UPs Veero Maxx City Maxx HD Bolero Pik-up Bolero Camper ABOUT ABOUT About us Press Releases Stories Media kit Careers QMS Certificate OWNER OWNER Service Adventure Merchandise & Gear - Eshop Parts and accessories- Eshop Care & Maintenance Owners manual QMS Certificate customer service customer service Contact us FAQs Talk to an expert Dealer Locator Corporate Sales Enquiry Sitemap Sitemap QMS Certificate quick links quick links Vehicle configurator Test Drive Book Online Calculators Exchange Finance Scrappage Subscribe a vehicle Become a Dealer Download the M4U app now! Lets connect on Whatsapp Chat now Chat now Mahindra Corporate Terms & Conditions Our Privacy Policy Copyright 2025 Mahindra & Mahindra Ltd\", 'images': [{'url': 'https://auto.mahindra.com/dw/image/v2/BKRC_PRD/on/demandware.static/-/Sites-mahindra-product-catalog/default/dw95797f68/images/SCRC/large/ScorpioClassic_602x339.png?sw=360&sh=202', 'alt_text': 'SCORPIO CLASSIC', 'class': 'd-block img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://auto.mahindra.com/dw/image/v2/BKRC_PRD/on/demandware.static/-/Sites-mahindra-product-catalog/default/dwc6625064/images/NEOP/large/BoleroNeoPlus_602x339.png?sw=360&sh=202', 'alt_text': 'BOLERO NEO PLUS', 'class': 'd-block img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://auto.mahindra.com/on/demandware.static/Sites-amc-Site/-/default/dwbe1329bd/images/placeholder-image.png', 'alt_text': 'XUO 3XO REVX', 'width': '1400px', 'height': '700px', 'class': 'ITC-image image-fluid common-image-component flexi-height', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://auto.mahindra.com/on/demandware.static/Sites-amc-Site/-/default/dwbe1329bd/images/placeholder-image.png', 'alt_text': 'XUV 3XO Earn 5-Star Bharat-NCAP Rating', 'width': '1400px', 'height': '700px', 'class': 'ITC-image image-fluid common-image-component flexi-height', 'loading': 'lazy', 'confidence': 0.7}], 'rank': 2}, {'url': 'https://www.v3cars.com/mahindra-cars/xuv-3xo/engine-specifications', 'content': \"Mahindra XUV 3XO Specifications - Engine CC, Power, Weight & Configurations Bengaluru Login/Signup New Cars Upcoming Cars Popular Cars Latest Cars Electric Cars News Latest News Auto Expo Press Release Variant Explained Videos Review Videos Compare Videos Variants Explained Videos More Videos Auto Expo Videos V3Cars YouTube Channel Reviews Expert Review Comparison Review Features Explained Car Guide User Review More Car Loan EMI Calculator Fuel Cost Calculator Buy / Renew Car Insurance Fuel Price in India Apply for Car Loan Mileage Calculator Car On-Road Price Sell Used Car Buy Used Cars bengaluru Login to V3Cars Sign Up to V3Cars This is\\r               necessary to personalise results for you Continue with Google Continue with Facebook or Login\\r                       with OTP Don't have\\r                         an account? Sign Up NAME EMAIL MOBILE Sign Up Already have\\r                         an account? Login OTP has been sent to Resend OTP Submit OTP Select City We need your city to customize your experience Select City V3Cars Mahindra 3XO Engine Specification Overview Price Dimensions Specifications 1.2 Turbo Petrol Manual 1.2 Turbo Petrol Automatic 1.5 Diesel Manual 1.5 Diesel Automatic 1.2 Turbo Petrol Manual (131PS) 1.2 Turbo Petrol Automatic (131PS) Mileage Variants Videos Reviews Others Comparison News &\\r                     Top Stories Monthly\\r                     Sales Images Competitiors Service Cost Brochure Colours Pros & Cons FAQs Offers Discounts CSD Price Mahindra 3XO Configurations The Mahindra 3XO is available with multiple engine options: a 1.2L turbo petrol, a 1.2L turbo petrol (131PS) and a 1.5L turbo diesel. 3XO's 1.2L turbo petrol engine is available with a 6-speed MT Manual and a 6-speed TC Automatic transmission that makes 111PS of power at 5000rpm and 200Nm of torque between 1500rpm and 3750rpm. 3XO's 1.2L turbo petrol (131PS) engine gets a 6-speed MT Manual and a 6-speed TC Automatic transmission which churns out 131PS of power at 5000rpm and 230Nm of torque between 1500rpm and 3750rpm. 3XO's 1.5L turbo diesel engine gets a 6-speed MT Manual and a 6-speed AMT Automatic transmission which is rated to deliver 117PS of power at 3750rpm and 300Nm of torque between 1500rpm and 2500rpm. The 3XO is available with following engine-transmission configurations: 1.2L Turbo Petrol with 6-speed MT (7 variants) 1.2L Turbo Petrol with 6-speed TC (4 variants) 1.5L Turbo Diesel with 6-speed MT (7 variants) 1.5L Turbo Diesel with 6-speed AMT (3 variants) 1.2L Turbo Petrol with 6-speed MT (4 variants) 1.2L Turbo Petrol with 6-speed TC (4 variants) Understanding its engine is key! Get all the facts on 2025 Mahindra XUV 3XO's displacement, cylinder, power, torque, mileage and transmission configurations. Additionally, we'll break down the various configurations available with this engine to help you find the XUV 3XO that best suits your needs. Mahindra 3XO Engine Specifications 1.2 Turbo Petrol Manual 1.2 Turbo Petrol Automatic 1.5 Diesel Manual 1.5 Diesel Automatic 1.2 Turbo Petrol Manual (131PS) 1.2 Turbo Petrol Automatic (131PS) Engine Type Turbo Engine Displacement 1.2L Cubic capacity (CC) 1197cc Cylinders 3 Max Power 111PS @ 5000rpm Max Torque 200Nm @ 1500 - 3750rpm Kerb Weight 1350Kg Power:Weight 82.22PS/tonne Torque:Weight 148.15Nm/tonne Gearbox Manual Transmission 6-speed MT Drivetrain FWD Fuel Tank Capacity 42L Claimed Milage (ARAI) 18.89kmpl Real World Milage Click here to check! Find the exact dimensions of Mahindra 3XO in feet, inches, centimeters, and millimeters! Click Here To Explore All The Details Engine Type Turbo Engine Displacement 1.2L Cubic capacity (CC) 1197cc Cylinders 3 Max Power 111PS @ 5000rpm Max Torque 200Nm @ 1500 - 3750rpm Kerb Weight 1350Kg Power:Weight 82.22PS/tonne Torque:Weight 148.15Nm/tonne Gearbox Automatic Transmission 6-speed TC Drivetrain FWD F\", 'images': [{'url': 'https://www.v3cars.com/media/content/370326mahindra-xuv3xo-diesel-variants-explained.webp', 'alt_text': '2024 Mahindra XUV3XO', 'width': '800', 'height': '500', 'confidence': 0.9999999999999999}, {'url': 'https://www.v3cars.com/media/content/982311mahindra-xuv3xo-petrol-variants-explained.webp', 'alt_text': 'Mahindra XUV 3XO', 'width': '800', 'height': '500', 'confidence': 0.9999999999999999}, {'url': 'https://www.v3cars.com/media/content/909191mahindra-xuv-3xo-ground-clearance-boot-space-dimensions.webp', 'alt_text': 'Mahindra XUV 3XO', 'width': '800', 'height': '500', 'loading': 'lazy', 'confidence': 0.9999999999999999}, {'url': 'https://www.v3cars.com/media/videoImages/024741Tata-Nexon-Pure-Plus-S-Vs-Mahindra-XUV-3XO-MX3-Pro.webp', 'alt_text': 'video image', 'width': '800', 'height': '500', 'loading': 'lazy', 'confidence': 0.9999999999999999}, {'url': 'https://www.v3cars.com/media/videoImages/044965Syros-HTK-Vs-XUV-3XO-MX3-Pro.webp', 'alt_text': 'video image', 'width': '800', 'height': '500', 'loading': 'lazy', 'confidence': 0.9999999999999999}], 'rank': 3}, {'url': 'https://www.carfolio.in/mahindra/xuv-3xo/specs', 'content': 'XUV 3XO Specifications | Engine, Dimensions, & Features New Delhi Home Cars Maruti Cars Hyundai Cars News Contact Us XUV 3XO Price Images Specs Variants Mileage Colors XUV 3XO 4.4 1250 Reviews Rs. 7.79 - 15.49 Lakh On Road Price Ex-Showroom price, New Delhi Change City View Offers Key Specifications of XUV 3XO Power 109.96 - 128.73 bhp Torque 200 - 300 Nm Seating Capacity 5 Transmission Automatic / Manual Fuel Petrol / Diesel Global NCAP Safety Rating Star Engine 1197 - 1498 cc Mileage Petrol: 17.96 - 20.10 km/l Key Features of XUV 3XO Automatic Climate Control Cruise Control Height Adjustable Driver Seat Parking Sensors Rear AC Vents Sunroof Detailed Specifications of XUV 3XO AX5 Diesel AMT MX3 Diesel AMT AX5 L Turbo MX2 diesel AX7 L Turbo MX3 Diesel AX5 MX2 Pro Diesel MX3 Pro Diesel MX3 Pro AT Comfort & Convenience Interior Exterior Safety Entertainment & Communication ADAS Feature Advance Internet Feature Engine & Transmission Fuel & Performance Suspension, Steering & Brakes Dimensions & Capacity Power Steering Air Conditioner Heater Height Adjustable Driver Seat Ventilated Seats Not Available Electric Adjustable Seats Not Available Automatic Climate Control Accessory Power Outlet Rear Reading Lamp Adjustable Headrest Rear Seat Centre Arm Rest Height Adjustable Front Seat Belts Rear AC Vents Cruise Control Parking Sensors Rear Real-Time Vehicle Tracking Foldable Rear Seat 60:40 Split KeyLess Entry Engine Start/Stop Button Cooled Glovebox Not Available Paddle Shifters Not Available USB Charger Front &amp; Rear Central Console Armrest With Storage Hands-Free Tailgate Not Available Rear Curtain Not Available Glove Box light Not Available Idle Start-Stop System Rear Window Sunblind No Rear Windscreen Sunblind No Automatic Headlamps Follow Me Home Headlamps Power Windows Front &amp; Rear Cup Holders Front &amp; Rear Additional Features Smart Steering Modes, Auto Wiper XUV 3XO Brochure Download the brochure for detailed information on specs, features, and prices. Download Brochure Want to explore more about XUV 3XO? Before you make any final decision, explore more about this car: Variants Mileage Colors Specs Price Images Related search Recently Updated Mahindra Scorpio Mahindra Bolero Camper Mahindra BOLERO PikUP ExtraStrong View 12 More Popular Cars Mahindra XUV 3XO Mahindra Scorpio N Mahindra Scorpio View 4 More Electric Cars Mahindra XUV400 EV Mahindra BE 6 Mahindra XEV 9e Petrol Cars Mahindra XUV 3XO Mahindra XUV700 Mahindra Thar ROXX View 2 More Terms & Conditions Privacy Policy Contact Us Sitemap', 'images': [], 'rank': 4}, {'url': 'https://ackodrive.com/cars/mahindra-xuv-3xo/specifications/', 'content': 'Mahindra XUV 3XO Specifications - Features, Configuration & More Delhi Overview Mileage Specs and Features Colours Dimensions Variants Images FAQs Mahindra XUV 3XO Specifications Mahindra XUV 3XO SUV 1197 cc,1497 cc 5 Seater 2024,2025 On-road price in Delhi 9.46 L - 18.49 L The Mahindra XUV 3XO has Diesel,Petrol engine option. It has a 1197,1497 cc engine. Transmission options include a Automatic,Manual gearbox. The SUV delivers a mileage in the range of 18.06 km/l to 21.20 km/l.It comes with a 5-seater seating capacity. Standout features of Mahindra XUV 3XO Dashboard Instrument Console/Cluster Infotainment System Gear Lever Sunroof Seats 1 / 6 Key specifications 2024 2025 model 5 Seater SUV Transmission Automatic Manual Engine | Power 1197 cc - 1497 cc 109 bhp - 128 bhp Fuel Diesel Petrol Fuel Tank Capacity 42 Litres Mileage 18.06 - 21.20 kmpl Key features First-in-Segment Dual Zone Climate Control First-in-Segment Electronic Parking Brake with Auto Hold Largest in Segment Skyroof Harman Kardon Audio System with 7 Speaker Twin HD Infotainment & Fully Digital Cluster Infinity Tail Lamps 6 Airbags All specifications 1.2 AX7 TGDi Switch variants Specifications Petrol 1199 Manual SUV 2025 5 Seater More details Mileage 20.09 Km/l Engine 1199 cc Max Power 87@6000 Max Torque 115@3250 Gear Box 5 Speed Power Steering Type Electric Wheel Type Steel Rims with Center Caps Boot 366 Ltrs Power Windows Front Length 3827 mm Width 1742 mm height 1615 mm View less Features Comfort Audio System No Inbuilt Audio System Fm Radio No Bluetooth No Usb Compatibility No Ipod Connectivity No Aux In Compatibility No Infotainment Screen Yes Infotainment Screen Type No Touch Sensitive Cup Holders Count 2 Keyless Entry Yes Keyless Entry Type Remote Navigation System No Ventilation System Yes Ventilation System Type Manual Air conditioning with cooling and heating Rain Sensing Wipers No Automatic Headlamps No Boot Lid Opener Manual Fuel Lid Opener Internal Cruise Control No Cigaratte Lighter No Second Row Ac Vent No Third Row Ac Vent No Adjustable Head Rests Yes Adjustable Head Rest Type Front Row Cooling Glove Box No Paddle Shifters No Interior Power Windows Front Power Steering Yes Power Steering Type Electric Instrument Console Analog Multifunctional Display Yes Adjustable Steering Yes Seating Capacity 5 Seater Power Seats No Power Seat Type General Power Seat Seat Material Fabric Heat Cold Seats No Heat Cold Seat Type Front Seats Seat Height Adjustment Manual Start Stop Button No Rear Center Armrest No Rear Center Armrest Type Cup Holders Clock Yes Clock Type Digital Safety Airbag Yes No Of Airbags 2 Airbag Count D2 Engine Immobilizer Yes Traction Control No Parking Assistance No Child Safety Lock No Door Alarm Warning Yes Central Locking Yes Anti Lock Breaking System Yes Electronic Breakforce Distribution Yes Electronic Stability Program No Electronic Break Assist No Exterior Sunroof No Rear Spoiler Yes Headlights Halogen Front Fog Lights No Tinted Windows No Roof Rails No Rear Wiper No Rear Defogger No Wheels Steel Rims with Center Caps Body SUV Body Color Bumber Yes Adjustable Orvm Internally Foldable Orvm Internally Headlight Washer No Rear Fog Light No Skid Plate No Day Running Lamps No Engine Cylinders Count 0 Valves Per Cylinder 0 Displacement 1199 Max Power Bhp 87 Max Power Rpm 6000 Max Torque Bhp 115 Max Torque Rpm 3250 Turbo Charger No Engine Location Front Fuel System Manual Emission BS6 Emission Norm Automatic Fuel Type Petrol City Mileage 0.00 Highway Mileage 0.00 Arai Mileage 20.09 Dimensions Length 3827 Width 1742 Height 1615 Wheel Base 2445 Ground Clearance 187 Boot Space 366 Fuel Tank Capacity 37 Alt Fuel Tank Capacity 0 Instrumentation Tachometer Analog Odometer Digital Fuel Consumption Average Yes Gear Indicator No Gear Shift Reminder No Distance To Empty Yes Fuel Gauge Digital Engine Malfunction Light Yes Speedometer Digital Key Off Reminder Yes Tyre Pressure Monitoring No Headlight Reminder Yes Low Fuel Warning Yes Fasten Seatbel', 'images': [{'url': 'https://ackodrive.ackoassets.com/next_assets/5fb208d6de0a2bf5ddbd410b73762de9cc636036/_next/static/images/HeroCardBGMobile-6e1ebde5e35595333643880c4a9e7d50.png', 'alt_text': 'HeroCardBG', 'class': 'HeroCard__HeroCardBGWrapper-sc-3efab0dc-2 iOuqAL', 'confidence': 0.7}, {'url': 'https://ackodrive.com/_next/image/?url=https%3A%2F%2Fackodrive-assets.ackodrive.com%2Fmedia%2Ftest_mUga1JU.png&w=640&q=75', 'alt_text': 'Mahindra XUV 3XO CarImage', 'loading': 'lazy', 'confidence': 0.7}, {'url': 'https://ackodrive-assets.ackodrive.com/media/test_gEtupzS.png', 'alt_text': 'Standout features of Mahindra XUV 3XO Dashboard', 'class': 'CarouselWrapper__CarImage-sc-20236eb1-12 cmjgqs', 'confidence': 0.7}, {'url': 'https://ackodrive-assets.ackodrive.com/media/test_NZRtdHh.png', 'alt_text': 'Standout features of Mahindra XUV 3XO Instrument Console/Cluster', 'class': 'CarouselWrapper__CarImage-sc-20236eb1-12 cmjgqs', 'confidence': 0.7}, {'url': 'https://ackodrive-assets.ackodrive.com/media/test_1LCeg1x.png', 'alt_text': 'Standout features of Mahindra XUV 3XO Infotainment System', 'class': 'CarouselWrapper__CarImage-sc-20236eb1-12 cmjgqs', 'confidence': 0.7}], 'rank': 5}]",
                "annotations": null
              }
            ]
          },
          "created_files": [],
          "execution_time": 29.111497800040524,
          "error": null,
          "successful_variant": "CODE_1",
          "total_variants_tried": 1,
          "all_errors": []
        },
        "total_time": 29.117255599994678,
        "error": null
      }
    },
    {
      "id": "T002",
      "description": "Create a comprehensive report detailing the features of Mahindra XUV 3XO based on the output from the RetrieverAgent.",
      "agent": "FormatterAgent",
      "agent_prompt": "Create a comprehensive report detailing the features of Mahindra XUV 3XO. Use the details provided in the input to create the report. The report should be detailed and exhaustive, covering all aspects of the car features like Engine, Safety, Comfort, Interior, Exterior, Technology, and Infotainment. The output should be formatted in a human readable format such as markdown.",
      "reads": [
        "T001"
      ],
      "writes": [
        "T002"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    }
  ],
  "links": [
    {
      "source": "ROOT",
      "target": "T001"
    },
    {
      "source": "T001",
      "target": "T002"
    }
  ]
}