{
  "directed": true,
  "multigraph": false,
  "graph": {
    "session_id": "52863122",
    "original_query": "I want a comprehensive report on the features for Mahindra XUV 3XO, and you must also include a detailed analysis of the luxury and safety features.",
    "file_manifest": [],
    "created_at": "2025-07-18T18:25:22.996387",
    "status": "running",
    "output_chain": {
      "T001": {
        "iterations": [
          {
            "iteration": 1,
            "output": {
              "xuv_3xo_features": [
                {
                  "type": "text",
                  "text": "[{'url': 'https://auto.mahindra.com/suv/xuv3xo/X3XO.html', 'content': \"Mahindra XUV 3XO - Price, Specifications, Colors & Images Skip to main content Skip to footer content SUVs THAR ROXX 12.99L - 23.39L Book Now Book Now Explore Explore XUV 3XO 7.99L - 15.79L Book Now Book Now Explore Explore SCORPIO-N 13.99L - 25.62L Book Now Book Now Explore Explore XUV700 14.49L - 25.14L Book Now Book Now Explore Explore THAR 11.50L - 17.62L Book Now Book Now Explore Explore SCORPIO CLASSIC 13.77L - 17.72L Book Now Book Now Explore Explore BOLERO NEO 9.97L - 12.18L Book Now Book Now Explore Explore BOLERO NEO PLUS 11.41L - 14.06L Explore Explore BOLERO 9.81L - 10.93L Book Now Book Now Explore Explore XUV400 17.49L Book Now Book Now Explore Explore MARAZZO 14.59L - 17.00L Book Now Book Now Explore Explore Explore All SUVs Explore All SUVs News Contact Us Menu Build your car Test Drive Buy Buy Book Now Exchange Finance Subscribe a Vehicle Owner's Zone Owner's Zone Owner's Action Owner's Action My Dashboard Service Cost Calculator Locate Service Center Renewals Renewals Roadside Assistance Owner's Manual Care & Maintenance Important Notifications Important Notifications Service Action Adventure Adventure Club Events Expeditions Off-Road Academy Gallery Locate a Dealer Global Markets Language News Contact us Switch theme Dark Light Home XUV 3XO Know More Know More Show more Show less Show more Show less Everything you want & more Book now Book now Show more Show less Register for the latest news and exclusive updates. Stay informed Stay informed For any assistance call us on 1800 209 6006 1800 209 6006 Social links SUVs SUVs Explore All SUVs Thar Roxx Scorpio-N XUV700 XUV 3XO Thar XUV 400 Scorpio Classic Bolero Neo Bolero Bolero Neo Plus Marazzo PIK-UPs PIK-UPs Veero Maxx City Maxx HD Bolero Pik-up Bolero Camper ABOUT ABOUT About us Press Releases Stories Media kit Careers QMS Certificate OWNER OWNER Service Adventure Merchandise & Gear - Eshop Parts and accessories- Eshop Care & Maintenance Owners manual QMS Certificate customer service customer service Contact us FAQs Talk to an expert Dealer Locator Corporate Sales Enquiry Sitemap Sitemap QMS Certificate quick links quick links Vehicle configurator Test Drive Book Online Calculators Exchange Finance Scrappage Subscribe a vehicle Become a Dealer Download the M4U app now! Lets connect on Whatsapp Chat now Chat now Mahindra Corporate Terms & Conditions Our Privacy Policy Copyright 2025 Mahindra & Mahindra Ltd\", 'images': [{'url': 'https://auto.mahindra.com/dw/image/v2/BKRC_PRD/on/demandware.static/-/Sites-mahindra-product-catalog/default/dw95797f68/images/SCRC/large/ScorpioClassic_602x339.png?sw=360&sh=202', 'alt_text': 'SCORPIO CLASSIC', 'class': 'd-block img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://auto.mahindra.com/dw/image/v2/BKRC_PRD/on/demandware.static/-/Sites-mahindra-product-catalog/default/dwc6625064/images/NEOP/large/BoleroNeoPlus_602x339.png?sw=360&sh=202', 'alt_text': 'BOLERO NEO PLUS', 'class': 'd-block img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://auto.mahindra.com/on/demandware.static/Sites-amc-Site/-/default/dwbe1329bd/images/placeholder-image.png', 'alt_text': 'XUO 3XO REVX', 'width': '1400px', 'height': '700px', 'class': 'ITC-image image-fluid common-image-component flexi-height', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://auto.mahindra.com/on/demandware.static/Sites-amc-Site/-/default/dwbe1329bd/images/placeholder-image.png', 'alt_text': 'XUV 3XO Earn 5-Star Bharat-NCAP Rating', 'width': '1400px', 'height': '700px', 'class': 'ITC-image image-fluid common-image-component flexi-height', 'loading': 'lazy', 'confidence': 0.7}], 'rank': 1}, {'url': 'https://www.team-bhp.com/news/2024-mahindra-xuv-3xo-review-8-pros-7-cons', 'content': \"2024 Mahindra XUV 3XO Review : 8 Pros & 7 Cons | Team-BHP Skip to main content About Us | Advertise | Contact Us Forum Hot Threads News Reviews Photos Buy Used Car Spare Parts Buy Accessories Classifieds Store News 2024 Mahindra XUV 3XO Review : 8 Pros & 7 Cons 8th May 2024, 12:20 by Omkar Shendge View Forum Discussion It gets a refreshed exterior, some changes to the interiors, quite a few feature additions and a new 6-speed Aisin-sourced automatic gearbox for its petrol engines. Mahindra XUV 3XO Pros A truly premium crossover. Nice build, quality & refinement levels Cabin has enough space for 5. Quality-wise, the interior is more like a Hyundai Fantastic petrol & diesel engine line-up; they offer fast performance & good driveability Finally gets a smooth torque converter automatic with the turbo-petrol engines Wide variant spread ensures there's something for everyone A compliant ride with sorted road manners 5-star NCAP rating & kit. Level 2 ADAS, 6 airbags, ESP, ABS, all-wheel disc brakes, TPMS, seatbelt reminders for all & more Loaded to the gills with equipment (360-degree camera, big sunroof, drive modes, Harman Kardon audio system, wireless smartphone connectivity, auto headlamps & wipers etc.) Mahindra XUV 3XO Cons The new edgy & outlandish design may not be to everyone's liking. Some love it, some don't. It is very polarizing Top-end variants are expensive. Not overpriced, but definitely higher than expected 295-liter boot is the smallest in the segment. There are cheaper hatchbacks that have a larger boot No proper diesel automatic option, just a jerky AMT which has no place in a premium crossover Light & disconnected steering is the biggest drawback in a competent handling package Mahindra's after-sales service quality is a hit or miss. Remains a gamble Some important features missing (ventilated seats, parcel tray, full-sized spare wheel, paddle shifters etc.) Read Team-BHP's detailed Mahindra XUV 3XO Review View Forum Discussion Tags: Indian Mahindra Launches & Updates Mahindra XUV 3XO Back to Index Next Article Related News Mahindra XUV 3XO RevX edition launch soon; details revealed Mahindra XUV 3XO REVX Series launched at Rs 8.94 lakh 10,000 km with my Mahindra XUV 3X0: Service & ownership recap Booked Mahindra XUV 3XO AX5 over Skoda Kylaq Signature Plus: Here's why Improving my Mahindra XUV 3XO AX5L's audio setup with a 2-stage upgrade Find Car News By Brand Any Brand Audi BMW BYD Chevrolet Citroen Datsun Ferrari Fiat Force Ford HM Honda Hyundai Isuzu Jaguar Jeep Kia Lamborghini Land Rover Lexus Lotus Mahindra Maruti Suzuki McLaren Mercedes-Benz MG Mini Mitsubishi Nissan Porsche Premier Renault Rolls-Royce Skoda Tata Tesla Toyota VinFast Volkswagen Volvo Or By Category Any Category 2-Wheels Commercial Vehicles Industry & Policy Launches & Updates Member Content Motorsports Other Sales & Analysis Scoops & Rumours Just News Kinetic to launch retro-styled electric scooter on July 28 Porsche Cayenne Black Edition launched at Rs 1.80 crore 2025 Aprilia SR 125 launched at Rs 1.20 lakh Maruti Suzuki e Vitara to be launched on September 3 Honda Shine-based electric bike in the works; patent filed Keeway RR 300 launched at Rs 1.99 lakh Ford unveils Bronco EV & plug-in hybrid models for China Mercedes-AMG CLE 53 Coupe to be launched on August 12 Han's Mazda RX-7 from Tokyo Drift sold for 1.2 million USD Range Rover Velar Autobiography launched at Rs 89.90 lakh Tata rolls out 6 lakh units of the Punch in less than 4 years BMW 2 Series Gran Coupe launched at Rs 46.90 lakh Team-BHP.com Advice Classifieds Forum Hot Threads News Photos Reviews Road Safety Store Tech Stuff About Us Overview The Team Key Features Philosophy History Contact Us Speak Share Advertise Copyright 2025 - www.team-bhp.com Site Map | Privacy Policy | Terms & Conditions Team-BHP's Daily Newsletter View recent samples Hero Vida VX2 Buy & Sell USED CARS Rs. 2 Lakhs or less Rs. 2 - 4 Lakhs Rs. 4 - 6 Lakhs Rs. 6 - 8 Lakhs Rs. 8 Lakhs or more Hot Threads L\", 'images': [{'url': 'https://www.team-bhp.com/sites/default/files/styles/check_extra_large_for_review/public/2024_mahindra_xuv3xo_exterior_01_0.jpg', 'alt_text': '2024 Mahindra XUV 3XO Review : 8 Pros & 7 Cons', 'confidence': 0.7999999999999999}, {'url': 'https://www.team-bhp.com/sites/default/files/styles/check_extra_large_for_review/public/2024_mahindra_xuv3xo_interior_01.jpg', 'alt_text': '2024 Mahindra XUV 3XO Review : 8 Pros & 7 Cons', 'confidence': 0.7999999999999999}, {'url': 'https://www.team-bhp.com/sites/default/files/styles/check_extra_large_for_review/public/2024_mahindra_xuv3xo_interior_20.jpg', 'alt_text': '2024 Mahindra XUV 3XO Review : 8 Pros & 7 Cons', 'confidence': 0.7999999999999999}, {'url': 'https://www.team-bhp.com/sites/default/files/styles/check_extra_large_for_review/public/2024_mahindra_xuv3xo_interior_27.jpg', 'alt_text': '2024 Mahindra XUV 3XO Review : 8 Pros & 7 Cons', 'confidence': 0.7999999999999999}, {'url': 'https://www.team-bhp.com/sites/default/files/styles/check_thumb_review_detail/public/2024_mahindra_xuv3xo_exterior_01_0.jpg', 'alt_text': '2024 Mahindra XUV 3XO Review : 8 Pros & 7 Cons', 'confidence': 0.7999999999999999}], 'rank': 2}, {'url': 'https://www.autocarindia.com/car-reviews/mahindra-xuv-3xo-review-feature-and-power-packed-compact-suv-431439', 'content': \"Mahindra XUV300, XUV 3XO review, design, interior, features, performance, first drive - Introduction | Autocar India All All Price News Reviews Features Specifications Images Videos All All Price News Reviews Features Specifications Images Videos Signup Login Find a Car Cars Compare Cars New Cars Upcoming Cars Car Price Car Loan Calculator Find a Bike Bikes Compare Bikes New New Bikes New Scooters Upcoming Upcoming Bikes Upcoming Scooters Electric Electric Bikes Electric Scooters Bike Price Bike Loan Calculator News Cars Bikes Motorsports Industry Marketplace Reviews Car First drive / Reviews Comparisons Video reviews Long-term reviews Bike First ride / Reviews Comparisons Video reviews Long-term reviews Features Features Travelogues Blogs Interviews Partner Content Galleries Videos Images Stories Advice Signup Login Home Car Reviews Mahindra XUV 3XO review - Feature and power packed compact SUV Mahindra XUV 3XO review - Feature and power packed compact SUV Out goes the Mahindra XUV300 and in comes the XUV 3XO. The new name is just the starting point of a very comprehensive upgrade. Updated on May 02, 2024 05:35:55 PM 87,048 Views Follow us on The XUV 3XO's styling is big on flash The diamond-shaped detailing on the lights and grille are a nice touch. The infotainment is now a 10.25-inch unit and works well. By Nikhil Bhatia Share - Make : Mahindra Model : XUV 3XO We Like Upmarket interior Strong engines Long equipment list We Don't Like Boot space Competent as the Mahindra XUV300 was, it never quite made it to the list of compact SUV bestsellers. Mahindra is now gunning for glory with the updated XUV300, christened the XUV 3XO. Mind you, this is no run-of-the-mill nip and tuck update. Mahindra has gone all out with a new look, redone interior, some class-first feature introductions, some class-best specifications and very enticing pricing. The aim is to take the fight to the Tata Nexon, Maruti Brezza, Kia Sonet and Hyundai Venue, and win. Mahindra XUV 3XO: design and styling Where the XUV300s styling was understated, the XUV 3XO is big on flash. Giving the 3XO its distinctive face are the large, new vertically oriented headlights outlined by C-shaped DRLs (a link to the larger XUV700). The headlights are split into two sections with a concealed projector unit up top, and an open projector fog lamp unit lower down, both set amidst a black surround. The lights flank the new grille, which is actually a gloss panel that runs much of the XUVs width. The new front bumper with its pronounced cuts and creases is very concept car-like and the newly contoured bonnet also does its bit to add volume to the design. New C-shaped LED DRLs provide a visual link with the larger XUV700. Like the XUV300, the 3XO looks muscular in profile, and furthering the impression are the stylish new 17-inch diamond cut alloy wheels that are the largest in the segment. Theres also chunkier side cladding with cuts at the wheel arches. Mahindra says ground clearance is a generous 201mm, up from the XUV300s figure of 180mm. Mahindra XUV 3XO Price, Mileage, Specifications, Features and Variants Brand Mahindra Model Name XUV 3XO Mahindra XUV 3XO Price 9.06 - 18.39 lakh Mahindra XUV 3XO Range/Mileage Petrol : 17.96 - 20.1kpl | Diesel : 20.6 - 21.2kpl Mahindra XUV 3XO Specifications SUV | 5 doors | 5 seats View All Specs Mahindra XUV 3XO Features LED headlight | 10.25-inch Touchscreen display | 6 airbags View All Features Mahindra XUV 3XO Variants MX1 1.2 Petrol MT | REVX M 1.2 Petrol MT | REVX M (O) 1.2 Petrol MT View All Variants In its basic shape though, the 3XO is no different than the XUV300. The 2,600mm wheelbase remains class best, but the short overhangs, particularly at the back, tell you that this is a vehicle that's brutally shortened (remember it started life as a SsangYong Tivoli) to get length under the critical 4m mark, needed to qualify as a small car and hence a lower rate of tax. New 17-inch alloys are the largest in the segment. At the back, y\", 'images': [{'url': 'https://img.autocarindia.com/ExtraImages/20240502111525_First Drive 3XO Web.001.jpeg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO review', 'title': 'Mahindra XUV 3XO review', 'class': 'img-fluid', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/ExtraImages/20240502012130_First Drive 3XO Web.008.jpeg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO front quarter', 'title': 'Mahindra XUV 3XO front quarter', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/ExtraImages/20240502012130_First Drive 3XO Web.014.jpeg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO review - Feature and power packed compact SUV', 'title': 'Mahindra XUV 3XO review - Feature and power packed compact SUV', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/ExtraImages/20240502012130_First Drive 3XO Web.016.jpeg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO review - Feature and power packed compact SUV', 'title': 'Mahindra XUV 3XO review - Feature and power packed compact SUV', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/model/uploads/modelimages/Mahindra-XUV-3XO-290420241902.jpg', 'alt_text': 'Latest Image of Mahindra XUV 3XO', 'title': 'Mahindra XUV 3XO', 'class': 'img-fluid wid-img', 'loading': 'lazy', 'confidence': 0.7999999999999999}], 'rank': 3}, {'url': 'https://www.carwale.com/mahindra-cars/xuv-3xo/', 'content': \"Mahindra XUV 3XO Price - Images, Colours & Reviews - CarWale NEW CARS USED CARS REVIEWS & NEWS AD Mahindra XUV 3XO 3.9 Expert Rating | 4.6 User Rating (557) Rate & Win The Mahindra XUV 3XO offers a sorted ride and engaging drive, ample space, and modern-day equipment. While its boot space is limited, it isn't a deal-breaker, especially considering the compact SUVs attractive pricing. It is available with both petrol and diesel power. Overview 360 View Variants Offers Similar Cars Colours Brochure Mileage User Reviews News Expert Reviews Videos Images FAQs Colours Images View Variant Select Variant City Show price in my city Rs. 7.99 - 15.80 Lakh XUV 3XO On Road Price Ex-Showroom price, Mumbai Calculate your EMI EMI Calculator Get July Offers 4 Things to Know About XUV 3XO Has projector headlamps, 17-inch alloys and a 360-degree camera. The instrument cluster is fully digital with customisable screens. Top-spec versions get dual-zone climate control with rear AC vents. One of the USPs of the Mahindra XUV 3XO is level-2 ADAS Mahindra XUV 3XO Price Mahindra XUV 3XO price for the base model starts at Rs. 7.99 Lakh and the top model price goes upto Rs. 15.80 Lakh (Avg. ex-showroom). XUV 3XO price for 29 variants is listed below. Filter By Fuel type & Transmission Petrol Diesel Manual Automatic (TC) Automatic (AMT) Variants Ex-Showroom price Compare XUV 3XO MX1 1.2 Petrol 1197 cc, Petrol, Manual, 18.89 kmpl, 110 bhp Rs. 7.99 Lakh Compare View Price Breakup Get Offers Just Launched XUV 3XO REVX M 1.2 Petrol 1197 cc, Petrol, Manual, 110 bhp Rs. 8.94 Lakh Compare View Price Breakup Get Offers Just Launched XUV 3XO REVX M (O)1.2 Petrol 1197 cc, Petrol, Manual, 110 bhp Rs. 9.44 Lakh Compare View Price Breakup Get Offers XUV 3XO MX2 Pro 1.2 Petrol 1197 cc, Petrol, Manual, 18.89 kmpl, 110 bhp Rs. 9.54 Lakh Compare View Price Breakup Get Offers XUV 3XO MX3 1.2 Petrol 1197 cc, Petrol, Manual, 18.89 kmpl, 110 bhp Rs. 9.74 Lakh Compare View Price Breakup Get Offers XUV 3XO MX3 Pro 1.2 Petrol 1197 cc, Petrol, Manual, 18.89 kmpl, 110 bhp Rs. 9.99 Lakh Compare View Price Breakup Get Offers XUV 3XO MX2 1.5 Diesel 1497 cc, Diesel, Manual, 20.6 kmpl, 115 bhp Rs. 9.99 Lakh Compare View Price Breakup Get Offers XUV 3XO MX2 Pro 1.2 Petrol AT 1197 cc, Petrol, Automatic (TC), 17.96 kmpl, 110 bhp Rs. 10.54 Lakh Compare View Price Breakup Get Offers XUV 3XO MX2 Pro 1.5 Diesel 1497 cc, Diesel, Manual, 20.6 kmpl, 115 bhp Rs. 10.64 Lakh Compare View Price Breakup Get Offers XUV 3XO AX5 1.2 Petrol 1197 cc, Petrol, Manual, 18.89 kmpl, 110 bhp Rs. 10.99 Lakh Compare View Price Breakup Get Offers XUV 3XO MX3 1.5 Diesel 1497 cc, Diesel, Manual, 20.6 kmpl, 115 bhp Rs. 10.99 Lakh Compare View Price Breakup Get Offers XUV 3XO MX3 1.2 Petrol AT 1197 cc, Petrol, Automatic (TC), 17.96 kmpl, 110 bhp Rs. 11.40 Lakh Compare View Price Breakup Get Offers XUV 3XO MX3 Pro 1.5 Diesel 1497 cc, Diesel, Manual, 20.6 kmpl, 115 bhp Rs. 11.56 Lakh Compare View Price Breakup Get Offers XUV 3XO MX3 Pro 1.2 Petrol AT 1197 cc, Petrol, Automatic (TC), 17.96 kmpl, 110 bhp Rs. 11.69 Lakh Compare View Price Breakup Get Offers XUV 3XO MX3 1.5 Diesel Autoshift Plus 1497 cc, Diesel, Automatic (AMT), 21.2 kmpl, 115 bhp Rs. 11.79 Lakh Compare View Price Breakup Get Offers Just Launched XUV 3XO REVX A 1.2 Petrol MT 1197 cc, Petrol, Manual, 129 bhp Rs. 11.79 Lakh Compare View Price Breakup Get Offers XUV 3XO AX5 1.5 Diesel 1497 cc, Diesel, Manual, 20.6 kmpl, 115 bhp Rs. 12.19 Lakh Compare View Price Breakup Get Offers XUV 3XO AX5 1.2 Petrol AT 1197 cc, Petrol, Automatic (TC), 17.96 kmpl, 110 bhp Rs. 12.49 Lakh Compare View Price Breakup Get Offers XUV 3XO AX5L 1.2 Petrol 1197 cc, Petrol, Manual, 20.1 kmpl, 129 bhp Rs. 12.62 Lakh Compare View Price Breakup Get Offers XUV 3XO AX7 1.2 Petrol 1197 cc, Petrol, Manual, 20.1 kmpl, 129 bhp Rs. 12.80 Lakh Compare View Price Breakup Get Offers XUV 3XO AX5 1.5 Diesel Autoshift Plus 1497 cc, Diesel, Automatic (AMT), 21.2 kmpl, 115 bhp Rs. 12.99 Lakh Compare\", 'images': [{'url': 'https://imgd.aeplcdn.com/664x374/n/cw/ec/156405/xuv-3xo-exterior-right-front-three-quarter-34.jpeg?isig=0&q=80', 'alt_text': 'Mahindra XUV 3XO Right Front Three Quarter', 'title': 'Mahindra XUV 3XO Right Front Three Quarter', 'class': 'o-D o-hP o-iB o-iT o-G o-Q o-a0 o-aa o-hl o-ed', 'loading': 'eager', 'confidence': 0.7999999999999999}, {'url': 'https://imgd.aeplcdn.com/664x374/n/cw/ec/156405/xuv-3xo-exterior-right-front-three-quarter-32.jpeg?isig=0&q=80', 'alt_text': 'Mahindra XUV 3XO Right Front Three Quarter', 'title': 'Mahindra XUV 3XO Right Front Three Quarter', 'class': 'o-D o-hP o-iB o-iT o-G o-Q o-a0 o-aa o-hl o-ed', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://imgd.aeplcdn.com/664x374/n/cw/ec/156405/xuv-3xo-exterior-left-rear-three-quarter.jpeg?isig=0&q=80', 'alt_text': 'Mahindra XUV 3XO Left Rear Three Quarter', 'title': 'Mahindra XUV 3XO Left Rear Three Quarter', 'class': 'o-D o-hP o-iB o-iT o-G o-Q o-a0 o-aa o-hl o-ed', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://imgd.aeplcdn.com/664x374/n/cw/ec/156405/xuv-3xo-exterior-left-side-view.jpeg?isig=0&q=80', 'alt_text': 'Mahindra XUV 3XO Left Side View', 'title': 'Mahindra XUV 3XO Left Side View', 'class': 'o-D o-hP o-iB o-iT o-G o-Q o-a0 o-aa o-hl o-ed', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://imgd.aeplcdn.com/664x374/n/cw/ec/156405/xuv-3xo-exterior-front-view-39.jpeg?isig=0&q=80', 'alt_text': 'Mahindra XUV 3XO Front View', 'title': 'Mahindra XUV 3XO Front View', 'class': 'o-D o-hP o-iB o-iT o-G o-Q o-a0 o-aa o-hl o-ed', 'loading': 'lazy', 'confidence': 0.7999999999999999}], 'rank': 4}, {'url': 'https://www.spinny.com/cars/mahindra/xuv-3xo/', 'content': \"Mahindra XUV 3XO - Complete Overview of Features, Pricing and Reviews Buy car View all cars Used cars in Delhi NCR Used cars in Bangalore Used cars in Hyderabad Used cars in Mumbai Used cars in Pune Used cars in Delhi Used cars in Gurgaon Used cars in Noida Used cars in Ahmedabad Used cars in Chennai Used cars in Kolkata Used cars in Lucknow Used cars in Jaipur Used cars in Chandigarh Used cars in Coimbatore Used cars in Faridabad Used cars in Ghaziabad Used cars in Karnal Used cars in Kochi Used cars in Sonipat Used cars in Visakhapatnam Sell car Sell Car Online Sell cars in Ahmedabad Sell cars in Bangalore Sell cars in Chennai Sell cars in Delhi Sell cars in Gurgaon Sell cars in Hyderabad Sell cars in Kolkata Sell cars in Mumbai Sell cars in Noida Sell cars in Pune Sell cars in Lucknow Sell cars in Jaipur Sell Scrap Car More About Us About Spinny Investor Relations Car Finance Check your eligibility Know your EMI Spinny Finance process Pro Service How it Works Car buying process Car selling process Pricing Car Hub Locations Blog Customer Reviews Scrap Car Car valuation Check eChallan Check RTO Details Recharge FASTag Spinny Assured The sure road to Car Joy Spinny BuyBack Commit less, Drive more Spinny Partners Drive your business ahead Pro Service Hassle free car service Spinny Insurance Hassle free car insurance Shortlisted Account Your Account Call us at 727-727-7275 Overview Specs & Features Pricing & Variants Expert's Review User's Review F.A.Qs Colours Best Used Cars Images & Videos Home Cars Mahindra XUV 3XO 9 Colors 40 Images Mahindra XUV 3XO Overview The Mahindra XUV 3XO is a compact SUV that seamlessly blends bold design with advanced technology. Its dynamic styling, spacious interiors, and feature-rich offerings make it a compelling choice for modern urban drivers. Whether navigating city streets or embarking on weekend getaways, the XUV 3XO delivers a comfortable and engaging driving experience. Mahindra XUV 3XO Specifications & Features Ground clearance -- Wheelbase 2600 Boot space 364 Acceleration (0-100 kmph) -- Transmission type Manual Displacement 1497 Max power (bhp) 115 bhp@3750rpm Mileage (ARAI) 20.6 Fuel Type diesel Mahindra XUV 3XO Key Features Versatile Powertrain Options Advanced Safety Features Premium Interior and Comfort Modern Exterior Design View All SPECS & FEATURES Mahindra XUV 3XO Pricing & Variants In the Indian used car market, the Mahindra XUV 3XO is available across a range of prices, influenced by factors such as model year, variant, and condition. Prices typically start around 7.99 lakh for earlier models and can go up to 15.56 lakh for newer, top-tier variants . This range offers options for various budgets, making the XUV 3XO an attractive choice for those seeking a reliable and stylish compact SUV. Popular Variants On-Road Price * in Delhi No Variants Found Get The Best Used Cars In Your Budget 1 - 2 Lakh 2 - 4 Lakh 4 - 6 Lakh 6 - 10 Lakh Mahindra XUV 3XO Expert's Review 4.0 The Mahindra XUV 3XO emerges as a significant evolution in the subcompact SUV segment, building upon the foundation laid by its predecessor, the XUV300. With a bold new design, enhanced features, and advanced safety technologies, the XUV 3XO aims to cater to the modern urban driver. Under the hood, it offers a choice of efficient petrol and diesel engines, paired with both manual and automatic transmissions, ensuring versatility for various driving preferences. Inside, the cabin boasts a contemporary layout with a 10.25-inch touchscreen infotainment system, digital instrument cluster, and a panoramic sunroof, elevating the overall driving experience. In this expert review, we delve into the XUV 3XO's offerings to assess its position in the competitive compact SUV market. Exterior Design 4/5 Paint Quality 4/5 Panel Gaps 4/5 Interior Design 4/5 Space 4/5 Comfort 4/5 Safety No. of Airbags 4 Features 4/5 Performance Stability 4/5 Eng. Response 4/5 Clutch & Gears 4/5 Read Full Review Pros & Cons of Mahindra XUV 3XO Pro\", 'images': [{'url': 'https://media.spinny.com/sp-file-system/public/2025-02-07/df136fb0d64b4fa6a4bc999b2cf16909/file.JPG?q=85', 'alt_text': 'New Mahindra XUV 3XO exterior LEFT FRONT CORNER VIEW', 'class': 'Image__animateOpacity ImageSlider__img', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://media.spinny.com/sp-file-system/public/2025-02-07/850a1fe3537041e38fad4e1f956446fb/file.JPG?q=85', 'alt_text': 'New Mahindra XUV 3XO exterior LEFT SIDE VIEW', 'class': 'Image__animateOpacity ImageSlider__img', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://media.spinny.com/sp-file-system/public/2025-02-07/df136fb0d64b4fa6a4bc999b2cf16909/file.JPG?q=85', 'alt_text': 'New Mahindra XUV 3XO exterior LEFT FRONT CORNER VIEW', 'class': 'Image__animateOpacity ImageSlider__img', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://mda.spinny.com/sp-file-system/public/2025-04-21/2e54d4e30d2b4bb18fd31a8c92d78e06/raw/file.png', 'alt_text': 'New Mahindra XUV 3XO Everest White', 'class': 'ColorOptions__currentCarDisplayContainerImage', 'confidence': 0.7}, {'url': 'https://mda.spinny.com/sp-file-system/public/2025-04-21/e9939be9416447e69d92aa3591b2edb6/raw/file.png', 'alt_text': 'New Mahindra XUV 3XO Citrine Yellow', 'class': 'ColorOptions__currentCarDisplayContainerImage', 'confidence': 0.7}], 'rank': 5}, {'url': 'https://autotorque.in/mahindra-xuv-3xo-review-a-comprehensive-analysis-of-features-and-performance/', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://whatinsider.com/mahindra-xuv-3xo/', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://passengercars.caimahindra.com/new-cars/mahindra-xuv-3xo/specification.html', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
                  "annotations": null
                }
              ]
            }
          }
        ],
        "final_output": null,
        "iteration_count": 1
      }
    },
    "validation_results": {
      "is_valid": true,
      "is_dag": true,
      "cycles": [],
      "disconnected_components": [],
      "orphaned_nodes": [],
      "root_nodes": [],
      "leaf_nodes": [
        "T003"
      ],
      "warnings": [],
      "errors": []
    }
  },
  "nodes": [
    {
      "description": "Initial Query",
      "agent": "System",
      "status": "completed",
      "id": "ROOT"
    },
    {
      "id": "T001",
      "description": "Retrieve information on Mahindra XUV 3XO features from the web, focusing on official sources and reputable reviews.",
      "agent": "RetrieverAgent",
      "agent_prompt": "Gather comprehensive information on the features of the Mahindra XUV 3XO from official Mahindra websites, reputable automotive review sites, and other reliable sources. Focus on all features and specifications of the vehicle.",
      "reads": [],
      "writes": [
        "T001"
      ],
      "status": "failed",
      "output": null,
      "error": "Code execution failed: Code execution failed: All code variants failed. Errors: CODE_1: KeyError: 'content'",
      "cost": 0.0,
      "start_time": "2025-07-18T18:25:23.006835",
      "end_time": "2025-07-18T18:26:07.675683",
      "execution_time": 44.668848,
      "execution_result": {
        "status": "partial_failure",
        "session_id": "52863122",
        "operations": [
          "python_code"
        ],
        "created_files": [],
        "file_results": {},
        "code_results": {
          "status": "failed",
          "result": {},
          "created_files": [],
          "execution_time": 0.006337300001177937,
          "error": "All code variants failed. Errors: CODE_1: KeyError: 'content'",
          "failed_variants": 1,
          "all_errors": [
            "CODE_1: KeyError: 'content'"
          ]
        },
        "total_time": 0.009962700016330928,
        "error": "Code execution failed: All code variants failed. Errors: CODE_1: KeyError: 'content'"
      },
      "iterations": [
        {
          "iteration": 1,
          "output": {
            "initial_thoughts": "I need to gather comprehensive information on the Mahindra XUV 3XO's features from various sources, focusing on official Mahindra websites and reputable automotive review sites. I will use the search_web_with_text_content tool to achieve this. Since comprehensive research is needed, I will use call_self=true and extract the luxury and safety features in the next step.",
            "output": {},
            "call_self": true,
            "next_instruction": "Extract detailed information on the luxury and safety features of the Mahindra XUV 3XO from the previously gathered information.",
            "code": {
              "CODE_1": "results = search_web_with_text_content('Mahindra XUV 3XO features specifications official site review', 8)\noutput = {'xuv_3xo_features': results}",
              "CODE_2": "results = search_web_with_text_content('Mahindra XUV 3XO features specifications car and driver motor trend', 6)\noutput = {'xuv_3xo_features': results}"
            },
            "cost": 0.00042435,
            "input_tokens": 2121.0,
            "output_tokens": 177.0,
            "total_tokens": 2298.0,
            "execution_result": {
              "status": "success",
              "session_id": "52863122",
              "operations": [
                "python_code"
              ],
              "created_files": [],
              "file_results": {},
              "code_results": {
                "status": "success",
                "result": {
                  "xuv_3xo_features": [
                    {
                      "type": "text",
                      "text": "[{'url': 'https://auto.mahindra.com/suv/xuv3xo/X3XO.html', 'content': \"Mahindra XUV 3XO - Price, Specifications, Colors & Images Skip to main content Skip to footer content SUVs THAR ROXX 12.99L - 23.39L Book Now Book Now Explore Explore XUV 3XO 7.99L - 15.79L Book Now Book Now Explore Explore SCORPIO-N 13.99L - 25.62L Book Now Book Now Explore Explore XUV700 14.49L - 25.14L Book Now Book Now Explore Explore THAR 11.50L - 17.62L Book Now Book Now Explore Explore SCORPIO CLASSIC 13.77L - 17.72L Book Now Book Now Explore Explore BOLERO NEO 9.97L - 12.18L Book Now Book Now Explore Explore BOLERO NEO PLUS 11.41L - 14.06L Explore Explore BOLERO 9.81L - 10.93L Book Now Book Now Explore Explore XUV400 17.49L Book Now Book Now Explore Explore MARAZZO 14.59L - 17.00L Book Now Book Now Explore Explore Explore All SUVs Explore All SUVs News Contact Us Menu Build your car Test Drive Buy Buy Book Now Exchange Finance Subscribe a Vehicle Owner's Zone Owner's Zone Owner's Action Owner's Action My Dashboard Service Cost Calculator Locate Service Center Renewals Renewals Roadside Assistance Owner's Manual Care & Maintenance Important Notifications Important Notifications Service Action Adventure Adventure Club Events Expeditions Off-Road Academy Gallery Locate a Dealer Global Markets Language News Contact us Switch theme Dark Light Home XUV 3XO Know More Know More Show more Show less Show more Show less Everything you want & more Book now Book now Show more Show less Register for the latest news and exclusive updates. Stay informed Stay informed For any assistance call us on 1800 209 6006 1800 209 6006 Social links SUVs SUVs Explore All SUVs Thar Roxx Scorpio-N XUV700 XUV 3XO Thar XUV 400 Scorpio Classic Bolero Neo Bolero Bolero Neo Plus Marazzo PIK-UPs PIK-UPs Veero Maxx City Maxx HD Bolero Pik-up Bolero Camper ABOUT ABOUT About us Press Releases Stories Media kit Careers QMS Certificate OWNER OWNER Service Adventure Merchandise & Gear - Eshop Parts and accessories- Eshop Care & Maintenance Owners manual QMS Certificate customer service customer service Contact us FAQs Talk to an expert Dealer Locator Corporate Sales Enquiry Sitemap Sitemap QMS Certificate quick links quick links Vehicle configurator Test Drive Book Online Calculators Exchange Finance Scrappage Subscribe a vehicle Become a Dealer Download the M4U app now! Lets connect on Whatsapp Chat now Chat now Mahindra Corporate Terms & Conditions Our Privacy Policy Copyright 2025 Mahindra & Mahindra Ltd\", 'images': [{'url': 'https://auto.mahindra.com/dw/image/v2/BKRC_PRD/on/demandware.static/-/Sites-mahindra-product-catalog/default/dw95797f68/images/SCRC/large/ScorpioClassic_602x339.png?sw=360&sh=202', 'alt_text': 'SCORPIO CLASSIC', 'class': 'd-block img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://auto.mahindra.com/dw/image/v2/BKRC_PRD/on/demandware.static/-/Sites-mahindra-product-catalog/default/dwc6625064/images/NEOP/large/BoleroNeoPlus_602x339.png?sw=360&sh=202', 'alt_text': 'BOLERO NEO PLUS', 'class': 'd-block img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://auto.mahindra.com/on/demandware.static/Sites-amc-Site/-/default/dwbe1329bd/images/placeholder-image.png', 'alt_text': 'XUO 3XO REVX', 'width': '1400px', 'height': '700px', 'class': 'ITC-image image-fluid common-image-component flexi-height', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://auto.mahindra.com/on/demandware.static/Sites-amc-Site/-/default/dwbe1329bd/images/placeholder-image.png', 'alt_text': 'XUV 3XO Earn 5-Star Bharat-NCAP Rating', 'width': '1400px', 'height': '700px', 'class': 'ITC-image image-fluid common-image-component flexi-height', 'loading': 'lazy', 'confidence': 0.7}], 'rank': 1}, {'url': 'https://www.team-bhp.com/news/2024-mahindra-xuv-3xo-review-8-pros-7-cons', 'content': \"2024 Mahindra XUV 3XO Review : 8 Pros & 7 Cons | Team-BHP Skip to main content About Us | Advertise | Contact Us Forum Hot Threads News Reviews Photos Buy Used Car Spare Parts Buy Accessories Classifieds Store News 2024 Mahindra XUV 3XO Review : 8 Pros & 7 Cons 8th May 2024, 12:20 by Omkar Shendge View Forum Discussion It gets a refreshed exterior, some changes to the interiors, quite a few feature additions and a new 6-speed Aisin-sourced automatic gearbox for its petrol engines. Mahindra XUV 3XO Pros A truly premium crossover. Nice build, quality & refinement levels Cabin has enough space for 5. Quality-wise, the interior is more like a Hyundai Fantastic petrol & diesel engine line-up; they offer fast performance & good driveability Finally gets a smooth torque converter automatic with the turbo-petrol engines Wide variant spread ensures there's something for everyone A compliant ride with sorted road manners 5-star NCAP rating & kit. Level 2 ADAS, 6 airbags, ESP, ABS, all-wheel disc brakes, TPMS, seatbelt reminders for all & more Loaded to the gills with equipment (360-degree camera, big sunroof, drive modes, Harman Kardon audio system, wireless smartphone connectivity, auto headlamps & wipers etc.) Mahindra XUV 3XO Cons The new edgy & outlandish design may not be to everyone's liking. Some love it, some don't. It is very polarizing Top-end variants are expensive. Not overpriced, but definitely higher than expected 295-liter boot is the smallest in the segment. There are cheaper hatchbacks that have a larger boot No proper diesel automatic option, just a jerky AMT which has no place in a premium crossover Light & disconnected steering is the biggest drawback in a competent handling package Mahindra's after-sales service quality is a hit or miss. Remains a gamble Some important features missing (ventilated seats, parcel tray, full-sized spare wheel, paddle shifters etc.) Read Team-BHP's detailed Mahindra XUV 3XO Review View Forum Discussion Tags: Indian Mahindra Launches & Updates Mahindra XUV 3XO Back to Index Next Article Related News Mahindra XUV 3XO RevX edition launch soon; details revealed Mahindra XUV 3XO REVX Series launched at Rs 8.94 lakh 10,000 km with my Mahindra XUV 3X0: Service & ownership recap Booked Mahindra XUV 3XO AX5 over Skoda Kylaq Signature Plus: Here's why Improving my Mahindra XUV 3XO AX5L's audio setup with a 2-stage upgrade Find Car News By Brand Any Brand Audi BMW BYD Chevrolet Citroen Datsun Ferrari Fiat Force Ford HM Honda Hyundai Isuzu Jaguar Jeep Kia Lamborghini Land Rover Lexus Lotus Mahindra Maruti Suzuki McLaren Mercedes-Benz MG Mini Mitsubishi Nissan Porsche Premier Renault Rolls-Royce Skoda Tata Tesla Toyota VinFast Volkswagen Volvo Or By Category Any Category 2-Wheels Commercial Vehicles Industry & Policy Launches & Updates Member Content Motorsports Other Sales & Analysis Scoops & Rumours Just News Kinetic to launch retro-styled electric scooter on July 28 Porsche Cayenne Black Edition launched at Rs 1.80 crore 2025 Aprilia SR 125 launched at Rs 1.20 lakh Maruti Suzuki e Vitara to be launched on September 3 Honda Shine-based electric bike in the works; patent filed Keeway RR 300 launched at Rs 1.99 lakh Ford unveils Bronco EV & plug-in hybrid models for China Mercedes-AMG CLE 53 Coupe to be launched on August 12 Han's Mazda RX-7 from Tokyo Drift sold for 1.2 million USD Range Rover Velar Autobiography launched at Rs 89.90 lakh Tata rolls out 6 lakh units of the Punch in less than 4 years BMW 2 Series Gran Coupe launched at Rs 46.90 lakh Team-BHP.com Advice Classifieds Forum Hot Threads News Photos Reviews Road Safety Store Tech Stuff About Us Overview The Team Key Features Philosophy History Contact Us Speak Share Advertise Copyright 2025 - www.team-bhp.com Site Map | Privacy Policy | Terms & Conditions Team-BHP's Daily Newsletter View recent samples Hero Vida VX2 Buy & Sell USED CARS Rs. 2 Lakhs or less Rs. 2 - 4 Lakhs Rs. 4 - 6 Lakhs Rs. 6 - 8 Lakhs Rs. 8 Lakhs or more Hot Threads L\", 'images': [{'url': 'https://www.team-bhp.com/sites/default/files/styles/check_extra_large_for_review/public/2024_mahindra_xuv3xo_exterior_01_0.jpg', 'alt_text': '2024 Mahindra XUV 3XO Review : 8 Pros & 7 Cons', 'confidence': 0.7999999999999999}, {'url': 'https://www.team-bhp.com/sites/default/files/styles/check_extra_large_for_review/public/2024_mahindra_xuv3xo_interior_01.jpg', 'alt_text': '2024 Mahindra XUV 3XO Review : 8 Pros & 7 Cons', 'confidence': 0.7999999999999999}, {'url': 'https://www.team-bhp.com/sites/default/files/styles/check_extra_large_for_review/public/2024_mahindra_xuv3xo_interior_20.jpg', 'alt_text': '2024 Mahindra XUV 3XO Review : 8 Pros & 7 Cons', 'confidence': 0.7999999999999999}, {'url': 'https://www.team-bhp.com/sites/default/files/styles/check_extra_large_for_review/public/2024_mahindra_xuv3xo_interior_27.jpg', 'alt_text': '2024 Mahindra XUV 3XO Review : 8 Pros & 7 Cons', 'confidence': 0.7999999999999999}, {'url': 'https://www.team-bhp.com/sites/default/files/styles/check_thumb_review_detail/public/2024_mahindra_xuv3xo_exterior_01_0.jpg', 'alt_text': '2024 Mahindra XUV 3XO Review : 8 Pros & 7 Cons', 'confidence': 0.7999999999999999}], 'rank': 2}, {'url': 'https://www.autocarindia.com/car-reviews/mahindra-xuv-3xo-review-feature-and-power-packed-compact-suv-431439', 'content': \"Mahindra XUV300, XUV 3XO review, design, interior, features, performance, first drive - Introduction | Autocar India All All Price News Reviews Features Specifications Images Videos All All Price News Reviews Features Specifications Images Videos Signup Login Find a Car Cars Compare Cars New Cars Upcoming Cars Car Price Car Loan Calculator Find a Bike Bikes Compare Bikes New New Bikes New Scooters Upcoming Upcoming Bikes Upcoming Scooters Electric Electric Bikes Electric Scooters Bike Price Bike Loan Calculator News Cars Bikes Motorsports Industry Marketplace Reviews Car First drive / Reviews Comparisons Video reviews Long-term reviews Bike First ride / Reviews Comparisons Video reviews Long-term reviews Features Features Travelogues Blogs Interviews Partner Content Galleries Videos Images Stories Advice Signup Login Home Car Reviews Mahindra XUV 3XO review - Feature and power packed compact SUV Mahindra XUV 3XO review - Feature and power packed compact SUV Out goes the Mahindra XUV300 and in comes the XUV 3XO. The new name is just the starting point of a very comprehensive upgrade. Updated on May 02, 2024 05:35:55 PM 87,048 Views Follow us on The XUV 3XO's styling is big on flash The diamond-shaped detailing on the lights and grille are a nice touch. The infotainment is now a 10.25-inch unit and works well. By Nikhil Bhatia Share - Make : Mahindra Model : XUV 3XO We Like Upmarket interior Strong engines Long equipment list We Don't Like Boot space Competent as the Mahindra XUV300 was, it never quite made it to the list of compact SUV bestsellers. Mahindra is now gunning for glory with the updated XUV300, christened the XUV 3XO. Mind you, this is no run-of-the-mill nip and tuck update. Mahindra has gone all out with a new look, redone interior, some class-first feature introductions, some class-best specifications and very enticing pricing. The aim is to take the fight to the Tata Nexon, Maruti Brezza, Kia Sonet and Hyundai Venue, and win. Mahindra XUV 3XO: design and styling Where the XUV300s styling was understated, the XUV 3XO is big on flash. Giving the 3XO its distinctive face are the large, new vertically oriented headlights outlined by C-shaped DRLs (a link to the larger XUV700). The headlights are split into two sections with a concealed projector unit up top, and an open projector fog lamp unit lower down, both set amidst a black surround. The lights flank the new grille, which is actually a gloss panel that runs much of the XUVs width. The new front bumper with its pronounced cuts and creases is very concept car-like and the newly contoured bonnet also does its bit to add volume to the design. New C-shaped LED DRLs provide a visual link with the larger XUV700. Like the XUV300, the 3XO looks muscular in profile, and furthering the impression are the stylish new 17-inch diamond cut alloy wheels that are the largest in the segment. Theres also chunkier side cladding with cuts at the wheel arches. Mahindra says ground clearance is a generous 201mm, up from the XUV300s figure of 180mm. Mahindra XUV 3XO Price, Mileage, Specifications, Features and Variants Brand Mahindra Model Name XUV 3XO Mahindra XUV 3XO Price 9.06 - 18.39 lakh Mahindra XUV 3XO Range/Mileage Petrol : 17.96 - 20.1kpl | Diesel : 20.6 - 21.2kpl Mahindra XUV 3XO Specifications SUV | 5 doors | 5 seats View All Specs Mahindra XUV 3XO Features LED headlight | 10.25-inch Touchscreen display | 6 airbags View All Features Mahindra XUV 3XO Variants MX1 1.2 Petrol MT | REVX M 1.2 Petrol MT | REVX M (O) 1.2 Petrol MT View All Variants In its basic shape though, the 3XO is no different than the XUV300. The 2,600mm wheelbase remains class best, but the short overhangs, particularly at the back, tell you that this is a vehicle that's brutally shortened (remember it started life as a SsangYong Tivoli) to get length under the critical 4m mark, needed to qualify as a small car and hence a lower rate of tax. New 17-inch alloys are the largest in the segment. At the back, y\", 'images': [{'url': 'https://img.autocarindia.com/ExtraImages/20240502111525_First Drive 3XO Web.001.jpeg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO review', 'title': 'Mahindra XUV 3XO review', 'class': 'img-fluid', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/ExtraImages/20240502012130_First Drive 3XO Web.008.jpeg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO front quarter', 'title': 'Mahindra XUV 3XO front quarter', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/ExtraImages/20240502012130_First Drive 3XO Web.014.jpeg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO review - Feature and power packed compact SUV', 'title': 'Mahindra XUV 3XO review - Feature and power packed compact SUV', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/ExtraImages/20240502012130_First Drive 3XO Web.016.jpeg?w=700&c=1', 'alt_text': 'Mahindra XUV 3XO review - Feature and power packed compact SUV', 'title': 'Mahindra XUV 3XO review - Feature and power packed compact SUV', 'class': 'img-fluid', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://img.autocarindia.com/model/uploads/modelimages/Mahindra-XUV-3XO-290420241902.jpg', 'alt_text': 'Latest Image of Mahindra XUV 3XO', 'title': 'Mahindra XUV 3XO', 'class': 'img-fluid wid-img', 'loading': 'lazy', 'confidence': 0.7999999999999999}], 'rank': 3}, {'url': 'https://www.carwale.com/mahindra-cars/xuv-3xo/', 'content': \"Mahindra XUV 3XO Price - Images, Colours & Reviews - CarWale NEW CARS USED CARS REVIEWS & NEWS AD Mahindra XUV 3XO 3.9 Expert Rating | 4.6 User Rating (557) Rate & Win The Mahindra XUV 3XO offers a sorted ride and engaging drive, ample space, and modern-day equipment. While its boot space is limited, it isn't a deal-breaker, especially considering the compact SUVs attractive pricing. It is available with both petrol and diesel power. Overview 360 View Variants Offers Similar Cars Colours Brochure Mileage User Reviews News Expert Reviews Videos Images FAQs Colours Images View Variant Select Variant City Show price in my city Rs. 7.99 - 15.80 Lakh XUV 3XO On Road Price Ex-Showroom price, Mumbai Calculate your EMI EMI Calculator Get July Offers 4 Things to Know About XUV 3XO Has projector headlamps, 17-inch alloys and a 360-degree camera. The instrument cluster is fully digital with customisable screens. Top-spec versions get dual-zone climate control with rear AC vents. One of the USPs of the Mahindra XUV 3XO is level-2 ADAS Mahindra XUV 3XO Price Mahindra XUV 3XO price for the base model starts at Rs. 7.99 Lakh and the top model price goes upto Rs. 15.80 Lakh (Avg. ex-showroom). XUV 3XO price for 29 variants is listed below. Filter By Fuel type & Transmission Petrol Diesel Manual Automatic (TC) Automatic (AMT) Variants Ex-Showroom price Compare XUV 3XO MX1 1.2 Petrol 1197 cc, Petrol, Manual, 18.89 kmpl, 110 bhp Rs. 7.99 Lakh Compare View Price Breakup Get Offers Just Launched XUV 3XO REVX M 1.2 Petrol 1197 cc, Petrol, Manual, 110 bhp Rs. 8.94 Lakh Compare View Price Breakup Get Offers Just Launched XUV 3XO REVX M (O)1.2 Petrol 1197 cc, Petrol, Manual, 110 bhp Rs. 9.44 Lakh Compare View Price Breakup Get Offers XUV 3XO MX2 Pro 1.2 Petrol 1197 cc, Petrol, Manual, 18.89 kmpl, 110 bhp Rs. 9.54 Lakh Compare View Price Breakup Get Offers XUV 3XO MX3 1.2 Petrol 1197 cc, Petrol, Manual, 18.89 kmpl, 110 bhp Rs. 9.74 Lakh Compare View Price Breakup Get Offers XUV 3XO MX3 Pro 1.2 Petrol 1197 cc, Petrol, Manual, 18.89 kmpl, 110 bhp Rs. 9.99 Lakh Compare View Price Breakup Get Offers XUV 3XO MX2 1.5 Diesel 1497 cc, Diesel, Manual, 20.6 kmpl, 115 bhp Rs. 9.99 Lakh Compare View Price Breakup Get Offers XUV 3XO MX2 Pro 1.2 Petrol AT 1197 cc, Petrol, Automatic (TC), 17.96 kmpl, 110 bhp Rs. 10.54 Lakh Compare View Price Breakup Get Offers XUV 3XO MX2 Pro 1.5 Diesel 1497 cc, Diesel, Manual, 20.6 kmpl, 115 bhp Rs. 10.64 Lakh Compare View Price Breakup Get Offers XUV 3XO AX5 1.2 Petrol 1197 cc, Petrol, Manual, 18.89 kmpl, 110 bhp Rs. 10.99 Lakh Compare View Price Breakup Get Offers XUV 3XO MX3 1.5 Diesel 1497 cc, Diesel, Manual, 20.6 kmpl, 115 bhp Rs. 10.99 Lakh Compare View Price Breakup Get Offers XUV 3XO MX3 1.2 Petrol AT 1197 cc, Petrol, Automatic (TC), 17.96 kmpl, 110 bhp Rs. 11.40 Lakh Compare View Price Breakup Get Offers XUV 3XO MX3 Pro 1.5 Diesel 1497 cc, Diesel, Manual, 20.6 kmpl, 115 bhp Rs. 11.56 Lakh Compare View Price Breakup Get Offers XUV 3XO MX3 Pro 1.2 Petrol AT 1197 cc, Petrol, Automatic (TC), 17.96 kmpl, 110 bhp Rs. 11.69 Lakh Compare View Price Breakup Get Offers XUV 3XO MX3 1.5 Diesel Autoshift Plus 1497 cc, Diesel, Automatic (AMT), 21.2 kmpl, 115 bhp Rs. 11.79 Lakh Compare View Price Breakup Get Offers Just Launched XUV 3XO REVX A 1.2 Petrol MT 1197 cc, Petrol, Manual, 129 bhp Rs. 11.79 Lakh Compare View Price Breakup Get Offers XUV 3XO AX5 1.5 Diesel 1497 cc, Diesel, Manual, 20.6 kmpl, 115 bhp Rs. 12.19 Lakh Compare View Price Breakup Get Offers XUV 3XO AX5 1.2 Petrol AT 1197 cc, Petrol, Automatic (TC), 17.96 kmpl, 110 bhp Rs. 12.49 Lakh Compare View Price Breakup Get Offers XUV 3XO AX5L 1.2 Petrol 1197 cc, Petrol, Manual, 20.1 kmpl, 129 bhp Rs. 12.62 Lakh Compare View Price Breakup Get Offers XUV 3XO AX7 1.2 Petrol 1197 cc, Petrol, Manual, 20.1 kmpl, 129 bhp Rs. 12.80 Lakh Compare View Price Breakup Get Offers XUV 3XO AX5 1.5 Diesel Autoshift Plus 1497 cc, Diesel, Automatic (AMT), 21.2 kmpl, 115 bhp Rs. 12.99 Lakh Compare\", 'images': [{'url': 'https://imgd.aeplcdn.com/664x374/n/cw/ec/156405/xuv-3xo-exterior-right-front-three-quarter-34.jpeg?isig=0&q=80', 'alt_text': 'Mahindra XUV 3XO Right Front Three Quarter', 'title': 'Mahindra XUV 3XO Right Front Three Quarter', 'class': 'o-D o-hP o-iB o-iT o-G o-Q o-a0 o-aa o-hl o-ed', 'loading': 'eager', 'confidence': 0.7999999999999999}, {'url': 'https://imgd.aeplcdn.com/664x374/n/cw/ec/156405/xuv-3xo-exterior-right-front-three-quarter-32.jpeg?isig=0&q=80', 'alt_text': 'Mahindra XUV 3XO Right Front Three Quarter', 'title': 'Mahindra XUV 3XO Right Front Three Quarter', 'class': 'o-D o-hP o-iB o-iT o-G o-Q o-a0 o-aa o-hl o-ed', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://imgd.aeplcdn.com/664x374/n/cw/ec/156405/xuv-3xo-exterior-left-rear-three-quarter.jpeg?isig=0&q=80', 'alt_text': 'Mahindra XUV 3XO Left Rear Three Quarter', 'title': 'Mahindra XUV 3XO Left Rear Three Quarter', 'class': 'o-D o-hP o-iB o-iT o-G o-Q o-a0 o-aa o-hl o-ed', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://imgd.aeplcdn.com/664x374/n/cw/ec/156405/xuv-3xo-exterior-left-side-view.jpeg?isig=0&q=80', 'alt_text': 'Mahindra XUV 3XO Left Side View', 'title': 'Mahindra XUV 3XO Left Side View', 'class': 'o-D o-hP o-iB o-iT o-G o-Q o-a0 o-aa o-hl o-ed', 'loading': 'lazy', 'confidence': 0.7999999999999999}, {'url': 'https://imgd.aeplcdn.com/664x374/n/cw/ec/156405/xuv-3xo-exterior-front-view-39.jpeg?isig=0&q=80', 'alt_text': 'Mahindra XUV 3XO Front View', 'title': 'Mahindra XUV 3XO Front View', 'class': 'o-D o-hP o-iB o-iT o-G o-Q o-a0 o-aa o-hl o-ed', 'loading': 'lazy', 'confidence': 0.7999999999999999}], 'rank': 4}, {'url': 'https://www.spinny.com/cars/mahindra/xuv-3xo/', 'content': \"Mahindra XUV 3XO - Complete Overview of Features, Pricing and Reviews Buy car View all cars Used cars in Delhi NCR Used cars in Bangalore Used cars in Hyderabad Used cars in Mumbai Used cars in Pune Used cars in Delhi Used cars in Gurgaon Used cars in Noida Used cars in Ahmedabad Used cars in Chennai Used cars in Kolkata Used cars in Lucknow Used cars in Jaipur Used cars in Chandigarh Used cars in Coimbatore Used cars in Faridabad Used cars in Ghaziabad Used cars in Karnal Used cars in Kochi Used cars in Sonipat Used cars in Visakhapatnam Sell car Sell Car Online Sell cars in Ahmedabad Sell cars in Bangalore Sell cars in Chennai Sell cars in Delhi Sell cars in Gurgaon Sell cars in Hyderabad Sell cars in Kolkata Sell cars in Mumbai Sell cars in Noida Sell cars in Pune Sell cars in Lucknow Sell cars in Jaipur Sell Scrap Car More About Us About Spinny Investor Relations Car Finance Check your eligibility Know your EMI Spinny Finance process Pro Service How it Works Car buying process Car selling process Pricing Car Hub Locations Blog Customer Reviews Scrap Car Car valuation Check eChallan Check RTO Details Recharge FASTag Spinny Assured The sure road to Car Joy Spinny BuyBack Commit less, Drive more Spinny Partners Drive your business ahead Pro Service Hassle free car service Spinny Insurance Hassle free car insurance Shortlisted Account Your Account Call us at 727-727-7275 Overview Specs & Features Pricing & Variants Expert's Review User's Review F.A.Qs Colours Best Used Cars Images & Videos Home Cars Mahindra XUV 3XO 9 Colors 40 Images Mahindra XUV 3XO Overview The Mahindra XUV 3XO is a compact SUV that seamlessly blends bold design with advanced technology. Its dynamic styling, spacious interiors, and feature-rich offerings make it a compelling choice for modern urban drivers. Whether navigating city streets or embarking on weekend getaways, the XUV 3XO delivers a comfortable and engaging driving experience. Mahindra XUV 3XO Specifications & Features Ground clearance -- Wheelbase 2600 Boot space 364 Acceleration (0-100 kmph) -- Transmission type Manual Displacement 1497 Max power (bhp) 115 bhp@3750rpm Mileage (ARAI) 20.6 Fuel Type diesel Mahindra XUV 3XO Key Features Versatile Powertrain Options Advanced Safety Features Premium Interior and Comfort Modern Exterior Design View All SPECS & FEATURES Mahindra XUV 3XO Pricing & Variants In the Indian used car market, the Mahindra XUV 3XO is available across a range of prices, influenced by factors such as model year, variant, and condition. Prices typically start around 7.99 lakh for earlier models and can go up to 15.56 lakh for newer, top-tier variants . This range offers options for various budgets, making the XUV 3XO an attractive choice for those seeking a reliable and stylish compact SUV. Popular Variants On-Road Price * in Delhi No Variants Found Get The Best Used Cars In Your Budget 1 - 2 Lakh 2 - 4 Lakh 4 - 6 Lakh 6 - 10 Lakh Mahindra XUV 3XO Expert's Review 4.0 The Mahindra XUV 3XO emerges as a significant evolution in the subcompact SUV segment, building upon the foundation laid by its predecessor, the XUV300. With a bold new design, enhanced features, and advanced safety technologies, the XUV 3XO aims to cater to the modern urban driver. Under the hood, it offers a choice of efficient petrol and diesel engines, paired with both manual and automatic transmissions, ensuring versatility for various driving preferences. Inside, the cabin boasts a contemporary layout with a 10.25-inch touchscreen infotainment system, digital instrument cluster, and a panoramic sunroof, elevating the overall driving experience. In this expert review, we delve into the XUV 3XO's offerings to assess its position in the competitive compact SUV market. Exterior Design 4/5 Paint Quality 4/5 Panel Gaps 4/5 Interior Design 4/5 Space 4/5 Comfort 4/5 Safety No. of Airbags 4 Features 4/5 Performance Stability 4/5 Eng. Response 4/5 Clutch & Gears 4/5 Read Full Review Pros & Cons of Mahindra XUV 3XO Pro\", 'images': [{'url': 'https://media.spinny.com/sp-file-system/public/2025-02-07/df136fb0d64b4fa6a4bc999b2cf16909/file.JPG?q=85', 'alt_text': 'New Mahindra XUV 3XO exterior LEFT FRONT CORNER VIEW', 'class': 'Image__animateOpacity ImageSlider__img', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://media.spinny.com/sp-file-system/public/2025-02-07/850a1fe3537041e38fad4e1f956446fb/file.JPG?q=85', 'alt_text': 'New Mahindra XUV 3XO exterior LEFT SIDE VIEW', 'class': 'Image__animateOpacity ImageSlider__img', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://media.spinny.com/sp-file-system/public/2025-02-07/df136fb0d64b4fa6a4bc999b2cf16909/file.JPG?q=85', 'alt_text': 'New Mahindra XUV 3XO exterior LEFT FRONT CORNER VIEW', 'class': 'Image__animateOpacity ImageSlider__img', 'loading': 'eager', 'confidence': 0.7}, {'url': 'https://mda.spinny.com/sp-file-system/public/2025-04-21/2e54d4e30d2b4bb18fd31a8c92d78e06/raw/file.png', 'alt_text': 'New Mahindra XUV 3XO Everest White', 'class': 'ColorOptions__currentCarDisplayContainerImage', 'confidence': 0.7}, {'url': 'https://mda.spinny.com/sp-file-system/public/2025-04-21/e9939be9416447e69d92aa3591b2edb6/raw/file.png', 'alt_text': 'New Mahindra XUV 3XO Citrine Yellow', 'class': 'ColorOptions__currentCarDisplayContainerImage', 'confidence': 0.7}], 'rank': 5}, {'url': 'https://autotorque.in/mahindra-xuv-3xo-review-a-comprehensive-analysis-of-features-and-performance/', 'content': '[not extracted] Content limit reached', 'rank': 6}, {'url': 'https://whatinsider.com/mahindra-xuv-3xo/', 'content': '[not extracted] Content limit reached', 'rank': 7}, {'url': 'https://passengercars.caimahindra.com/new-cars/mahindra-xuv-3xo/specification.html', 'content': '[not extracted] Content limit reached', 'rank': 8}]",
                      "annotations": null
                    }
                  ]
                },
                "created_files": [],
                "execution_time": 7.026652300031856,
                "error": null,
                "successful_variant": "CODE_1",
                "total_variants_tried": 1,
                "all_errors": []
              },
              "total_time": 7.032291500014253,
              "error": null
            }
          }
        },
        {
          "iteration": 2,
          "output": null
        }
      ],
      "call_self_used": true,
      "total_iterations": 2
    },
    {
      "id": "T002",
      "description": "Analyze the retrieved information to identify and categorize the luxury and safety features of the Mahindra XUV 3XO.",
      "agent": "ThinkerAgent",
      "agent_prompt": "Analyze the information gathered in the previous step (T001) to identify and categorize all luxury and safety features of the Mahindra XUV 3XO. Provide detailed descriptions of each feature and their functionalities.",
      "reads": [
        "T001"
      ],
      "writes": [
        "T002"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    },
    {
      "id": "T003",
      "description": "Create a comprehensive report detailing the features of the Mahindra XUV 3XO, with a detailed analysis of the luxury and safety features. The report should be well-structured, visually appealing, and easy to read.",
      "agent": "FormatterAgent",
      "agent_prompt": "Using the information gathered in T001 and the analysis from T002, create a comprehensive report detailing the features of the Mahindra XUV 3XO. The report should include a detailed analysis of the luxury and safety features, with clear descriptions and functionalities. The report must be well-structured, visually appealing (using markdown), and easy to read. Include tables or bullet points to highlight key features.",
      "reads": [
        "T001",
        "T002"
      ],
      "writes": [
        "T003"
      ],
      "status": "pending",
      "output": null,
      "error": null,
      "cost": 0.0,
      "start_time": null,
      "end_time": null,
      "execution_time": 0.0
    }
  ],
  "links": [
    {
      "source": "ROOT",
      "target": "T001"
    },
    {
      "source": "T001",
      "target": "T002"
    },
    {
      "source": "T002",
      "target": "T003"
    }
  ]
}